// export const baseUrl: string = import.meta.env.VITE_APP_BASE_URL || './';
export const baseUrl: string = './';
export const tianganList: string[] = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
export const dizhiList: string[] = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const shengxiaoList: string[] = ['鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪'];

type WuXingElements = "木" | "火" | "土" | "金" | "水";
type TianGanElements = '甲' | '乙' | '丙' | '丁' | '戊' | '己' | '庚' | '辛' | '壬' | '癸';
type DiZhiElements = '子' | '丑' | '寅' | '卯' | '辰' | '巳' | '午' | '未' | '申' | '酉' | '戌' | '亥';
type YinYangElements = '阳'|'阴'|'混';

export type rulesTypes = '感情'|'财富'|'健康'|'亲人'|'运势'|'工作'

export const yimaArr = ['寅', '申', '巳', '亥']
export const taohuaArr = ['子', '午', '卯', '酉']
export const mukuArr = ['辰', '戌', '丑', '未']

export const chunDiZhi = ['寅', '卯', '辰']
export const xiaDiZhi  = ['巳', '午', '未']
export const qiuDiZhi  = ['申', '酉', '戌']
export const dongDiZhi = ['子', '丑', '亥']

 

export const tianganWuXing:{[key in TianGanElements]:WuXingElements} = {
    甲: '木',
    乙: '木',
    丙: '火',
    丁: '火',
    戊: '土',
    己: '土',
    庚: '金',
    辛: '金',
    壬: '水',
    癸: '水'
}

export const dizhiWuXing:{[key in DiZhiElements]:WuXingElements} = {
    子: '水',
    丑: '土',
    寅: '木',
    卯: '木',
    辰: '土',
    巳: '火',
    午: '火',
    未: '土',
    申: '金',
    酉: '金',
    戌: '土',
    亥: '水'
}

export const tianganYinYang:{[key in TianGanElements]:YinYangElements} = {
    甲: '阳',
    乙: '阴',
    丙: '阳',
    丁: '阴',
    戊: '阳',
    己: '阴',
    庚: '阳',
    辛: '阴',
    壬: '阳',
    癸: '阴'
}

export const dizhiYinYang:{[key in DiZhiElements]:YinYangElements} = {
    子: '阳',
    丑: '阴',
    寅: '阳',
    卯: '阴',
    辰: '阳',
    巳: '阴',
    午: '阳',
    未: '阴',
    申: '阳',
    酉: '阴',
    戌: '阳',
    亥: '阴'
}

// 地支子，辰，巳，午，戌，亥，由于地支与藏干阴阳不一致，
// 阴中有阳，阳中有阴，故而属于不阴不阳的两面派（如同太监或人妖),
// 而地支中只有 寅，申           为纯阳（地支与藏干皆为阳），
// 地支       丑，卯，未，酉为阴，藏干也全为阴，故为纯阴。
export const tianganChunYinYang:{[key in TianGanElements]:YinYangElements} = {
    甲: '阳',
    乙: '阴',
    丙: '阳',
    丁: '阴',
    戊: '阳',
    己: '阴',
    庚: '阳',
    辛: '阴',
    壬: '阳',
    癸: '阴'
}

export const dizhiChunYinYang:{[key in DiZhiElements]:YinYangElements} = {
    子: '混', 
    丑: '阴',  //
    寅: '阳', //
    卯: '阴',  //
    辰: '混',
    巳: '混',
    午: '混',
    未: '阴', //
    申: '阳', //
    酉: '阴', //
    戌: '混',
    亥: '混'
}

// 木火为阳，金水为阴，燥土为阳，湿土为阴 
// 甲乙寅卯木、丙丁巳午火、戊戌未土为阳
// 庚辛申酉金、壬癸亥子水、己辰丑土为阴
export const tianganShuHuoYinYang:{[key in TianGanElements]:YinYangElements} = {
    甲: '阳',
    乙: '阳',
    丙: '阳',
    丁: '阳',
    戊: '阳',
    己: '阴',
    庚: '阴',
    辛: '阴',
    壬: '阴',
    癸: '阴'
}

export const dizhiShuHuoYinYang:{[key in DiZhiElements]:YinYangElements} = {
    子: '阴', 
    丑: '阴',  //
    寅: '阳', //
    卯: '阳',  //
    辰: '阴',
    巳: '阳',
    午: '阳',
    未: '阴', //
    申: '阴', //
    酉: '阴', //
    戌: '阳',
    亥: '阴'
}





export const guanxi = {
    子子: '值太岁',
    丑丑: '值太岁',
    寅寅: '值太岁',
    卯卯: '值太岁',
    巳巳: '值太岁',
    未未: '值太岁',
    申申: '值太岁',
    戌戌: '值太岁',
    子卯: '刑太岁',
    丑戌: '刑太岁(丑戌未三刑)',
    辰辰: '刑太岁(值)',
    午午: '刑太岁(值)',
    酉酉: '刑太岁(值)',
    亥亥: '刑太岁(值)',
    子午: '冲太岁',
    卯酉: '冲太岁',
    寅申: '冲太岁(寅巳申三刑)',
    巳亥: '冲太岁',
    辰戌: '冲太岁',
    丑未: '冲太岁(丑戌未三刑)',
    子未: '害太岁',
    丑午: '害太岁',
    寅巳: '害太岁(寅巳申三刑)',
    卯辰: '害太岁',
    申亥: '害太岁',
    酉戌: '害太岁',
    子酉: '破太岁',
    卯午: '破太岁',
    辰丑: '破太岁',
    寅亥: '破太岁',
    巳申: '破太岁(寅巳申三刑)',
    未戌: '破太岁(丑戌未三刑)'
};


export const wangshuai = {
    寅卯: ['木旺', '火相', '水休', '金囚', '土死'],
    巳午: ['火旺', '土相', '木休', '水囚', '金死'],
    申酉: ['金旺', '水相', '土休', '火囚', '木死'],
    亥子: ['水旺', '木相', '金休', '土囚', '火死'],
    辰戌丑未: ['土旺', '金相', '火休', '木囚', '水死']
};

// export const colorList: string[] = ['orange', 'green', 'blue', 'red', 'brown'];
export const colorList: string[] = ['#2eaa51', '#ef4436', '#a17323', '#f9bb05', '#4286f7'];

export const wuxingcolorList={
    木:'#2eaa51',
    火:'#ef4436',
    土:'#a17323',
    金:'#f9bb05',
    水:'#4286f7'
};

export const yinyangcolorList={
    阴:'#d5dbe6',
    阳:'#e63946',
    混:'#a17323'    
};



export const wuxingLabelList: string[] = ['木', '火', '土', '金', '水',];

export const shishenDizhi = {
    甲: {
        子: '正印',
        丑: '正财',
        寅: '比肩',
        卯: '劫财',
        辰: '偏财',
        巳: '伤官',
        午: '食神',
        未: '正财',
        申: '七杀',
        酉: '正官',
        戌: '偏财',
        亥: '偏印'
    },
    乙: {
        子: '偏印',
        丑: '偏财',
        寅: '劫财',
        卯: '比肩',
        辰: '正财',
        巳: '食神',
        午: '伤官',
        未: '偏财',
        申: '正官',
        酉: '七杀',
        戌: '正财',
        亥: '正印'
    },
    丙: {
        子: '正官',
        丑: '伤官',
        寅: '偏印',
        卯: '正印',
        辰: '食神',
        巳: '劫财',
        午: '比肩',
        未: '伤官',
        申: '偏财',
        酉: '正财',
        戌: '食神',
        亥: '七杀'
    },
    丁: {
        子: '七杀',
        丑: '食神',
        寅: '正印',
        卯: '偏印',
        辰: '伤官',
        巳: '比肩',
        午: '劫财',
        未: '食神',
        申: '正财',
        酉: '偏财',
        戌: '伤官',
        亥: '正官'
    },
    戊: {
        子: '正财',
        丑: '劫财',
        寅: '七杀',
        卯: '正官',
        辰: '比肩',
        巳: '正印',
        午: '偏印',
        未: '劫财',
        申: '食神',
        酉: '伤官',
        戌: '比肩',
        亥: '偏财'
    },
    己: {
        子: '偏财',
        丑: '比肩',
        寅: '正官',
        卯: '七杀',
        辰: '劫财',
        巳: '偏印',
        午: '正印',
        未: '比肩',
        申: '伤官',
        酉: '食神',
        戌: '劫财',
        亥: '正财'
    },
    庚: {
        子: '伤官',
        丑: '正印',
        寅: '偏财',
        卯: '正财',
        辰: '偏印',
        巳: '七杀',
        午: '正官',
        未: '正印',
        申: '比肩',
        酉: '劫财',
        戌: '偏印',
        亥: '食神'
    },
    辛: {
        子: '食神',
        丑: '偏印',
        寅: '正财',
        卯: '偏财',
        辰: '正印',
        巳: '正官',
        午: '七杀',
        未: '偏印',
        申: '劫财',
        酉: '比肩',
        戌: '正印',
        亥: '伤官'
    },
    壬: {
        子: '劫财',
        丑: '正官',
        寅: '食神',
        卯: '伤官',
        辰: '七杀',
        巳: '正财',
        午: '偏财',
        未: '正官',
        申: '偏印',
        酉: '正印',
        戌: '七杀',
        亥: '比肩'
    },
    癸: {
        子: '比肩',
        丑: '七杀',
        寅: '伤官',
        卯: '食神',
        辰: '正官',
        巳: '偏财',
        午: '正财',
        未: '七杀',
        申: '正印',
        酉: '偏印',
        戌: '正官',
        亥: '劫财'
    }
};

export const shishenTiangan = {
    甲: {
        甲: '比肩',
        乙: '劫财',
        丙: '食神',
        丁: '伤官',
        戊: '偏财',
        己: '正财',
        庚: '七杀',
        辛: '正官',
        壬: '偏印',
        癸: '正印'
    },
    乙: {
        甲: '劫财',
        乙: '比肩',
        丙: '伤官',
        丁: '食神',
        戊: '正财',
        己: '偏财',
        庚: '正官',
        辛: '七杀',
        壬: '正印',
        癸: '偏印'
    },
    丙: {
        甲: '偏印',
        乙: '正印',
        丙: '比肩',
        丁: '劫财',
        戊: '食神',
        己: '伤官',
        庚: '偏财',
        辛: '正财',
        壬: '七杀',
        癸: '正官'
    },
    丁: {
        甲: '正印',
        乙: '偏印',
        丙: '劫财',
        丁: '比肩',
        戊: '伤官',
        己: '食神',
        庚: '正财',
        辛: '偏财',
        壬: '正官',
        癸: '七杀'
    },
    戊: {
        甲: '七杀',
        乙: '正官',
        丙: '偏印',
        丁: '正印',
        戊: '比肩',
        己: '劫财',
        庚: '食神',
        辛: '伤官',
        壬: '偏财',
        癸: '正财'
    },
    己: {
        甲: '正官',
        乙: '七杀',
        丙: '正印',
        丁: '偏印',
        戊: '劫财',
        己: '比肩',
        庚: '伤官',
        辛: '食神',
        壬: '正财',
        癸: '偏财'
    },
    庚: {
        甲: '偏财',
        乙: '正财',
        丙: '七杀',
        丁: '正官',
        戊: '偏印',
        己: '正印',
        庚: '比肩',
        辛: '劫财',
        壬: '食神',
        癸: '伤官'
    },
    辛: {
        甲: '正财',
        乙: '偏财',
        丙: '正官',
        丁: '七杀',
        戊: '正印',
        己: '偏印',
        庚: '劫财',
        辛: '比肩',
        壬: '伤官',
        癸: '食神'
    },
    壬: {
        甲: '食神',
        乙: '伤官',
        丙: '偏财',
        丁: '正财',
        戊: '七杀',
        己: '正官',
        庚: '偏印',
        辛: '正印',
        壬: '比肩',
        癸: '劫财'
    },
    癸: {
        甲: '伤官',
        乙: '食神',
        丙: '正财',
        丁: '偏财',
        戊: '正官',
        己: '七杀',
        庚: '正印',
        辛: '偏印',
        壬: '劫财',
        癸: '比肩'
    }
};


