//五行的颜色与显示
export const ELEMENT = {
    labels:['金', '木', '水', '火', '土'],
    types:['warning', 'success', 'primary', 'error', 'steady'],
    colors:["#ff9900", "#19be6b", "#2979ff", "#fa3534", "#795548"],
};
export const YINYANG = {
    names:['阴', '阳','杂'],
    typesList:['yin', 'yang','za'],
    colorsList:["#fa3534", "#19be6b","#6b4f46"],
};

//天干的五行以及颜色显示
export const TIANGAN = {
    names: ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'],
    typesList: ['木', '木', '火', '火', '土', '土', '金', '金', '水', '水'],
    colorsList: ["#529b2e", "#b3e19d", "#f70404", "#f37266", "#6b4f46", "#a78f86", "#ff9a03", "#dcaf6d", "#035efb", "#82a5e1"],
    yinYangList: ['阳', '阴', '阳', '阴', '阳', '阴', '阳', '阴', '阳', '阴'],
    yinYangColor: ['danger', 'info', 'danger', 'info', 'danger', 'info', 'danger', 'info', 'danger', 'info'],
    // 孤阴孤阳是以木火为阳， 金水为阴 土不参与计算，底下的颜色值是在八字中显示 
    yinYangList2: ['阳', '阳', '阳', '阳', '无', '无', '阴', '阴', '阴', '阴'], 
    yinYangList2Color: ['#f70404', '#f70404', '#f70404', '#f70404', '#6b4f46', '#6b4f46', '#2979ff', '#2979ff', '#2979ff', '#2979ff'], 
};
//地支对应的五行以及颜色显示 
export const DIZHI = {
    names: ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'],
    typesList: ['水', '土', '木', '木', '土', '火', '火', '土', '金', '金', '土', '水'],
    colorsList: ["#035efb", "#a78f86", "#529b2e", "#b3e19d", "#6b4f46", "#f37266", "#f70404", "#a78f86", "#ff9a03", "#dcaf6d", "#6b4f46", "#82a5e1"],
    yinYangList: ['阳',        '阴',     '阳',      '阴',     '阳',    '阴',     '阳',     '阴',    '阳',     '阴',     '阳',    '阴'],
    yinYangColor: ['danger', 'info', 'danger', 'info', 'danger', 'info', 'danger', 'info', 'danger', 'info','danger', 'info'],
     // 孤阴孤阳是以木火为阳， 金水为阴 土不参与计算，底下的颜色值是在八字中显示 
    yinYangList2: ['阴', '无', '阳', '阳', '无', '阳', '阳', '无', '阴', '阴', '无', '阴'],
    yinYangList2Color: ['#2979ff', '#6b4f46', '#f70404', '#f70404', '#6b4f46', '#f70404', '#f70404', '#6b4f46', '#2979ff', '#2979ff', '#6b4f46', '#2979ff'],

};
// export const wuxingToShishenList: string[][] = [
// 	['比劫', '财才', '食伤', '官杀', '印绶'],
// 	['官杀', '比劫', '印绶', '食伤', '财才'],
// 	['印绶', '食伤', '比劫', '财才', '官杀'],
// 	['财才', '印绶', '官杀', '比劫', '食伤'],
// 	['食伤', '官杀', '财才', '印绶', '比劫']
// ];

export const wangshuai = {
	寅卯: ['木旺', '火相', '水休', '金囚', '土死'],
	巳午: ['火旺', '土相', '木休', '水囚', '金死'],
	申酉: ['金旺', '水相', '土休', '火囚', '木死'],
	亥子: ['水旺', '木相', '金休', '土囚', '火死'],
	辰戌丑未: ['土旺', '金相', '火休', '木囚', '水死']
};


 


//下面是不一定用得到滴 
export const CHANG_SHENG_OFFSET = {甲:1,丙:10,戊:10,庚:7,壬:4,乙:6,丁:9,己:9,辛:0,癸:3};
export const SHI_SHEN_ZHI={甲子:"正印",甲丑:"正财",甲寅:"比肩",甲卯:"劫财",甲辰:"偏财",甲巳:"食神",甲午:"伤官",甲未:"正财",甲申:"七杀",甲酉:"正官",甲戌:"偏财",甲亥:"偏印",乙子:"偏印",乙丑:"偏财",乙寅:"劫财",乙卯:"比肩",乙辰:"正财",乙巳:"伤官",乙午:"食神",乙未:"偏财",乙申:"正官",乙酉:"七杀",乙戌:"正财",乙亥:"正印",丙子:"正官",丙丑:"伤官",丙寅:"偏印",丙卯:"正印",丙辰:"食神",丙巳:"比肩",丙午:"劫财",丙未:"伤官",丙申:"偏财",丙酉:"正财",丙戌:"食神",丙亥:"七杀",丁子:"七杀",丁丑:"食神",丁寅:"正印",丁卯:"偏印",丁辰:"伤官",丁巳:"劫财",丁午:"比肩",丁未:"食神",丁申:"正财",丁酉:"偏财",丁戌:"伤官",丁亥:"正官",戊子:"正财",戊丑:"劫财",戊寅:"七杀",戊卯:"正官",戊辰:"比肩",戊巳:"偏印",戊午:"正印",戊未:"劫财",戊申:"食神",戊酉:"伤官",戊戌:"比肩",戊亥:"偏财",己子:"偏财",己丑:"比肩",己寅:"正官",己卯:"七杀",己辰:"劫财",己巳:"正印",己午:"偏印",己未:"比肩",己申:"伤官",己酉:"食神",己戌:"劫财",己亥:"正财",庚子:"伤官",庚丑:"正印",庚寅:"偏财",庚卯:"正财",庚辰:"偏印",庚巳:"七杀",庚午:"正官",庚未:"正印",庚申:"比肩",庚酉:"劫财",庚戌:"偏印",庚亥:"食神",辛子:"食神",辛丑:"偏印",辛寅:"正财",辛卯:"偏财",辛辰:"正印",辛巳:"正官",辛午:"七杀",辛未:"偏印",辛申:"劫财",辛酉:"比肩",辛戌:"正印",辛亥:"伤官",壬子:"劫财",壬丑:"正官",壬寅:"食神",壬卯:"伤官",壬辰:"七杀",壬巳:"偏财",壬午:"正财",壬未:"正官",壬申:"偏印",壬酉:"正印",壬戌:"七杀",壬亥:"比肩",癸子:"比肩",癸丑:"七杀",癸寅:"伤官",癸卯:"食神",癸辰:"正官",癸巳:"正财",癸午:"偏财",癸未:"七杀",癸申:"正印",癸酉:"偏印",癸戌:"正官",癸亥:"劫财",};
export const SHI_SHEN_SIMPLIFIE = {正印:"印",正官:"官",劫财:"劫",伤官:"伤",正财:"财",七杀:"杀",偏印:"枭",比肩:"比",食神:"食",偏财:"才"};
export const TAISUI_RELATION = {子子:"值太岁",丑丑:"值太岁",寅寅:"值太岁",卯卯:"值太岁",巳巳:"值太岁",未未:"值太岁",申申:"值太岁",戌戌:"值太岁",子卯:"刑太岁",丑戌:"刑太岁(丑戌未三刑)",辰辰:"刑太岁(值)",午午:"刑太岁(值)",酉酉:"刑太岁(值)",亥亥:"刑太岁(值)",子午:"冲太岁",卯酉:"冲太岁",寅申:"冲太岁(寅巳申三刑)",巳亥:"冲太岁",辰戌:"冲太岁",丑未:"冲太岁(丑戌未三刑)",子未:"害太岁",丑午:"害太岁",寅巳:"害太岁(寅巳申三刑)",卯辰:"害太岁",申亥:"害太岁",酉戌:"害太岁",子酉:"破太岁",卯午:"破太岁",辰丑:"破太岁",寅亥:"破太岁",巳申:"破太岁(寅巳申三刑)",未戌:"破太岁(丑戌未三刑)"};
