export const shishenDizhi = {
    甲: {
        子: '正印',
        丑: '正财',
        寅: '比肩',
        卯: '劫财',
        辰: '偏财',
        巳: '伤官',
        午: '食神',
        未: '正财',
        申: '七杀',
        酉: '正官',
        戌: '偏财',
        亥: '偏印'
    },
    乙: {
        子: '偏印',
        丑: '偏财',
        寅: '劫财',
        卯: '比肩',
        辰: '正财',
        巳: '食神',
        午: '伤官',
        未: '偏财',
        申: '正官',
        酉: '七杀',
        戌: '正财',
        亥: '正印'
    },
    丙: {
        子: '正官',
        丑: '伤官',
        寅: '偏印',
        卯: '正印',
        辰: '食神',
        巳: '劫财',
        午: '比肩',
        未: '伤官',
        申: '偏财',
        酉: '正财',
        戌: '食神',
        亥: '七杀'
    },
    丁: {
        子: '七杀',
        丑: '食神',
        寅: '正印',
        卯: '偏印',
        辰: '伤官',
        巳: '比肩',
        午: '劫财',
        未: '食神',
        申: '正财',
        酉: '偏财',
        戌: '伤官',
        亥: '正官'
    },
    戊: {
        子: '正财',
        丑: '劫财',
        寅: '七杀',
        卯: '正官',
        辰: '比肩',
        巳: '正印',
        午: '偏印',
        未: '劫财',
        申: '食神',
        酉: '伤官',
        戌: '比肩',
        亥: '偏财'
    },
    己: {
        子: '偏财',
        丑: '比肩',
        寅: '正官',
        卯: '七杀',
        辰: '劫财',
        巳: '偏印',
        午: '正印',
        未: '比肩',
        申: '伤官',
        酉: '食神',
        戌: '劫财',
        亥: '正财'
    },
    庚: {
        子: '伤官',
        丑: '正印',
        寅: '偏财',
        卯: '正财',
        辰: '偏印',
        巳: '七杀',
        午: '正官',
        未: '正印',
        申: '比肩',
        酉: '劫财',
        戌: '偏印',
        亥: '食神'
    },
    辛: {
        子: '食神',
        丑: '偏印',
        寅: '正财',
        卯: '偏财',
        辰: '正印',
        巳: '正官',
        午: '七杀',
        未: '偏印',
        申: '劫财',
        酉: '比肩',
        戌: '正印',
        亥: '伤官'
    },
    壬: {
        子: '劫财',
        丑: '正官',
        寅: '食神',
        卯: '伤官',
        辰: '七杀',
        巳: '正财',
        午: '偏财',
        未: '正官',
        申: '偏印',
        酉: '正印',
        戌: '七杀',
        亥: '比肩'
    },
    癸: {
        子: '比肩',
        丑: '七杀',
        寅: '伤官',
        卯: '食神',
        辰: '正官',
        巳: '偏财',
        午: '正财',
        未: '七杀',
        申: '正印',
        酉: '偏印',
        戌: '正官',
        亥: '劫财'
    }
};

export const shishenTiangan = {
    甲: {
        甲: '比肩',
        乙: '劫财',
        丙: '食神',
        丁: '伤官',
        戊: '偏财',
        己: '正财',
        庚: '七杀',
        辛: '正官',
        壬: '偏印',
        癸: '正印'
    },
    乙: {
        甲: '劫财',
        乙: '比肩',
        丙: '伤官',
        丁: '食神',
        戊: '正财',
        己: '偏财',
        庚: '正官',
        辛: '七杀',
        壬: '正印',
        癸: '偏印'
    },
    丙: {
        甲: '偏印',
        乙: '正印',
        丙: '比肩',
        丁: '劫财',
        戊: '食神',
        己: '伤官',
        庚: '偏财',
        辛: '正财',
        壬: '七杀',
        癸: '正官'
    },
    丁: {
        甲: '正印',
        乙: '偏印',
        丙: '劫财',
        丁: '比肩',
        戊: '伤官',
        己: '食神',
        庚: '正财',
        辛: '偏财',
        壬: '正官',
        癸: '七杀'
    },
    戊: {
        甲: '七杀',
        乙: '正官',
        丙: '偏印',
        丁: '正印',
        戊: '比肩',
        己: '劫财',
        庚: '食神',
        辛: '伤官',
        壬: '偏财',
        癸: '正财'
    },
    己: {
        甲: '正官',
        乙: '七杀',
        丙: '正印',
        丁: '偏印',
        戊: '劫财',
        己: '比肩',
        庚: '伤官',
        辛: '食神',
        壬: '正财',
        癸: '偏财'
    },
    庚: {
        甲: '偏财',
        乙: '正财',
        丙: '七杀',
        丁: '正官',
        戊: '偏印',
        己: '正印',
        庚: '比肩',
        辛: '劫财',
        壬: '食神',
        癸: '伤官'
    },
    辛: {
        甲: '正财',
        乙: '偏财',
        丙: '正官',
        丁: '七杀',
        戊: '正印',
        己: '偏印',
        庚: '劫财',
        辛: '比肩',
        壬: '伤官',
        癸: '食神'
    },
    壬: {
        甲: '食神',
        乙: '伤官',
        丙: '偏财',
        丁: '正财',
        戊: '七杀',
        己: '正官',
        庚: '偏印',
        辛: '正印',
        壬: '比肩',
        癸: '劫财'
    },
    癸: {
        甲: '伤官',
        乙: '食神',
        丙: '正财',
        丁: '偏财',
        戊: '正官',
        己: '七杀',
        庚: '正印',
        辛: '偏印',
        壬: '劫财',
        癸: '比肩'
    }
};

export const mangpaijikoujue = {

    year: {
        "正财": {
            "gan": "年上正财祖业强，家财大业借祖光。\n下有营地分三处，内有一处有力量。\n月上再把正财现，不是俩妻就俩娘。",
            "正财": "年支正财借祖光，家有千金万斗粮。",
            "偏财": "支为偏财支出大，色情之灾需要防。",
            "正官": "支为正官多高尚，祖上能把权来掌。",
            "七杀": "年支若要逢七杀，祖上刚强有名望。",
            "正印": "年支若要逢正印，妻子对母不贤良。",
            "偏印": "支为偏印不太好，先富后贫祖飘荡。",
            "食神": "年支若要逢食神，衣食丰足妻子帮。",
            "伤官": "年支若要逢伤官，虽然富贵也不长。",
            "劫财": "年支若要逢劫财，祖上产业要败光。",
            "比肩": "年支若要逢比肩，财禄广进弟兄帮。"
        },
        "偏财": {
            "gan": "年上偏财命中安，日干旺相福禄全。\n外乡求财机会多，父东子西把家搬。",
            "正财": "年支若逢占正财，祖上必然有家产",
            "偏财": "若要干支成一家，抛父抛母在幼年",
            "正官": "年支若要逢正官，祖上有权好命看",
            "食神": "年支若要逢食神，祖上富贵命里添",
            "伤官": "年支若要逢伤官，祖上受损身体残",
            "比肩": "年支若要逢比肩，兄弟多了分财源",
            "劫财": "年支若要逢劫财，祖上兴旺没几天",
            "正印": "年支若要逢正印，一代一代胜从前",
            "偏印": "年支若要逢偏印，以小失大不堪言",
            "七杀": "年支若要逢偏官，父母恐怕难保全"
        },
        "正官": {
            "gan": "年上正官要占先，祖上有过功名权。\n少年得志传美名，全靠父母爱周全",
            "正官": "支为正官不太好，官欺民辖命中安。",
            "正财": "年支若要正财现，富贵荣华在少年",
            "七杀": "年支若要逢七杀，恐怕少运有灾难",
            "正印": "年支若要逢正印，官印相生好命看，\n即使不是头胎生，也能继承祖业产。",
            "偏印": "年支若要逢偏印，自力更生创家园",
            "劫财": "年支若要逢羊刃，好事难成办事难",
            "比肩": "年支若要逢建禄，祖上一代本有权",
            "食神": "年支若要逢食神，祖业兴旺本有钱",
            "伤官": "年支若要逢伤官，恐怕父母难保全",
            "偏财": "年支若要逢偏财，财官相生前程宽"
        },
        '七杀': {
            "gan": "年上偏官命不强，上克父来下克娘。\n父母命硬克不动，疾病口舌不顺当。\n本身不是头生子，幼年贫困缺衣粮。\n年上七杀逢生旺，祖上威武又刚强，\n羊刃会杀方为好，祖上必把官来当",
            "食神": "年支若要逢食神，家财大业借祖光",
            "正印": "年支若要逢正印，父母有权在命上",
            "财星": "年支若要逢财星，运生财地福禄长",
            "劫财": "年支若要逢羊刃，祖上根基不算强",
            "比肩": "年支若要逢比肩，身弱伤身有外伤",
            "正官": "年支若要逢正官，祖上必然把兵当",
            "偏印": "年支若要逢偏印，少年父母命夭亡",
            "七杀": "年支若要逢七杀，一生身体不算弱"
        },
        '正印': {
            "gan": "年印月官命最强，祖上应该把权掌。\n月上没月劫羊刄，该守祖业旧田庄。\n少年读书学业好，老来稳坐把福享。\n印坐衰绝日主弱，命主必生穷家乡。\n羊刃会杀方为好，祖上必把官来当",
            "食神": "食神一生较荣光，有人信任有人帮 ",
            "正印": "年干正印又透印，幼饮他乳别人养。\n正印正印不相当，此人自尊心太强",
            "正财": "正印正财本不良，有些好事赶不上。\n母与妻子不和睦，疾病劳苦缺钱粮",
            "偏财": "偏财事业有发展，家庭美满买卖强",
            "劫财": "比劫一生都不错，事业顺利创辉煌",
            "比肩": "比劫一生都不错，事业顺利创辉煌",
            "伤官": "伤官身败母无缘，夫妻吵架事业黄",
            "正官": "正官诚实心地善，能忍能干成栋梁",
            "偏印": "偏印犹豫多失败，多愁善感多姑娘",
            "七杀": "偏官正直又慈善，工作幸运财源广。 \n男命能让妻内助，女命助子把夫帮。"
        },
        '偏印': {
            "gan": "年上偏印命不强，不是离父就离娘。\n自幼与母无缘分，缺少家教在命上。\n父母命硬克不动，疾病口舌不顺当。",
            "食神": "偏印食神运不通，事业有始不能终。\n与子无缘事故多，进退失居破家凶。  ",
            "正印": "",
            "正财": "",
            "偏财": "",
            "劫财": "偏印劫财有大灾，事业未成小人来。\n男婚女嫁都不顺，车前马后有险灾。 ",
            "比肩": "偏印比肩命不合，一生经常遇波折，\n夫妻不合打着过，买卖经营损失多。\n支为比肩为养子，少年名誉不太好。 ",
            "伤官": "偏印伤官没有财，家中不断生灾害。\n男人刑妻又克子，女人克夫有大灾。 ",
            "正官": "",
            "偏印": "",
            "七杀": "偏印偏官不太好，开支多来收入少。\n生来就把小人带，凡事无功往徒劳。\n多学少成好抗上，伤事事故有几遭。 "
        }
        ,
        '食神': {
            "gan": "年上食神主衣食，财足福大世界稀。\n平生为人多自在，少年吃些好东西。\n从小长辈都宠爱，要遇财星福禄余。",
            "食神": "食坐食神大富命，可惜一生没官星，\n四柱无生身有病，再遇七杀有官星",
            "正印": "食坐正印讲信用，贵人支持事业兴。",
            "正财": "食坐正财命最强，贵人提拔借祖光。",
            "偏财": "食坐偏财福禄佳，子孝孙贤妻治家。\n能享人间鸿艳福，中年晚年都荣华。",
            "劫财": "食坐劫财命运高，求财望喜乐逍遥，\n破点小财不顶事，失小获大成富豪，\n近亲财产你巧得，再遇七杀官职高", 
            "比肩": "干上食神支比肩，此人养子定无疑，\n食坐比肩性格强，百业兴旺贵人帮，\n多情多欲多好善，处事外柔内里刚，\n女人遇此夫缘差，桃色纠纷在命上 ",
            "伤官": "食坐伤官不太好，夫妻子女添苦恼。\n事业前程有障碍，疾病夫妻难谐老。  ",
            "正官": "食坐正官正气星，安分守己做事情。\n女人该把贵夫得，一生有个好家庭。",
            "偏印": "食坐偏印主大凶，一生多学少成功。\n疾病口舌连绵起，小人不足事不成。\n四柱若有偏财制，逢凶化吉得安宁。",
            "七杀": "食坐偏官运气通，一杀一制发利名。\n制服太过事不顺，脾气不佳易生凶。"
        },
        '伤官': {
            "gan": "年上伤官命不佳，祖业漂零没有啥。\n月上再把伤官见，克父克母夫妻散。\n年上伤官非头胎，若遇财印可发达。",
            "食神": "伤见食神身体虚，父说东来子说西。\n常与长辈闹分歧，受之影响能获利。",
            "正印": "伤官正印最为吉，一生长寿有福气。 \n遇事多得贵人助，妻贤子孝在命里",
            "正财": "伤坐正财得妻财，全靠自己奋斗来。\n三兄四弟不借力，命克双亲命中带。 ",
            "偏财": "伤官偏财有福气，飞黄腾达把财理，\n女命半路克夫主，男人要戒色情激。 ",
            "劫财": "伤坐劫财财为妻，为人霸道太势力。 ", 
            "比肩": "伤坐比肩命不吉，自招家庭不和气。\n手足不合不借力，婚后生别和死离。",
            "伤官": "上下一气富不长，因疾命短凶最大。\n伤见伤官有痼疾，富贵不久妻离去。",
            "正官": "伤官正官是非有，事有反复不到头",
            "偏印": "伤官偏印多变刑，一生职业多变更，\n有成有败费心记，事业有始不到终",
            "七杀": "伤坐偏官最可愁，夫妻别离难到头。\n辛苦一生凶险有，救人无功坐牢囚 "
        },
        '比肩': {
            "gan": "年上比肩少运缩，生来就把双亲克。。\n父母命硬克不动，自身肯定有疾病。\n祖业前程没有你，自力更生去生活。\n我说此话你不信，从小受过苦折磨",
            "食神": "比见食神万事顺，衣禄丰厚常有乐",
            "正印": "比坐正印贵人扶，经营获利工作多。",
            "正财": "比坐正财诸事顺，家有贤妻喜事多。",
            "偏财": "比坐偏财桃色多，因情因父常有祸。",
            "劫财": "比坐劫财多风波，手足不睦妻不合", 
            "比肩": "比坐比肩好孤独，或为养子父缘薄",
            "伤官": "比坐伤官有啰嗦，常为别人背黑锅。",
            "正官": "比坐正官争权利，得人信仰是非多。 ",
            "偏印": "比坐偏印事不顺，居无定所无工作。",
            "七杀": "比坐偏官有盗诈，为友劳心烦忧多。"
        },
        '劫财': {
            "gan": "年上劫财主破财，祖业前程未带来。\n白手起家义气大，争权夺利善理财。\n四柱再把劫财现，恐怕夫妻要分开。\n夫妻若能同长久，破腹手足有大灾。\n年上羊刃命不行，兄弟姐妹靠不成。\n持撑家业操心早，想当弟弟都不行",
            "食神": "劫坐食神贵人扶，女命二婚方获福。 ",
            "正印": "劫坐正印表面荣，获小失大内里空。 ",
            "正财": "劫坐正财遭欺诈，为人破财不言败。 ",
            "偏财": "劫坐偏财不积财，多因情感去败财。 ",
            "劫财": "劫坐劫财父早亡，谋事难成病在床。 ", 
            "比肩": "劫坐比肩婚不顺，为兄为友劳力心。 ",
            "伤官": "劫坐伤官品不端，身败名裂小人缠。 ",
            "正官": "劫坐正官能发达，破财免官怨屋下。 ",
            "偏印": "劫坐偏印内心冷，生活不安业不定。 ",
            "七杀": "劫坐偏官多成败，凶吉浮沉最后败。 "
        }

    },

    // 「临官」在四柱都有特定的称呼，落在年柱称为“年禄”，落在月柱称为“建禄”，落在日柱称为“自禄”，而落在时柱称为“归禄”，既然有“禄”这一层意义就不能把其单单看作比肩。
    month: {
        "正财": {
            "gan": "月上正财不一般，日柱建旺有财源,\n正财建禄最为好，全靠父母来周全。",
            "正财": "支为正财逢生旺，一生富贵在命间",
            "偏财": "支为偏财能巧得，买卖手艺能挣钱",
            "正官": "月支若逢正官格，财官相生能掌权",
            "七杀": "若要地支逢七杀，身弱贫困命中安",
            "正印": "支逢正印是好命，伤官聪明会攒钱",
            "偏印": "",
            "伤官": "月支若要逢伤官，聪明伶俐会攒钱",
            "食神": "月支若要逢食神，能成富翁不费难",
            "劫财": "",
            "比肩": "月支若要逢比肩，兄弟姐妹争家产"
        },
        "偏财": {
            "gan": "月上偏财众人财，意外之财命带来，\n月干偏财年干劫，先贫后富有外财。\n月干偏财时干劫，先富后贫渐衰败。\n年日偏财成一家，离乡赚钱外地发。",
            "偏财": "月支偏财逢身旺，妻妾情人有一排",
            "正财": "地支若要正财见，少年富贵本有财",
            "正官": "月支再把正官现，生官发财命里该",
            "食神": "月支再把食神现，父母攒下田和宅",
            "伤官": "月支再把伤官现，破腹手足有大灾",
            "比肩": "月支若要占比肩，独立致富运难开",
            "劫财": "月支再把劫财见，婚姻恐怕人破坏",
            "正印": "月支若要逢正印，一生保证有依赖",
            "偏印": "月支若要逢偏印，总想离家去求财",
            "七杀": "月支再把偏官现，遇事不顺小人来"
        },
        "正官":
        {
            "gan": "月上正官正气星，为人生来主聪明，\n正官坐在将星上，双亲权贵显赫名。\n上有兄姐父母爱，一生不受苦和穷，\n生来财高见识广，处事总有威望名，\n月支正官主大贵，再有七杀命平庸.\n年上伤官来克损，若有财印可化凶。",
            "正财": "支为正财官星旺，财官相生显赫名",
            "正官": "月支若把正官现，一生事业难成功",
            "食神": "月支若把食神现，当官不久去埋名",
            "比肩": "月支若要逢比肩，创业自力去更生",
            "偏财": "正官若要逢偏财，手艺买卖会经营",
            "偏印": "月支若要逢偏印，多学少成好逞能"
        },
        "七杀":
        {
            "gan": "月上七杀小人多，要逢正印大吉兆",
            "正印": "杀印相生功名显，文武全财好命看",
            "偏印": "七杀偏印不算好，平庸一生还清高",
            "食神": "七杀食神为有制，平静安稳不算孬",
            "正官": "月干七杀逢正官，官杀混杂祸百端",
            "伤官": "七杀伤官日主旺，制杀变官本有权",
            "正财": "月干七杀逢正财，杀坐正财大吉兆",
            "劫财": "月干七杀逢羊刃，羊刃七杀掌兵权",
            "比肩": "月伤比肩命不吉，自闹家庭难和好，\n六亲手足不合睦，婚后生别和死离，\n兄弟姐妹不借力，自力更生靠独立"

        },
        "正印":
        {
            "gan": "月上正印慈悲怀，智慧甚高怕正财。\n印坐失地日主弱，出身贫寒起不来。",
            "正印": "月支正印容貌端，人格高尚有大才。",            
        },
        "偏印":
        {
            "gan": "四柱若把官杀见，多学少成好逞能。\n天月二德来相照，福禄无亏在命中。\n月上偏印根气足，顽固霸道又专横。",
            "正财": "月上偏印见财星，月干旺相发利名。",            
        },
        "食神":
        {
            "gan": "月上食神胜财官，坐禄生旺贵可言。\n若遇正官发大福，应在正界来掌权。\n月柱食神人缘好，能遇贵人来周全。",
            "食神": "月支食神身体好，食神多了疾病缠。",            
        },
        "伤官":
        {
            "gan": "月占伤官真可怜，缺少兄弟真孤单。\n父母不借你的利，夫妻不能长共眠。",
            "伤官": "父母不借你的利，再见伤官身受残。",            
        },
        "比肩":
        {
            "gan": "月占比肩兄弟多，兄弟多了不相合。\n四柱若无官杀制，脾气暴躁乱生恶。\n挣来钱财不好攒，外人总把钱来借",
                   
        }, 
        "劫财":
        {
            "gan": "月上劫财好败财，财来财去不存财。\n此人喜欢外表美，急想投机把钱来。\n合伙买卖不能作，未曾求助有祸灾。\n打仗不怕生和死，骂人也就是个玩。",
        }

    },
    // 日看要看旁边的月令是什么
    day: {
        "正财": {
            "gan": "日坐正财得妻财，美貌贤妻能带来，\n发财致富得内助，夫唱妻随多恩爱。\n 女人若把正财见，丈夫对你最关怀。\n 正财若逢长生地，百万富翁命里该。\n 正财若要逢墓库，运到逢冲发大财。",
            "女": "女人若把正财见，丈夫对你最关怀，",
            "长生": "正财若逢长生地，百万富翁命里该。",
            "墓": "正财若要逢墓库，运地逢冲得大财，",
            "空亡": "正财逢空不太好，夫妻中年要分开",
            "正官": "正财若要逢正官，财官双美无有灾",
            "七杀": "正财若要逢七杀，配偶精明又强干",
            "伤官": "正财若要逢伤官，不能求官能发财",
            "劫财": "正财若要逢劫财，有财无库订下来",
            "比肩": "正财若要逢比肩，兄弟姐妹分夺财",
        },
        "偏财": {
            "gan": "男命日支坐偏财，小妾二奶进门来,\n日带偏财运不周，夫妻难以到白头。\n男人性乱酒色好，女人好把情人勾。",
            "无刑合破": "不逢冲来刑合破，女人纯真又淳厚。",
            "天乙贵人": "偏财将星天乙贵，生来就是名门后，",
            "刑冲": "偏财若要逢刑冲，恐怕夫妻没长寿",
            "正官": "偏财若要逢正官，财旺官旺事无忧",
            "食神": "偏财若要逢食神，晚年财源最丰厚",
            "伤官": "偏财若要逢伤官，夫妻半路闹分手",
            "偏财": "日带偏财命不强，夫妻异梦在同床，\n轻财重义口舌起，妻爱虚荣在世上。\n要遇相生妻内助，能取豪门美娇娘。",
        },
        "正官": {
            "gan": "日代正官最厚诚，权谋深算礼仪通。\n日坐正官又为喜，妻是名门世家女。\n女命应把贵夫得，夫唱妻随过百终。\n日旺见财发大福，妻贤子孝在命中。\n日主正官性聪明，古称天上文曲星，\n一举成名框天下，世上能有几人丁。\n命要相克口舌起，伤官劫财婚变更。\n女命日元坐正官，富贵荣华能升迁，\n身弱无印官杀忌，夫缘不美反受牵，\n丈夫凶狠又残暴，定让娇娥受煎熬",
            "正财": "正官若要逢正财，此人必然有权柄，\n一生荣华能富贵，威名远震人尊敬",
            "伤官": "正官若要逢伤官，运行伤官有灾星",
            "食神": "正官若要逢食神，衣食丰足命里逢",
            "天乙贵人": "坐官若逢天乙贵，众有钦佩有高名",
            "天德月德": "天月二德同一柱，一生不会受官刑",
            "旺地": "日做正官逢旺地，学而不倦有才能",
            "日弱官旺": "日弱官旺胆子小，一生读书难成功"
        },        
        "七杀": {
            "gan": "日元若是坐七杀，老婆凶悍能当家，\n若是七杀要有制，男人尚可使住她，\n七杀若是无有制，妻似梁山母夜叉，\n日代偏官性自豪，脾气倔强性如刀。\n若要逢冲多灾病，食神制杀灾病消。\n夫妻反目皆无制，配偶性刚烈自豪。\n偏官多者灾病起，制服不了受艰熬。",
             
        },
        "正印": {
            "gan": "女命如果坐喜印，必嫁当官掌权人，\n日代正印多担财，子孝妻贤命带来。\n有时缺乏上进心，名利二字放一边。",             
        },
        "偏印": {
            "gan": "日代偏印身体胜，正业不肯下苦功。\n为人自幼无常性，做事有头没有终。\n男人不能借妻力，女人不得好老公。\n女命日元坐偏印，小气疑心互不尊,\n夫妻感情甚是薄，好聚好散再找人",             
        }
        ,
        "食神": {
            "gan": "日代食神自己福，一生不能受辛苦。\n财富志临身旺地，到老皆成老财主。\n配偶随和得内助，自己总觉不知足。\n要遇偏印无偏财，事业有始不到头。\n日支坐食妻妾肥，还得心宽持家人",             
        },
        "伤官": {
            "gan": "日代伤官最可愁，晚婚再婚定无忧。\n女人再把羊刄代，夫妻不能到白头。\n时有财星晚年福，再行伤官身体忧。\n女命天元坐伤官，克夫之命不一般。",             
        },
        "比肩": {
            "gan": "日代比肩夫妻克，夫妻之间不相合。\n要想夫妻同床久，除非一生打着过。\n比肩逢冲不太好，客死他乡定不错。\n女命日元坐比劫，夫妻时时闹争分,\n日常小事互不让，最终恐怕要离婚.",             
        },
        "劫财": {
            "gan": "日带劫财运不通，伤官劫财牢狱刑。\n贫穷寿短损名誉，多招诽谤独断行。\n月柱再逢劫羊刄，不是晚婚婚变更。\n此命主义非常正，桃色纠纷在命中。",             
        }
    },
    MonthDay: {
        '伤官': {
            "比肩": "月伤比肩命不吉，自招家庭不和气。\n六亲手足不合睦，婚后生别和死离。\n兄弟姐妹不借力，自力更生靠独立",
            "劫财": "月伤日劫最难当，娶妻以财为对象。\n为人生来多横霸，身心劳苦在命上，\n合作事业不长久，好为亲朋把财伤",
            "食神": "月伤日食身体虚，父说东来子说西，\n长辈意见不一样，为人处事有冲击。\n长辈影响极为大，受之影响获利益",
            "伤官": "月伤日伤主大凶，一生不残寿难终。\n即使富贵不长久，兄弟之间各西东，\n夫妻不能同长久，时占伤官克子凶",
            "偏财": "月伤偏财会理财，飞黄腾达能发财，\n此命心高神又爽，不能安定去求财。\n女命半路克夫主，男人慎戒色情灾",
            "正财": "月伤正财得妻财，全靠自己来周全。\n三史四弟不借力，克母命中自带来。\n印要当旺倒可解，要带官来足妙哉",
            "七杀": "月伤偏官最可仇，夫妻离虽难到头，\n此命一生多辛苦，时运不佳遭牢囚。\n凶险之事时常有，救人无功反成仇",
            "正官": "月伤日官最为凶，夫妻分别各西东。\n为人生来嘴就冷，恶言恶语骂人能，\n万事运滞难随意，官星有始不到终，\n多因长辈遭失败，连累自己有军星",
            "正印": "月伤正印最为吉，一生长寿有福气。\n遇来多得人来助，妻贤子孝在命里，\n印制伤官官星旺，官旺财旺福禄余",
        },
        '偏印': {
            "比肩": "偏印比肩命不合，一生经常遇波折，\n副业买卖不能做，营利少来损失多。\n夫妻常常不合睦，恐怕一生打着过",
            "劫财": "偏印劫财有大灾，谋事未成小人来。\n合伙买卖不能做，独立经营命带来，\n男婚女嫁都不顺，车前马后有险灾",
            "食神": "偏印食神运不通，事业有始不能终，\n英雄没有用武地，进退失居破家凶。\n生来与子无缘份，交通事故好发生",
            "伤官": "偏印伤官没有财，经营买卖不称怀。\n家中不断生灾害，破家离散名分开，\n男人刑妻又克子，女人克夫有大灾",
            "七杀": "偏印偏官不在好，开支多来收入少。\n生来就把小人带，凡事无功往徒劳。\n多学少成好抗上，伤身事故有几遭",
            "偏印": "偏印偏印运不通，奔波劳碌事难成，\n居位工作不固定，多招盗贼火烧凶。\n女命克夫又刑子，到处奔波受欺穷",
            "正印": "偏印正印不太强，酒色之灾迷惑上。\n一生事业多失败，两家之事你都帮，\n处事为人多慷慨，一生能借妻子光",
        },
        '食神': {
            "正印": "月食正印最实诚，万事遂意事业通。\n诸事都有人来助，应在政界有大名。\n为人心慈又好善，遇事化吉不成凶",
            "劫财": "月食劫财命运高，求财望喜任逍遥。\n破点小财不顶事，失小获在成富豪，\n近亲财产你巧得，再遇七杀官职高",
            "食神": "月食日食衣禄丰，不做头卖手艺中，\n男命生来多伶巧，可惜一生没官星。\n四柱无生身有病，再遇七杀有官星",
            "伤官": "月食日伤命不好，夫妻子女添苦恼。\n事业中途有障碍，口舌疾病必来到，\n我说此话你不信，夫妻之间难偕老",
            "偏财": "月食偏财福禄佳，一生一世享荣华，\n子孝孙贤父母爱，因妻致富来治家。\n能享人间鸿艳福，中年晚景一差啥",
            "正财": "月食正财命最强，家财全靠借祖光。\n少年就知勤和俭，当家立业格外强，\n贵人提拔官星旺，半世不缺衣和粮",
            "七杀": "月食偏官运气通，一杀一制发利名，\n制服太过灾立至，诸事做着不顺情。\n半世劳碌多辛苦，脾气不佳易生凶",
            "正官": "月食正官正气星，安分守已做事情。\n女人应把贵夫得，夫唱妻随过百冬，\n中年以后必享福，一生有个好家庭",
            "偏印": "月食偏印主大凶，一生多学少成功，\n疾病口舌连绵起，小人不足事不成。\n四柱要有偏财制，逢凶化吉得安宁",
        },
        '正印': {
            "比肩": "正印比肩最为吉，好为别人去尽力，\n买卖经营倒不错，事业发达还顺利。\n虽然一生财源旺，不能过旺有限制",
            "劫财": "正印劫财诸事业，事业发展又兴隆。\n此命心慈又好善，损财招灾为亲朋，\n平生夫妻不借力，异性纠缠不能清",
            "食神": "正印食神最为吉，一生不能受委屈，\n事业繁荣要尊敬，要求财气大获益。\n为人处事得信任，工作发展贵人提",
            "伤官": "正印伤官主大凶，身败名裂在此中。\n一生与母无缘份，事业有始不到终，\n夫妻之间总不时，口角之争常发生",
            "偏财": "正印偏财实可观，事业发展胜从前，\n要做官星有人助，要做买卖多赚钱。\n夫妻白头能偕老，一生不把灾病添",
            "正财": "正印正财本不良，有些好事赶不上。\n母与妻子不合睦，疾病劳苦缺钱粮，\n若要克妻不克母，常因病人忧心肠",
            "七杀": "正印偏官不一般，为人正直又慈善，\n工作幸运能发展，一生能得外财源。\n能谦能让妻内助，女人助于旺夫男",
            "正官": "正印正官最实诚，或获意外得功名。\n交友广泛心良善，忍辱负重能成功，\n夫唱妻随偕百姓，能获上司来器重",
            "偏印": "正印偏印命不强，犹豫不决在命上，\n此人事业多失败，多愁善感在命上。\n一生与子无缘份，总然少儿多姑娘",
        },
        '偏财': {
            "比肩": "偏财比肩命不合，生来克父疾病多，\n一生事业难开运，祖业家产犯争夺。\n一生夫妻难合睦，男女色情有风波",
            "劫财": "偏财劫财两无功，克财克父命中逢。\n男女婚姻都有变，异性纠纷不会清。\n争来钱财难保守，常因亲朋破财凶",
            "食神": "偏财食神事业通，多利多益益财荣，\n生来能得父妾助，做官为宦为享通。\n八字造就无更改，生贫后富命中逢",
            "伤官": "偏财伤官福自来，他人失败你得财。\n一生母亲多冷落，情妇为你好招灾，\n女命难把贵夫得，晚婚再婚命里该",
            "偏财": "偏印偏官发他乡，平生独立定家帮，\n买卖经营为大吉，有点浮夸在世上。\n男人难得妻妾利，恐怕夫妻不久长",
            "正财": "偏财正财生意兴，市农工商不久长，\n正业副业全都有，两项一起来经营，\n四柱再翁财来见，外财光滑内里空",
            "七杀": "偏财偏官命不佳，辛劳倍至把财发，\n常为女人把财破，与父无缘定不差。\n阴差阳错把婚配，招至离婚或再嫁",
            "正官": "偏财正官吉含凶，众人之助事业通。\n为干事业责任重，自尊心强传美名，\n最怕暗中小人害，因名因利有官讼",
            "偏印": "偏财偏印运不通，劳苦不断命中逢，\n小本经营为大吉，要做大事不成功。\n自幼不得父母爱，反与伯父对心情",
            "正印": "偏财正印福禄高，一生不把灾病招。\n妻贤子孝父母爱，平生福份不算薄，\n天生就有人来助，红尘世界把名标",
        },
        '正财': {
            "比肩": "正财比肩本有财，人称富翁命带来，\n一生进财似流水，亲朋破财命里该。\n团体协作不长久，独立自主去发财"
        }

    },

    time: {
        "正财": {
            "gan": "时上正财运气通，子女富贵财禄逢，\n勤俭持家为人正，笑看子孙有功名。\n时遇长生儿满堂，比肩子女真孝敬。\n时逢死绝晚年孤，时空做事总不成。",
            "正官": "时支正财逢官印，后代发达有工名",
            "正财": "支逢正财后代强，伤官克子不留情",
            "正印": "时支正财逢官印，后代发达有工名",
            "伤官": "若要时支逢伤官，克子有灾不流情",
            "劫财": "时支若要劫财见，子女是个败财星",
            "比肩": "时支若要逢比肩，子多女少把财争",
            "长生": "时支若要逢长生，儿孙满眼寿如松",
            "归禄": "时支若要逢归禄，子女孝顺衣食丰",
            "羊刃": "时支羊刃不太好，子不残疾也多病，\n女命克夫又伤子，男命克子婚变更",
            "死": "时支若逢死绝地，晚年孤苦又伶仃",
            "绝": "时支若逢死绝地，晚年孤苦又伶仃",
            "空亡": "时支若要逢空亡，一生做事本无成"
        },
        '偏财': {
            "gan": "时上偏财运气通，子女投机有财星。\n时上偏财无冲破，中年晚年财富升。\n败财劫运还无忌，富贵财禄必享通",
            "偏财": "时支若要逢偏财，经营买卖样样来",
            "正官": "时支再把正官现，半凶半吉也享通",
            "食神": "时支再把食神现，晚年子女成富翁",
            "伤官": "时支若要逢伤官，克子多把姑娘生",
            "比肩": "时支若要比肩现，克妻伤财到老穷。\n若有食伤不要紧，逢冲化去得太平。",
            "劫财": "时支若把劫财现，女子不孝败财星，\n时支逢劫更不好，男女婚姻有变更。\n男为妻家防丧命，女人丈夫死得凶"
        },
        '正官': {
            "gan": "时上正官运气高，身旺子女必然好，\n身弱逢官为大忌，纵然有子不贤孝",
            "七杀": "正官若要逢七杀，善得子女也不肖",
            "正官": "时逢正官一位贵，逢凶化吉死中逃",
            "比肩": "时干正官逢比肩，必为高官奉禄高",
            "正印": "时支若要逢正印，晚年子女最贤孝，\n时支正印子孙孝，偏财经营利不簿",
            "偏财": "时支若要逢偏财，晚年经营利不薄",
            "正财": "时干正官逢正财，晚年财生乐逍遥",
            "伤官": "时支若要逢伤官，恐怕女多儿子少",
            "食神": "时支若要逢食神，身弱不好身旺好",
            "劫财": "时支若要逢羊刃，子女顽固好坐牢",
            "偏印": "时支若要逢偏印，中年克子把命消"
        },
        '七杀': {
            "gan": "时上偏官一位能，官杀混杂定贫穷。\n若遇印星来化杀，文武双全富贵命。\n女命七杀坐长生，必配佳偶自英雄，\n若坐桃花有婚变，七杀沐浴风流娘",             
        },        
        '正印': {
            "gan": "时上正印聪明善，大展宏图有财官。", 
            "正印": "时支正印巧谋事，逢冲穿绝事业暗。",            
        },          
        '偏印': {
            "gan": "时上偏印命不强，平生难借子女光。\n子女多才又多艺，固执精明在世上。", 
            "劫财": "日坐羊刄不太好，妻子临产有灾殃。\n纵然儿女七八个，临终孤儿来吊丧。",            
        },                
        '食神': {
            "gan": "时上食神命里全，老年不缺吃和穿。\n食神制杀生旺地，儿女后事能掌权。\n老来不能受辛苦，吃穿享受在命间。\n四柱再把偏印见，女守空房多病男。", 
                       
        },
        '伤官': {
            "gan": "时上伤官命不高，应在子女把心操。\n逞强好胜不贤孝，子女之光借不着。\n中年运气倒不错，临终孤儿来吊孝。", 
                       
        },
        '比肩': {
            "gan": "脾气倔强在世上，好打人间理不合。", 
            "劫财": "若坐羊刄必不好，少年就要把父克。",          
        },
        '劫财': {
            "gan": "四柱劫财时又现，子女非愚即劣顽。\n劫坐劫财父缘浅，日弱见劫子兴欢。", 
                       
        },

    },

}
