// @ts-nocheck
import { ELEMENT, TIANGAN, DIZHI, YINYANG } from "./zymap";
import { LunarUtil, Solar, Lunar, LunarYear, LunarMonth, DaYun } from 'lunar-typescript';
import { getPersonInfo } from "./zypersonInfo";
import { getShenSha } from '../utils/zyshensha'
import dayjs from "dayjs";
import { ComputedShiShen, ComputedWuXing } from "./utils";

interface ObjInterface {
	[key: string]: any;
}

//根据传过来的五行获取对应生克的五行关系

const wuXing: ObjInterface = {
	木: {
		生: '水',
		克: '金',
	},
	火: {
		生: '木',
		克: '水',
	},
	土: {
		生: '火',
		克: '木',
	},
	金: {
		生: '土',
		克: '火',
	},
	水: {
		生: '金',
		克: '土',
	},
};

const wuXing2: ObjInterface = {
	木: {
		生: '火',
		克: '土',
	},
	火: {
		生: '土',
		克: '金',
	},
	土: {
		生: '金',
		克: '水',
	},
	金: {
		生: '水',
		克: '木',
	},
	水: {
		生: '木',
		克: '火',
	},
};

export const tianganList: string[] = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
export const dizhiList: string[] = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const MonthList: string[] = ['十一', '十二', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十'];
export const shengxiaoList: string[] = ['鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪'];
export const shenSha12: string[] = ['太岁', '青龙', '丧门', '六合', '官符', '小耗', '大耗', '朱雀', '白虎', '贵神', '吊客', '病符']
export const shenSha12Alias: string[] = ['太岁', '太阳', '丧门', '勾绞', '五鬼', '小耗', '大耗', '紫微', '白虎', '福德', '天狗', '病符']  //别名 
export const shenSha12DizhiList: string[] = ['寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥', '子', '丑']  //找命宫的时候就会用到 






const CHANG_SHENG_OFFSET: ObjInterface = { '甲': 1, '丙': 10, '戊': 10, '庚': 7, '壬': 4, '乙': 6, '丁': 9, '己': 9, '辛': 0, '癸': 3 };
const CHANG_SHENG = ['长生', '沐浴', '冠带', '临官', '帝旺', '衰', '病', '死', '墓', '绝', '胎', '养']

//得到六壬的值 

//六壬测事
export const liuRenShenSha: string[] = ['大安', '留连', '速喜', '赤口', '小吉', '空亡'];
// 六壬测事的吉凶
export const liuRenShenShaInfo: { [key: string]: [string, string, string, string] } = {
	'大安': ['大安', '大吉', '木', '事事昌,心安、吉祥，就近不可远，求稳不激进为最佳'],
	'留连': ['留连', '小凶', '水', '有难度受阻碍，情况暗昧不明，事情反复纠缠，拖延，漫长'],
	'速喜': ['速喜', '中吉', '火', '非常快的顺利、开心和满意'],
	'赤口': ['赤口', '中凶', '金', '或有不吉、惊恐、凶险或口舌是非'],
	'小吉': ['小吉', '小吉', '木', '吉利、顺利、舒服开心'],
	'空亡': ['空亡', '大凶', '土', '不抱希望，感觉会落空，无盼头']
};

export const getLiuRenShenShaInfo = (item: string): [string, string, string, string] | [] => {
	const info = liuRenShenShaInfo[item];
	return info ? info : [];
};


/*
遇事即刻起卦，无事勿占，凡事只占一次，再占不验。
凡一切途径得数，除以12，去余数作时辰，月日即用历书所载为准。

六壬时课有神通，大安留连速喜中，　　赤口小吉空亡记，吉凶祸福细推祥。
  病占大安不用慌，上天佑你保健康；　　病占留连多忧愁，绵绵缠缠病不离；
  病占速喜病来急，急速医治别务期；　　病占赤口是重衰，忍受痛苦度病关；
  病占小吉为吉利，不用慌忙病有安；　　病占空亡为无病，有病可能是癔病。
 
  官司大安是不顺，要找贵人来疏通；　　官司留连有拖延，耐心等待不要忙；
   官司速喜有明理，是黑是白自分明；　　官司小吉要答礼，舍财保身得平安；
   官司赤口是不顺，官司输定必不疑      官司空亡无灾难，虚惊一场不要慌。
 
  财占大安不动财，动则钱财有损伤；　　财占留连为无财，真想求财去远方；
  财占速喜九分财，若要得全贵人帮；　　财占赤口一口财，辛辛苦苦才赚到；
  财占小吉流动财，即有去的也有来；　　财占空亡意外财，要逢天时好运帮。
 
  大安外出不宜远，不求财来可以走；　　留连外出是远行，忧心忡忡有拖延；
  速喜外出走的慌，匆匆忙忙来观光；　　赤口外出有凶险，按兵不动是真招；
  小吉外出最顺当，一路观光一路欢；　　空亡外出最不欢，有矢无中不乐观。
 
 
  婚占大安婚自安，青梅竹马结良缘；　　婚占留连有犹豫，男女两家都不欢；
  婚占速喜喜喜喜，一见钟情成一家；　　婚占赤口婚不吉，棒打鸳鸯各一方；
  婚占小吉桃花婚，男的潇洒女风光；　　婚占空亡喜无音，单身男女泪汪汪。
*/

//六壬分类
export const liuRenCategrey: string[] = ['失物', '工作', '谋事', '求财', '婚恋', '病况', '官司', '客亲'];

// 得到六壬的分类信息
export const getLiuRenCategrey = (item: string): string[] => {
	const DataMap: { [key: string]: string[] } = {
		'失物': ['在家或在家不远处', '有难度,去南方赶快去找可以找到,错过了就很难找到了', '南或西南,认真找会马上找到', '最终结果整体不太好，别人话老干扰自己,最终结果是找不回或找到了有损很多', '在坤方（西南），去了马上就能找到', '结果不太好，最终结果是找不回或找到了有损极多'],
		'工作': ['工作稳定为主，可得上司赏识，求稳勿锋芒太露', '被上司盯或者被人扯后腿，有小人', '工作得利，但须注意文件上的疏失。', '若为武职或者粗重行业则顺，若为文职则不顺会有纠缠反复或争吵', '整体向好顺利满意结果，小人远离', '有小人多作怪，工作失利，容易被人陷害或者暗中耳语，或者因他人问题而让自己工作失利。'],
		'谋事': ['结果吉利，运势发展不错，可以稳定发展，但不宜躁进', '最终不利，事情受阻难成，拖拖拉拉或持久状态，需要反复不断或难有眉目 ', '运势渐开，要积极的行动就可以如愿', '不太好，运势最终不明朗，分歧大或有争吵，若有大计划就要赶快实施、不拖延则可能向好,若小事则失败告终。', '目前运势不错，保持目前状况就会越来越好,会有喜事临门小人远离', '有小人多作怪'],
		'求财': ['目前财运就不错但目前求稳，不宜扩张守住当前发展当前为好', '最终结果不太有利，事件事暗味不明，多磨拖延状态，难有结果', '有利，可以很快求到财，求财可得，重点是南方，但有先破财而后得财或者先得财后破财，若得到钱财就必须赶快脱身。', '多不成,求财不易甚至有争吵事非', '求财可得，而且有贵人帮助得财,结果不错还算满意', '求财难得，没有机会，大概率会亏赔'],
		'婚恋': ['女性的话感情顺遂；男性则会较差，会出小问题', '不太有利于自己，双方关系暗味不明，多磨拖延，沟通不良、冷战、或者一方过于强势，感情不平衡', '自己有稍微有利，如果是刚开始马上行动容易有进展，若是已经持续一段时间，则会有口舌争吵', '感情纷争多或对方身体有疾病。', '结果吉利向好，如无感情则会有，如有则顺利发展', '双方产生分歧，且有他人介入问题或三者问题，无疾而终或结束，最后没有结果。'],
		'病况': ['病情稳定或转好无大碍', '不太乐观，暗味不明，多磨拖延，一时半会好不了，多是肠胃不舒服或者精神压力太大所得之病', '可痊愈，很快就会痊愈或者稳定, 问题不大，多是心脏、血液循环有问题或者头部、脑压的问题', '相对严重一些，需要时日才成，多是胸口、支气管或血光意外、流行疾病之类的', '病人会转危为安或痊愈，问题不大，多是肝胆之疾病和消化系统导致', '病人病情加重，或无病或有癔病，多是脾胃出毛病，或者神经系统出的问题'],
		'官司': ['对自己有利,最终结果还算满意。', '对自己不利，事件暗味不明，多磨拖延', '有利，有贵人相助，可以有利于自己', '不太顺利，会有纠缠和埋怨甚至爆发口舌是非', '有利于自己，可能会和解，或者和平处理', '对自己不利，最终打官司或与官方的事会招来灾祸，牢狱刑伤'],
		'客亲': ['还未动身，主观上不愿与自身连络', '人平安,事情还没处理完暂时回不来或即使回来也还得回去', '人很快就会到了', '有困难或者有事情纠缠、有惊慌紧急的事情发生', '等待的人快到了', '无音讯或有灾，遇到困难或很难短时间到'],
	};
	return DataMap[item];
};

//
// 得到六壬的分类信息 - 第一阶段  ['大安', '留连', '速喜', '赤口', '小吉', '空亡'];
export const getLiuRenCategreyFirst = (item: string): string[] => {
	const DataMap: { [key: string]: string[] } = {
		'失物': ['失物就在不远处,感觉自己会回来或比较容易找回来', '开始就找起来比较麻烦，感觉如果错过了最佳时机，寻找之路会漫长和拖拖拉拉好久', '感觉应该就在附近，认真找会马上找到，手里有线索', '一开始有人就叨叨干扰自己或有埋怨', '感觉很有希望很快就能找到', '不抱有希望，感觉找不回来了'],
		'工作': ['工作稳定为主,没想过要变化', '这事漫长拖拖拉拉没成果没效率或被上司盯或者被人扯后腿，甚至有小人阻碍', '感觉很快就会有好消息，十拿九稳', '会有亲朋对此事不同意持持反对意见，甚至伴有争吵', '开始感觉工作中小人或压力麻烦也离自己比较远，还比较满意状态', '一开始就感觉感觉难度太大，没有啥希望和盼头,甚至有小人阻碍和破坏'],
		'谋事': ['感觉项目发展运势不错，能稳定发展', '一开始就受阻暗味不明，多磨拖延 ', '一开始就进展顺利天时地利人和的感觉', '运势不明各方还有分歧和不同意见甚至争吵', '运势不错，感觉保持目前状况就会越来越好,小人也不捣乱', '有小人多作怪，对自己很不利，与自己想法相去甚远'],
		'求财': ['感觉财运机会不错，在自己能力范围之内很稳定，或十拿九急', '一开始就受阻暗味不明，多磨拖延', '感觉应该很快求到财，应该难度不大，求财可得', '感觉难度大，达不成统一,面临失败影响,求财不易，还有分歧和不同意见，甚至有争吵事非', '感觉能财可得，而且还有贵人帮助', '感觉求财非常难，机会渺茫，大概率还会亏赔'],
		'婚恋': ['女性的话刚开始感情顺遂；男性则会较差，会出小问题', '暗味不明，多磨拖延，双方沟通不良、冷战、或者一方过于强势，感情不得平衡。', '刚就始就进展很顺利，口舌争吵相对少', '一开始就有些纷争多或分歧或身体有疾病或心理问题', '向好的方向发展，自己比较满意', '双方有分歧，感觉进展下去的可能性不大'],
		'病况': ['病情不严重，表现稳定甚至感觉容易转好无大碍', '暗味不明，还有多磨拖延，一时半会好不了', '感觉很快可痊愈或者稳定, 问题不大', '需要些时日才可能见到效果，伴随着分歧和不同意见，甚至有争吵和事非', '感觉病人会转危为安或痊愈，问题不大', '病人看着比较严重或无病或有癔病或者神经系统出的问题'],
		'官司': ['感觉对自己有利，问题不是很大', '暗味不明，多磨拖延，对方对事件发展造成压力和拖延阻力', '有贵人相助，应该可以成功或对自己有利', '一开始就有伴随着分歧和不同意见，甚至有争吵', '感觉会和解,凡事好合，能顺利结束', '对自己不利,甚至会招来灾祸，牢狱刑伤之类的不利'],
		'客亲': ['还未动身，主观上不愿与自身连络', '那边还没处理完暂时回不来或即使回来也还得回去', '感觉人很快就会到了', '有困难或者有事情纠缠、有惊慌紧急的事情发生', '等待的人快到了', '无音讯或有事发生，遇到困难或很难短时间到，或者不愿意与自己联系'],
	};
	return DataMap[item];
};

// 得到六壬的分类信息 - 第一阶段  ['大安', '留连', '速喜', '赤口', '小吉', '空亡'];
export const getLiuRenCategreySecond = (item: string): string[] => {
	const DataMap: { [key: string]: string[] } = {
		'失物': ['失物就在不远处,感觉自己会回来或比较容易找回来', '如果早点找的话可以比较找到,错过了很难了，寻找之路会漫长', '有了好消息，让自己感觉认真找就能会找到', '开始有人干扰或埋怨，甚至伴随争吵', '感觉很有希望很快就能找到', '不抱有希望，感觉找不回来了'],
		'工作': ['工作稳定为主,没想过要变化或不想再有变化', '这事漫长拖拖拉拉没成果没效率或被上司盯或者被人扯后腿，甚至有小人阻碍', '感觉很快就会有好消息，十拿九稳', '会有亲朋对此事不同意持持反对意见，甚至伴有争吵', '开始感觉工作中小人或压力麻烦也离自己比较远，还比较满意状态', '开始就感觉难度太大，没有啥希望和盼头,甚至有小人阻碍和破坏'],
		'谋事': ['感觉项目发展运势不错，能稳定发展', '开始受阻暗味不明，多磨拖延 ', '开始顺利，天时地利人和的感觉', '运势不明各方还有分歧和不同意见甚至争吵', '运势不错，感觉保持目前状况就会越来越好,小人也不捣乱', '有小人多作怪，对自己很不利，与自己想法相去甚远'],
		'求财': ['感觉财运机会不错，在自己能力范围之内很稳定，或十拿九急', '开始受阻暗味不明，多磨拖延', '感觉应该很快求到财，应该难度不大，求财可得', '感觉难度大多不成,求财不易还有分歧和不同意见，甚至有争吵事非', '感觉能财可得，而且还有贵人帮助', '感觉求财非常难，机会渺茫，大概率还会亏赔'],
		'婚恋': ['女性的话刚开始感情顺遂；男性则会较差，会出小问题', '暗味不明，多磨拖延，双方沟通不良、冷战、或者一方过于强势，感情不得平衡。', '刚就始就进展很顺利，口舌争吵相对少', '一开始就有些纷争多或分歧或身体有疾病或心理问题', '向好的方向发展，自己比较满意', '双方有分歧，感觉进展下去的可能性不大'],
		'病况': ['病情不严重，表现稳定甚至感觉容易转好无大碍', '暗味不明，还有多磨拖延，一时半会好不了', '感觉很快可痊愈或者稳定, 问题不大', '需要些时日才可能见到效果，伴随着分歧和不同意见，甚至有争吵和事非', '感觉病人会转危为安或痊愈，问题不大', '病人看着比较严重或无病或有癔病或者神经系统出的问题'],
		'官司': ['感觉对自己有利，问题不是很大', '暗味不明，多磨拖延，对方对事件发展造成压力和拖延阻力', '有贵人相助，应该可以成功或对自己有利', '开始有分歧和不同意见，甚至有争吵', '感觉会和解,凡事好合，能顺利结束', '对自己不利,甚至会招来灾祸，牢狱刑伤之类的不利'],
		'客亲': ['还未动身，主观上不愿与自身连络', '那边还没处理完暂时回不来或即使回来也还得回去', '感觉人很快就会到了', '有困难或者有事情纠缠、有惊慌紧急的事情发生', '等待的人快到了', '无音讯或有事发生，遇到困难或很难短时间到，或者不愿意与自己联系'],
	};
	return DataMap[item];
};


//得到某一个六壬的第一阶段 结果 
export const getLiuRenCategreyFirstResult = (item: string, liuRenShenShaName: string): string => {
	const categoryList = getLiuRenCategreyFirst(item);
	const idx = liuRenShenSha.indexOf(liuRenShenShaName);

	// console.log(categoryList,idx,liuRenShenShaName,item)
	return categoryList[idx] ?? '';
}

//得到某一个六壬的第一阶段 结果 
export const getLiuRenCategreySecondResult = (item: string, liuRenShenShaName: string): string => {
	const categoryList = getLiuRenCategreySecond(item);
	const idx = liuRenShenSha.indexOf(liuRenShenShaName);

	// console.log(categoryList,idx,liuRenShenShaName,item)
	return categoryList[idx] ?? '';
}

//得到某一个六壬的结果 
export const getLiuRenCategreyResult = (item: string, liuRenShenShaName: string): string => {
	const categoryList = getLiuRenCategrey(item);
	const idx = liuRenShenSha.indexOf(liuRenShenShaName);

	// console.log(categoryList,idx,liuRenShenShaName,item)
	return categoryList[idx] ?? '';
}

// 得到十二长生的状态的概念

export const getStatusByChangSheng = (item: string): string[] => {

	const DataMap: { [key: string]: string[] } = {
		'长生': ['生机勃勃,生长阶段有人帮扶有贵人助，少病少灾，福气临门。'],
		'沐浴': ['洗涤焕新,进入新阶段，结触新事物新项目或新人，脱胎换骨，洗心换面。'],
		'冠带': ['蓄势待发,上升发展到新阶段。名利双收，事业有成。'],
		'临官': ['亨通顺达,做事多称心遂意。高官厚禄，权势显赫。'],
		'帝旺': ['巅峰遂意,主利禄进财常有喜庆事，鼎盛人生阶段。'],
		'衰': ['渐衰阶段,有是非疾病财衰走下坡路不受控的事情，福气衰退，运势低迷。'],
		'病': ['有困扰受阻,身体不佳事态不健的情况常发生。疾病缠身，灾祸不断。'],
		'死': ['蛰伏沉寂,会有亲人去世或事态无力改变结局的事情。低谷绝望，处理艰难。'],
		'墓': ['埋藏阶段,待待反转，等待时机的阶段。韬光养晦，蓄势待发。'],
		'绝': ['衰败极致,孤立无援，有绝交或生离死别的事情，孤军奋战，运势不济。'],
		'胎': ['有休身养性放空自己，孕育新生。潜能觉醒，孕育新生。'],
		'养': ['滋养能力并已成形，逐渐向好，随时行动。休养生息，恢复元气。'],
	};
	return DataMap[item];
};

// 得到十二长生的好坏 
export const getChangShengLevel = (item: string) => {

	const DataMap: { [key: string]: number } = {
		'长生': 10,
		'沐浴': 10,
		'冠带': 10,
		'临官': 10,
		'帝旺': 10,
		'衰': -10,
		'病': -10,
		'死': -10,
		'墓': -10,
		'绝': -10,
		'胎': 0,
		'养': 0,
	};
	return DataMap[item];
};




// 12串宫法
// https://www.sohu.com/a/455636853_121043484#:~:text=%E4%BB%8A%E5%A4%A9%E8%BF%99%E9%87%8C%E5%B0%B1%E9%80%9A%E8%BF%87%E8%AF%A6%E7%BB%86%E7%9A%84
// 相通字就是，甲通寅，乙通卯，丙通巳，丁通午，戊通戌，己通丑，庚通申，辛通酉，壬通亥，癸通子。
// 12神分别是：太岁（1），青龙（2），丧门（3），六合（4），官符（5），小耗（6），大耗（7），朱雀（8），白虎（9），贵神（10），吊客（11），病符（12）。
// 其次，我们就找到相通字，己通丑，那么丑就是太岁。根据12地支那么去排。丑后面是寅（按子丑寅卯辰巳午未申酉戌亥的顺序去排），
// 12神的顺序是太岁后面是青龙（按太岁，青龙，丧门，六合，官符，小耗，大耗，朱雀，白虎，贵神，吊客，病符的顺序去排），所以
// 寅为青龙，寅通甲，所以甲也是青龙。那么接下来就是
// 卯就是丧门，那么卯通乙，乙也是丧门。

// 根据12神得到地支禄是什么 
export const shenSha12GanToZhi = (item: string): string => {
	// 相通字就是，甲通寅，乙通卯，丙通巳，丁通午，戊通戌，己通丑，庚通申，辛通酉，壬通亥，癸通子。
	// 和禄神 戊通戌，己通丑 两个是不同的 
	const DataMap: { [key: string]: string } = {
		"甲": '寅',
		"乙": '卯',
		"丙": '巳',
		"丁": '午',
		"戊": '戌',
		"己": '丑',
		"庚": '申',
		"辛": '酉',
		"壬": '亥',
		"癸": '子',
	};
	return DataMap[item];
};



// 八字中没有的字，往往是最至关重要的字，
//  盲派中的伏神也就是冲出，拱出，合化出来之物。
//  暗藏的东西，伏财的命局就是真财不外露，得财对男命为金屋藏娇，伏多少有多少，
//  伏官的命局就是有多少官职，女命就是有多少个情郎。
//  食伤，比劫，印星同样道理。注意：岁运露出之时，就是失去之时。
// 
// 飞神法则：
// 天干合飞：二甲无己飞出己、二己无甲飞甲、二庚无乙飞出乙，二乙无庚飞出庚、二丙无辛飞出辛，二辛无丙飞出丙、二丁无壬飞出壬、二壬无丁飞出丁、二戊无癸飞出癸、二癸无戊飞出戊。
// 地支合飞：二丑无子飞出子、二寅无亥飞出亥、二亥无寅飞出寅、二戌无卯飞出卯、二辰无酉飞出酉、二巳无申飞出申、二申无巳飞出巳、二未无午飞出午。
// 地支冲飞：二子无午飞出午、二午无子飞出子、二寅无申飞出申、二申无寅飞出寅、二卯无酉飞出酉、二酉无卯飞出卯、二巳无亥飞出亥、二亥无巳飞出巳。

// 地支拱飞：巳丑无酉飞出酉、申辰无子飞出子、寅戌无午飞出午、亥未无卯飞出卯、寅辰无卯飞出卯、巳未无午飞出午、申戌无酉飞出酉、亥丑无子飞出子。

// 传递出来的数组,一般是八字的数组或身宫命的数组 strArr= []     strKong =[]  空亡的数组  以日支  

export const getMangPaiFeiShen = (strArr: string[], strKong: string[], elsList: string[]): string[] => {
	const FeiElsArr = []

	const counts = countArrayElements(strArr);

	const pairMap1 = new Map([
		['甲', '己'],
		['己', '甲'],
		['庚', '乙'],
		['乙', '庚'],
		['丙', '辛'],
		['辛', '丙'],
		['丁', '壬'],
		['壬', '丁'],
		['戊', '癸'],
		['癸', '戊'],
		['子', '午'],
		['丑', '子'],
		['寅', '亥'],
		['卯', '酉'],
		['辰', '酉'],
		['巳', '申'],
		['午', '子'],
		['未', '午'],
		['申', '巳'],
		['酉', '卯'],
		['戌', '卯'],
		['亥', '寅'],
	]);
	const pairMap2 = new Map([
		['寅', '申'],
		['巳', '亥'],
		['申', '寅'],
		['亥', '巳'],
	]);


	for (const [key, value] of counts) {

		if (!elsList.includes(key)) {
			continue;
		}


		if (value >= 2) {

			if (!strArr.includes(pairMap1.get(key))) {
				if (pairMap1.get(key) || ''.length > 0 && !FeiElsArr.includes(pairMap1.get(key))) {
					//  空亡的不能飞出来东西
					if (!strKong.includes(key)) {
						FeiElsArr.push(pairMap1.get(key));
					}

				}

			}

			if (!strArr.includes(pairMap2.get(key))) {
				if (pairMap2.get(key) || ''.length > 0 && !FeiElsArr.includes(pairMap2.get(key))) {
					//  空亡的不能飞出来东西
					if (!strKong.includes(key)) {
						FeiElsArr.push(pairMap2.get(key));
					}
				}

			}
		}


		// 地支拱飞：巳丑无酉飞出酉、申辰无子飞出子、寅戌无午飞出午、   亥未无卯飞出卯、   寅辰无卯飞出卯、巳未无午飞出午、申戌无酉飞出酉、亥丑无子飞出子。

		if ((key === '巳' || key === '丑') && ((counts.get('丑') || 0) > 0 && (counts.get('巳') || 0) > 0) && !strArr.includes('酉')) {
			if (!FeiElsArr.includes('酉') && !strKong.includes('巳') && !strKong.includes('丑')) {
				FeiElsArr.push('酉');
			}
		}

		if ((key === '申' || key === '辰') && ((counts.get('申') || 0) > 0 && (counts.get('辰') || 0) > 0) && !strArr.includes('子')) {
			if (!FeiElsArr.includes('子') && !strKong.includes('申') && !strKong.includes('辰')) {
				FeiElsArr.push('子');
			}
		}

		if ((key === '寅' || key === '戌') && ((counts.get('寅') || 0) > 0 && (counts.get('戌') || 0) > 0) && !strArr.includes('午')) {
			if (!FeiElsArr.includes('午') && !strKong.includes('寅') && !strKong.includes('戌')) {
				FeiElsArr.push('午');
			}
		}



		if ((key === '亥' || key === '未') && ((counts.get('亥') || 0) > 0 && (counts.get('未') || 0) > 0) && !strArr.includes('卯')) {
			if (!FeiElsArr.includes('卯') && !strKong.includes('亥') && !strKong.includes('未')) {
				FeiElsArr.push('卯');
			}
		}



		// 地支拱飞： 寅辰无卯飞出卯、巳未无午飞出午、申戌无酉飞出酉、亥丑无子飞出子。
		if ((key === '寅' || key === '辰') && ((counts.get('寅') || 0) > 0 && (counts.get('辰') || 0) > 0) && !strArr.includes('卯')) {
			if (!FeiElsArr.includes('卯') && !strKong.includes('寅') && !strKong.includes('辰')) {
				FeiElsArr.push('卯');
			}
		}
		if ((key === '巳' || key === '未') && ((counts.get('巳') || 0) > 0 && (counts.get('未') || 0) > 0) && !strArr.includes('午')) {
			if (!FeiElsArr.includes('午') && !strKong.includes('巳') && !strKong.includes('未')) {
				FeiElsArr.push('午');
			}
		}
		if ((key === '申' || key === '戌') && ((counts.get('申') || 0) > 0 && (counts.get('戌') || 0) > 0) && !strArr.includes('酉')) {
			if (!FeiElsArr.includes('酉') && !strKong.includes('申') && !strKong.includes('戌')) {
				FeiElsArr.push('酉');
			}
		}

		if ((key === '亥' || key === '丑') && ((counts.get('亥') || 0) > 0 && (counts.get('丑') || 0) > 0) && !strArr.includes('子')) {
			if (!FeiElsArr.includes('子') && !strKong.includes('亥') && !strKong.includes('丑')) {
				FeiElsArr.push('子');
			}
		}
	}

	return FeiElsArr
}

// 通过盲派飞神得到包含什么信息 

export const getSomethingByMangPaiFeiShen = (feishenElsArray: string[], taisui: string, daygan: string, sex: number): string[] => {

	let DataMap: string[] = []

	for (const els of feishenElsArray) {
		// 得到十神 
		let shishen = getShiShenByGanOrZhi(daygan, els)[0]
		// 得十串宫十神 
		let shensha12 = get12ShenSha(taisui, els)
		// 有桃花
		if (['子', '午', '卯', '酉'].includes(els)) {
			let char = '会有异性缘好,有偏桃花'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}
		// 有驿马
		if (['寅', '申', '巳', '亥'].includes(els)) {
			let char = '工作地点变化多,走动奔波多或出差多。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}
		// 有文昌星  
		if (getWenChang(daygan) === els || shensha12 === '青龙') {
			let char = '会继续学习拿到后天的学历文凭证书荣誉。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}
		// 大小耗
		if (shensha12 === '大耗' || shensha12 === '大耗') {
			let char = '会常破财，耗财。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shensha12 === '丧门' || shensha12 === '吊客') {
			let char = '12神是' + shensha12 + ',如有' + getLiuQinByShiShen(shishen)[sex] + '相处缘份少或身体不好或去世较早。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}



		if (shensha12 === '朱雀') {
			let char = getLiuQinByShiShen(shishen)[sex] + '有是非口角纠缠官司的事情。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shensha12 === '六合') {
			let char = '财旺,有偏财，与人合作能赚到钱。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}
		if (shensha12 === '太岁' || shensha12 === '官符') {
			let char = '工作上都会被人管压力大。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shensha12 === '白虎') {
			let char = `${(sex === 0 ? '生孩子会是剖腹产' : '')}自己注定有手术或血光意外。 `
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shensha12 === '贵神') {
			let char = '做事顺昌，总能得心应手遇到贵人。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shensha12 === '病符') {
			let char = getLiuQinByShiShen(shishen)[sex] + '身体不好，老人的话可能早去世。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}
		if (shishen === '正财' || shishen === '偏财') {
			let char = '常说自己没钱，其实深藏不露,其实很有正偏财。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shishen === '食神' || shishen === '伤官') {
			let char = '会掌握技能创造除工作外的偏财源。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shishen === '正官') {
			let char = sex === 1 ? '容易当领导或管理团队。' : '会接手管理团队的事情。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}
		if (shishen === '七杀') {
			let char = sex === 1 ? '当兵或执法人的狠劲。' : '自己会有情人或不能公开的相恋之人。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shishen === '比肩' || shishen === '劫财') {
			let char = '兄弟姐妹多或朋友哥们越来越多。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}

		if (shishen === '正印' || shishen === '偏印') {
			let char = '开始学习新知识或继续攻关后天荣誉或更高学历。'
			if (!DataMap.includes(char)) {
				DataMap.push(char)
			}
		}


	}

	return DataMap;
};

// 根据金镖门的方法，得到命宫的元素是什么 
// 推算方法
// 1.记住月支对应的数:寅卯辰巳午未申酉成亥子丑十二月建，寅记一，卯记二，其它类推。
// 2.记住时支对应的数:寅卯辰巳午未申酉成亥子丑十二时辰，寅记一、卯记二，其它类推。
// 3.记住命宫数:寅卯辰巳午未申酉戍亥子丑十二命宫，寅记一，卯记二，其它类推。
// 4.推演命宫(与子平法不同)用12或 24减月时数之和即为命宫。如寅月寅时生人，应是12-(1+1)=10，10对应
// 到命宫是亥，即亥宫安命。如果月时数之和大于 12，前面就用 24。这 12和 24 是定数。
// 5.记住星宿对应的数和流年太岁:一太岁，太岁记一。其它类推。流年太岁是指当年的地支，如2020年，庚子年，子为太岁。
// 6.推算管年星宿:
// 由流年地支顺数到命宫即为管年星宿，如子数到亥为十二。十二是病符，命主今年为病符星管年，主发生不吉利的事情，有问题，有毛病的事情。

export const shenSha12GetMingGongEls = (MonthZhi: string, TimeZhi: string): string => {
	let MonthZhiIdx = shenSha12DizhiList.indexOf(MonthZhi) + 1
	let TimeZhiIdx = shenSha12DizhiList.indexOf(TimeZhi) + 1
	let pos = 0;
	let cnt = MonthZhiIdx + TimeZhiIdx
	if (cnt >= 12) {
		pos = 24 - cnt
	}
	else {
		pos = 12 - cnt
	}
	let mingEls = shenSha12DizhiList[pos - 1]

	return mingEls;
}

// 根据推算出来的命宫得出来十二神煞

export const shenSha12GetMingGongShenSha = (TaisuiEls: string, MonthZhi: string, TimeZhi: string): string => {

	let mingEls = shenSha12GetMingGongEls(MonthZhi, TimeZhi)
	let shensha = get12ShenSha(TaisuiEls, mingEls)
	return shensha;
}






export const shenSha12GetBody = (item: string): string => {
	// 相通字就是，甲通寅，乙通卯，丙通巳，丁通午，戊通戌，己通丑，庚通申，辛通酉，壬通亥，癸通子。
	// 和禄神 戊通戌，己通丑 两个是不同的 
	const DataMap: { [key: string]: string } = {
		"甲": '高大强壮，身材僵直，威武稳重,老诚练达.',
		"乙": '虽高但瘦，体不直而柔，水蛇腰，为人柔弱。',
		"丙": '身材中等，体壮身健，方面而红，颧骨高，外强中干。',
		"丁": '身材中等，体态轻盈，尖瓜脸',
		"戊": '中上等身材，体壮身健，方面而黄，稳重老诚。',
		"己": '中下等身材，面凹，精明能干',
		"庚": '身高体强，面方而白，八字脚直率坦诚。',
		"辛": '身高而瘦，尖瓜脸，外柔内刚',
		"壬": '身材中等，面方而白，大眼睛眼神漂乎不定。',
		"癸": '身高中等，尖瓜面而黑，肩宽，八字脚',
		"子": ' 身材中上，略胖面黑多彩，颧骨高，腰粗',
		"丑": '矮小，面方而陋，面有疤痕色',
		"寅": ' 高大雄伟，体壮身健，八字脚肩宽',
		"卯": '身材中等，体态轻盈，两腿细且间缝宽',
		"辰": '高大伟岸，面方而黄，面多皱纹八字脚',
		"巳": ' 矮小，面红且上窄下宽，下巴平',
		"午": ' 高而瘦，尖瓜脸，肩宽，八字脚，面多皱纹',
		"未": '瘦而高, 尖瓜脸, 颧骨高',
		" 申": ' 高大伟岸，椭圆型脸, 额头棱角',
		"酉": ' 矮而胖，面方圆',
		"成": '高大雄壮，面方而多纹，八字脚',
		"亥": ' 高而瘦，弓腰探脖， 八字脚，面黑多纹',
	};
	return DataMap[item];
};


// 得到12神串宫  参数： 太岁的地支(可以是干也可以是支)  要得到结果的干支  

export const get12ShenSha = (TaisuiEls: string, Els: string): string => {
	let taisuiels = '', zhiEls = ''

	if (LunarUtil.GAN.includes(TaisuiEls)) {
		taisuiels = shenSha12GanToZhi(TaisuiEls)
	}
	else {
		taisuiels = TaisuiEls
	}

	if (LunarUtil.GAN.includes(Els)) {
		zhiEls = shenSha12GanToZhi(Els)
	}
	else {
		zhiEls = Els
	}

	let refData = ''
	let idxOftaiSui = dizhiList.indexOf(taisuiels)
	let idxOfEls = dizhiList.indexOf(zhiEls)
	let steps = 0
	if (idxOfEls >= idxOftaiSui) {
		steps = idxOfEls - idxOftaiSui
	}
	else {
		steps = (12 - idxOftaiSui) + idxOfEls
	}

	refData = shenSha12[steps]
	return refData

}
// 得到串宫颜色 

export const GetChuanGongColor = (str: string) => {
	const shuxing = get12ShenShaDesp(str)[0]
	const colorList: string[] = ['#009688', '#9E9E9E', '#ea2a6a', '#FF5722', '#a17323'];
	const shuxingList: string[] = ['吉星', '中性星', '小凶星', '大凶星']
	return colorList[shuxingList.indexOf(shuxing)];
}

export const GetChuanGongLevel = (str: string) => {
	const shuxing = get12ShenShaDesp(str)[0]
	const levelList: number[] = [10, 0, -10, -10];
	const shuxingList: string[] = ['吉星', '中性星', '小凶星', '大凶星']
	return levelList[shuxingList.indexOf(shuxing)];
}



// 得到十二神宫的说明
export const get12ShenShaDesp = (item: string) => {
	const DataMap: { [key: string]: string[] } = {
		"太岁": ['中性星', '太岁压运起祸端，伤财惹气心不甘。 惊天动地祸来临，是是非非把人缠。他人闲事切勿管，未雨绸缪且安然。太岁运年多忧愁，口舌临门不自由。疾病缠身小人侵，婚姻钱财莫强求。运逢太岁难行舟，劝君持重莫远游。', '太岁为中性星，遇吉星则吉，遇凶星则凶。无论见吉星还是凶星。只要太岁在地支即为凶。'],
		"青龙": ['吉星', '青龙是喜神，大喜有几重，荷花生贵子，门前应挂红。青龙入命大吉祥，创业谋事有人帮，添人进口生贵子，家中喜事一桩桩，官运亨通财运好，即使有祸不为殃。 ', '青龙是吉星，旺为吉，见吉星为吉。如果被凶星盖头则凶。被中性星盖头亦吉。'],
		"丧门": ['小凶星', '丧门是哭星，落泪有几行。丧门运年心不安，求财望喜多枉然， 不是伤人就损财，忧思重重整一年， 不有内孝有外孝，犯着丧门泪涟涟。', '丧门是小凶星，弱为吉。空亡为吉，如果被吉星盖头则应小凶。'],
		"六合": ['吉星', '六合见六合，必定喜事逢，有妻生贵子，无妻娶娇娥。 六合入命大吉昌，万事顺随人丁旺，多得亲友来辅助，纵有逆风不起浪，求财谋利皆如意，添喜进财时运强。', '六合为吉星。'],
		"官符": ['中性星', '官符为红鸾，有喜在当年， 少惹是非事，免祸在身边。官符入命令人忧，是非口舌无止休，平地也会起风波，忧思如麻不断头，财帛易散物易损，犯了官符难自由。', '官符为中性星，可吉可凶。'],
		"小耗": ['小凶星', '时运多颠倒，做事不牢靠, 金银多耗散，家财遭鬼盗。小耗之年多烦恼，是非口舌几多招， 官非易起气易惹，金银财钱易损耗， 东奔西跑无定处，办事不遂多阻挠。', '小耗为小凶星。'],
		"大耗": ['大凶星', '大耗定不祥，父母有人伤。  今年财要损，朋友来反目。  背运有人伤，落井会下石。 年逢岁破祸非轻，官司窃骗极易生， 不是破财遭凶事，就是体弱身染病， 若与白虎连一起，凶丧孝服灾更重。', '大耗为大凶星。'],
		"朱雀": ['大凶星', '朱雀压运凶，口舌是非多。 内外来磨磋，小人当前横。事事犯啰唆，有理无人理。 有冤无处诉，还要背黑锅。 朱雀入命口舌生，风波扰得心不宁，求名求财皆不利，凡事多磨事少成， 幸喜紫薇当头照，逢凶化吉保太平。', '朱雀为大凶星。'],
		"白虎": ['大凶星', '白虎当头坐，无灾也有祸。铁罗汉落井，有力难施展。白虎下山来，又遭口舌运，又遭凶灾气。白虎入命最凶险，血光伤疾度难关，更有内外孝服事，天灾横祸需防范，白虎之年心难安，一年四季不消闲。', '白虎为大凶星。不可被任何星盖头，盖头必凶。'],
		"贵神": ['吉星', '贵神压运事吉祥，财源广进喜又和，春不见喜秋也见，财喜双全不用说，男遇贵神天赐祥，女见贵神喜事多。贵神入命福寿长，财运亨通身安康，善与人交受人敬，高官厚禄名远扬，凡事都有贵人帮，运逢贵神心欢畅.', '贵神为吉星。'],
		"吊客": ['小凶星', '吊客压运事有凶，定有是非闹灾行，男犯吊客主不顺，女犯吊客有灾星。吊客流年也为凶，四方亲人不太平，求财谋利难如意，晦气会有几多重，岁逢吊客心不安，旧愁去了新愁添。', '吊客为小凶星。'],
		"病符": ['小凶星', '病符压运很难强，事要三思免祸殃，病魔缠身使人忧，三灾八难难得躲。病符入命恶重重，疾病缠身家不宁，办事处事心不顺，朝朝暮暮愁云生，凭你是个硬神汉，也得脱上皮几层。', '病符为小凶星。'],

	};
	return DataMap[item];

}

// 命官、身官。盲派认为胎元代表了命主本人的体质，命宫代表了命主本人的事业，身官则代表了命主本人的财运，
// 代表了命主本人一生的立身之本(健康、事业、财运)
// 五、一、十二神互变的规律:
// 1.太岁官符变朱雀，朱雀变贵神，贵神变丧吊，丧吊变官符;
// 2.青龙白虎互变，大小耗与六合互变;
// 3.病符变无病

// 太岁变朱雀    青龙变白虎     白虎变青龙   
// 六合变耗星    耗星变六合     朱雀变贵神    
// 贵神变丧吊    丧吊变官符     太岁
// 病符变无病    官符变朱雀

// 得到十二神宫的说明逢空亡的时候什么切换，切换表如下

// 食伤落白虎变青龙，食伤代表财源，白虎代表争斗打斗，青龙代表贵人代表喜庆，说明因为财与经济的方面而出现纠纷与人争斗打斗事件，最后得到贵人化解。
// 财星落吊客变官符，财为钱财，吊客代表纠纷纠缠忧愁烦恼，官符代表官方政府贵人，说明钱财方面出现经济纠纷，最后得到官方政符化解。

// 官星落官符变朱雀，官符官星代表工作事业，官星也代表女人的丈夫或其他男人，朱雀代表口舌纠纷官非小人，指会因工作事业而产生的纠纷官非小人阻路。
// 官星落六合变耗，官星代表工作事业，也代表女人的丈夫或男人，六合代表合作合伙，耗代表耗财破财投资失败。

// 官符配白虎，说明身体不是很好，出现问题，白虎落在何部位，则指哪部位可能有病。
// 吊客配太岁，说明事业先凶后吉，先期处于纠结波动状态，后期多得贵人助而有好转。
// 印星朱雀配白虎，说明此年会有因文件合同证书、或因工作单位、或房屋车辆等围绕着的一些事情，犯小人惹口舌是非，产生纠纷官司或会生气打斗纠缠、或是有血光之灾等。
// 朱雀配白虎，说明会出现经济纠纷与官司之事。

export const get12ShenChg = (item: string) => {
	const DataMap: { [key: string]: string[] } = {
		太岁: ['朱雀', '做事情有阻力,不顺还有小人自己要背黑锅。'],
		青龙: ['白虎', '有喜事出现,但最后转成自己受伤害，如失业、受伤、分手、意外等情况'],
		丧门: ['官符', '工作不顺或有纠纷是非口角，最后领导或行政部门出面解决。'],
		六合: ['小耗', '合作合伙的事情失败破财。'],
		官符: ['朱雀', '因工作事业而产生的纠纷官非有小人阻路。'],
		小耗: ['六合', '前凶后吉，合作的事情前期波折多后期顺利。'],
		大耗: ['六合', '前凶后吉，合作的事情前期波折多后期顺利。'],
		朱雀: ['贵神', '会遇到纠纷口解是非,有贵人出现帮忙解决。'],
		白虎: ['青龙', '出现纠纷或人争斗打斗事件，最后得到贵人化解。'],
		贵神: ['丧门', '找人帮助自己结果没帮还害了自己，甚至还有纠纷与官司。'],
		吊客: ['官符', '会遇到纠纷困扰的事情,最后领导或行政部门出面解决。'],
		病符: ['无病', '疾病有了好转或康复。'],

	};
	return DataMap[item];
}





// ['太岁', '青龙', '丧门', '六合', '官符', '小耗', '大耗', '朱雀', '白虎', '贵神', '吊客', '病符']
// 病符/朱雀:代表身体很差,有口舌纠纷

// 朱雀/大耗:纠纷是非，破财。

// 贵神/朱雀:麻烦解除，运行抬头。
// 病符/贵神:财运很旺，有贵人相助。但是身体不佳，容易患病。
// 太岁/六合:财运旺盛，人际关系很好，异性缘，合作谋利。

// 青龙/丧门:财运旺盛，还要走动他方，有小孝。
// 官符/官符:财运旺盛，事业有成，官府照护

// 青龙/官符:运程好，有走动运，马上就走出去，事业有发展财运很旺。
// 官符/吊客:事业方面 xian 通(官符),但是有孝事发生。
// 小耗/小耗:损小财
// 官符/大耗:事业很发达，但是总是破财，而且破的很大。
// 大耗/太岁:太岁受欺的年运，而是大耗所欺压，太岁不能压，此年不顺。
// 贵神/官符:事业上有喜,有官方帮助,
// 病符/病符:有病灾。
// 贵神/太岁:有贵人但是官方面找麻烦
// 丧门/丧门:有孝事及纠纷
// 太岁/贵神:有贵人相助，官府方面的贵人与人合作在事业上大有发展。


export const get12ShenShaRela = {

	//  神名+神名 ：['代表的古文意思','通俗易懂的现代语义','代表身体的描述[胎元]','代表事业的描述[身宫]','代表财运的描述[命宫]']
	太岁: {
		太岁: ['工作事业失利', '办事有纠纷非阻挠多。', '思想压力大。', '工作事业是非阻挠多。', '事业失利赚钱难度大。'],
		青龙: ['工作事业有利，上司赏识、提拔', '工作顺利会有提拔或调整。', '身体没啥毛病', '工作事业顺利有提升。', '赚钱得心应手。'],
		丧门: ['工作有倒霉的事', '工作不顺', '思想压力大偶有生病。', '工作事业多有是非倒霉。', '肯定会出现经济纠纷。'],
		六合: ['工作事业得力，官方合作，有异性缘。', '财运旺，人际关系好，异性缘佳，合作谋利成。', '身体没啥毛病', '人际关系很好，异性缘好，合作谋利。', '财运旺盛'],
		官符: ['官符为工作为财运，被上司压着必财失。', '工作中有损财或亏钱。', '思想压力大偶有生病。', '领导给的压力大', '工作压力大赚钱辛苦,常会亏钱的事情。'],
		小耗: ['工作、事业损失破财、被罚款、仕途不顺', '做事有阻多有不顺破小财。', '思想压力大偶有生病。', '做事有阻,工作不顺,投资会亏。', '赚钱不济，不动则好投则亏钱。'],
		大耗: ['工作、事业损失破财、被罚款、仕途不顺', '做事有阻多有不顺破财。', '思想压力大偶有生病。', '做事有阻,工作不顺,投资会亏。', '赚钱不济，不动则好投则亏钱。'],
		朱雀: ['工作事业中有口舌官司、为上司担过，被诬陷', '做事有阻,工作不顺还要背黑锅。', '思想压力大偶有生病。', '做事有阻,工作不顺,还会被黑锅被冤枉诬陷。', '赚钱不济，不动则好投则亏钱。'],
		白虎: ['工作事业破败，公司倒闭、破产、仕途阻隔', '工作有不好的变化甚至倒闭或失业等。', '思想压力极大。', '工作多不顺居多，仕途阻隔。', '赚钱不济。'],
		贵神: ['工作事业得贵人相助，政府支持。', '有贵人相助,能得到领导或政府支持认可,与人合作得利。', '身体没啥毛病', '工作事业有贵人相助顺利有提升。', '赚钱与合作顺利，得心应手。'],
		吊客: ['工作有倒霉的事。', '工作上不顺压力大或领导找麻烦。', '思想压力极大会有生病。', '工作多不顺居多，仕途阻隔。', '赚钱不易。'],
		病符: ['工作事业上有忧愁、忧虑担心，烦心事多。', '有小病但无碍,遇事则多困阻常出烦心事。', '有小病但无碍。', '工作多不顺烦心事多，仕途阻隔。', '赚钱不济。'],
	},
	青龙: {
		太岁: ['走动中见贵，文印不利，引起工作上的麻烦、口舌官司、被降职。', '工作有麻烦被强压或降职,贵人不相助。', '多有口舌纷争烦恼或有小病。', '工作上被强压或降职,贵人不相助', '赚钱不济或有降职或失业。'],
		青龙: ['重重见喜，学业有成，走动多，升迁、顺利。', '事业多见喜,财上有获利,贵人多相助', '身体没啥毛病', '学业事业顺利有成，走动多，会有升迁', '财上有获利,贵人多相助。'],
		丧门: ['文印方面引起纠纷，乐极生悲，喜事变丧事。', '运气转好会出门走动,会伴有小不开心事。', '身体没啥毛病', '事业顺利有成，走动多，会有升迁,但是有纠纷或丧气事。', '财上有获利,贵人多相助。'],
		六合: ['合作发财，文印方面进利，结婚得子，桃花年。', '事业学业多见喜,有桃花，或结婚得子', '身体没啥毛病', '事业顺利，桃花多或有感情喜事。', '赚钱上顺利居多。'],
		官符: ['文引上有成就，有名气，途中见贵。', '运程好，有走动运，走出去事业有发展，财运很旺。', '身体没啥毛病', '事业顺利有成，走动多还有收获，会有升迁和发展。', '财上有获利，财运很旺。'],
		小耗: ['投资在学业或晋升上面，因喜庆事花费支出。', '因学业事业或爱好等喜庆开心事花钱。', '身体没啥毛病', '在事业和学业方面投入精力多。', '会在学业事业工作或爱好等事上花钱。'],
		大耗: ['文印方面破财，花钱买文凭，因喜庆事而破财。', '学业有利,会有出行走动，会有支出破财。', '身体没啥毛病', '在事业和学业方面投入。', '会在学业事业工作或爱好等事上花钱。'],
		朱雀: ['文书、变动、走动方面引起口舌官司、乐极生悲，酒色生灾。', '学习事业有利,适合走动和变动,但是难免有口舌纠份。', '身体没啥毛病', '在事业和学业方面学习事业有利，走动和变动才能获利，会有口舌纠份', '会因好事变化而有额外支出。'],
		白虎: ['文书、变动、走动方面引起争斗、血光，车祸、道路、伤灾。', '会有生病受伤或其它意外。', '会有生病受伤或其它意外。', '在事业和学业方面会受意外的影响。', '会在意外或外出的事上花费。'],
		贵神: ['文印事业中见贵，得助，走动中见贵等。', '贵人相助学业事业做事顺利。', '身体没啥毛病', '贵人相助学业事业做事顺利。', '会在学业和贵人身上花费支出。'],
		吊客: ['文印方面引起纠纷，乐极生悲，喜事变丧事。', '好事变坏事诸多不利。', '思想压力大偶有生病。', '好事变坏事诸多不利或有口舌纠份', '会因好事变化而有额外支出。'],
		病符: ['酒色成病，神经有病，文印、事业、财利上忧愁。', '事业有利,但是身体小病小疾,工作见忧,财上有失.', '身体小病小疾,工作见忧', '工作多忧,事业有利,但是身体有病疾,财上有失.', '会因身体或意外有额外支出。'],
	},


	丧门: {
		太岁: ['犯官非，牢狱、不顺等', '有长辈生病，或有是非、小人、有人虎视眈眈盯着你。', '有长辈生病。', '犯官非不顺,有小人纠缠烦恼、有人虎视眈眈盯着。', '赚钱影响不大。'],
		青龙: ['外出走动，纠纷，不顺，文印方面不顺，死人等', '有小人纠缠烦恼事,会荣誉工作的事烦恼。', '思想压力大', '犯官非不顺,有小人纠缠烦恼，因荣誉名声的事烦恼。', '赚钱影响不大。'],
		丧门: ['死人，倒霉。', '本就倒霉不顺又有亲人生病去世的事。', '有长辈生病或去世。', '本就倒霉不顺又有亲人生病去世的事。', '赚钱不顺影响不大。'],
		六合: ['不利合作，财运不济，感情纠纷。', '财运合作不济或有感情纠纷', '思想压力大。', '工作事业不利合作难成。', '财运一般不会有好的变化。'],
		官符: ['工作事业不利，牢狱、官非。', '工作不顺或有纠纷是非口角', '思想压力大。', '工作事业不利合作难成或有纠纷是非口角。', '财运一般不会有好的变化。'],
		小耗: ['死人、破财、破败。', '破财耗神不顺困扰', '思想压力大。', '工作或家庭事情耗神。', '有破财或大的支出'],
		大耗: ['死人、破财、破败。', '破财耗神不顺困扰', '思想压力大。', '工作或家庭事情耗神很大。', '有破财或大的支出'],
		朱雀: ['官非争斗、因死人而引起官非。', '有纠纷是非口角', '思想压力大。', '有纠纷是非口角，工作事业不利。', '财运一般不会有好的变化。'],
		白虎: ['死人、血光、牢狱、官非。', '有亲生病去世或官非等事发生。', '家人或自己易生病', '有纠纷是非口角或有亲人生病去世。', '财运一般不会有变化。'],
		贵神: ['工作事业无助、反招小人，求官、求贵中倒霉、降职。', '无助反招小人,工作中比较倒霉、降职或失业。', '有长辈生病。', '无助反招小人,工作中比较倒霉、降职或失业。', '赚钱一般。'],
		吊客: ['死人，倒霉。', '有亲人生病去世等事发生。', '家人或自己易生病', '有纠纷是非口角或有亲人生病去世。', '财运一般不会有变化。'],
		病符: ['病死，丧葬，得病。', '亲人或自己多有疾病事情缠身', '亲人或自己多有疾病事情缠身', '亲人或自己多有疾病事情缠身', '财运一般不会有变化。'],
	}
	,
	六合: {
		太岁: ['合作犯官非，感情起风波，财上见官非。', '有合作纠纷或感情风波,财上有纠纷。', '事多会心烦', '有合作纠纷或感情风波,财上有纠纷。', '财上或感情有纠纷导致有支出。'],
		青龙: ['合作见喜，财运旺，婚庆、喜庆，学业文印有利，得财。', '必有异性之喜，且财运事业学业进展最佳。', '身体没啥毛病', '事业顺利有成，必有异性之喜，且财运事业学业进展最佳。', '财运很旺还有其它喜事。'],
		丧门: ['合作纠纷，感情纠纷，破财。', '有纠纷或口舌,感情或合作有分歧,破财等。', '身体没啥毛病', '有纠纷或口舌,感情或合作有分歧,破财等', '有小破财。'],
		六合: ['合作发财，添人进口，感情好，顺利，中奖，股票获利等。', '财运事业两兴，且家中或自己有喜事。', '身体没啥毛病', '财运事业两兴，且家中或自己有喜事。', '财运很旺还有其它喜事或偏财。'],
		官符: ['工作事业得利，合作有利。', '工作顺利财运兴旺。', '身体没啥毛病', '工作顺利财运兴旺。', '工作事业得利，合作有利。'],
		小耗: ['文印方面破财，花钱买文凭，因喜庆事而破财。', '虽有财,但会支出让进财支出去差不多。', '身体没啥毛病', '事业投入收入也伴随大的支出。', '钱有的进也有大的出。'],
		大耗: ['文印方面破财，花钱买文凭，因喜庆事而破财。', '虽有财,但会支出比进财还大。', '身体没啥毛病', '事业投入收入也伴随大的支出。', '钱有的进也有大的出。'],
		朱雀: ['因合作犯口舌、感情纠纷', '有纠纷或口舌,感情或合作不稳定', '身体没啥毛病', '有纠纷或口舌,感情或合作不稳定。', '财上或感情有纠纷导致有支出。'],
		白虎: ['因感情、合作而生争斗。', '有纠纷或口舌,感情或合作有分歧', '身体没啥毛病', '有纠纷或口舌,感情或合作不稳定。', '财上或感情有纠纷导致有支出。'],
		贵神: ['合作中遇贵人相助，得财、旺财。', '遇贵人相助，得财、旺财好运抬头。', '身体没啥毛病', '遇贵人相助，得财、旺财好运抬头。', '财上遇贵人相助。'],
		吊客: ['合作纠纷，感情纠纷，破财。', '合作纠纷，感情纠纷，破财。', '身体没啥毛病', '遇贵人相助，得财、旺财好运抬头。', '财上遇贵人相助。'],
		病符: ['酒色成灾，合作不顺，感情烦恼。', '感情或合作有烦恼,多应酬交际。', '身体没啥毛病', '合作的事情烦恼，应酬交际多还多有不顺。', '支出主要是在交际和应酬上'],
	}
	,

	官符: {
		太岁: ['工作、事业有纷争、降职官非。', '工作事业有纷争不顺或降职变动。', '精神压力大', '工作事业有纷争不顺或降职变动。', '或有降低的影响。'],
		青龙: ['工作、事业、仕途通达，得财、掌权、为官得印、升迁。', '工作事业有喜事,得财掌权升职之类的。', '身体没啥毛病', '工作事业有喜事,得财掌权升职之类的。', '遇贵人相助生财。'],
		丧门: ['工作事业不顺，倒霉、纠纷、官司口舌。', '有倒霉纠纷口舌，甚至背黑锅。', '身体没啥', '工作有倒霉纠纷口舌，甚至背黑锅。', '多有不顺'],
		六合: ['财运旺或异性缘、感情', '财运旺或异性缘感情向好。', '身体没啥', '财运旺异性缘感情向好。', '财运向好'],
		官符: ['官运恒通、事业发展、女人则主结婚或异性缘、感情。', '工作财运不错,女的话有感情有进展。', '身体没啥', '事业财运旺多得照护。', '财运旺盛'],
		小耗: ['花钱买官、仕途破财。', '事业有利但破小财', '身体没啥', '事业有利但破小财', '会在工作上小破财有花费。'],
		大耗: ['花钱买官、仕途破财。', '事业很有发展，同时会消耗很大支出。', '身体没啥', '事业有利但破财耗神', '会在工作上破财有花费。'],
		朱雀: ['工作、事业上起争执，官司口舌，被诬陷，为别人顶罪。', '必然见官非纠纷，可能被诬陷为别人顶罪。', '身体没啥', '工作有见官非纠纷，可能被诬陷为别人顶罪。', '多有不顺'],
		白虎: ['工作事业中有官非、争斗、或因工作而受伤。', '有事非分歧或因工作而自己很受伤。', '常因工作身体常受伤', '工作有有事非分歧或因工作而自己很受伤。', '多有不顺'],
		贵神: ['工作事业有利，得领导提拔、升职。', '作事业有利，得领导提拔或升职。', '身体没啥', '事业有利，得领导提拔或升职。', '财运向好'],
		吊客: ['事业学业不顺，倒霉、纠纷、官司口舌。', '会遇到分手离婚官司之类的倒霉事。', '身体没啥', '事业学业不顺，倒霉、纠纷、官司口舌。', '多有不顺'],
		病符: ['工作、事业不顺，因工作而病，忧愁、烦恼。', '工作不顺，会有忧愁、烦恼的事情。', '身体或有小病', '工作事业不顺，而忧愁烦恼或生病。', '多有不顺'],
	}
	,

	小耗: {
		太岁: ['死人、破财、经济纠纷。', '会有小不顺，会破财耗神。', '压力大多烦忧。', '会有小不顺，会破财耗神。', '多有不顺'],
		青龙: ['买文凭、破财、为异性而破财，因酒色而破财。', '在学习和爱好、异性和吃喝花钱。', '一般没事', '走动多与异性打交道多吃喝多,', '在学习和兴趣上投入,为异性和吃喝花钱。'],
		丧门: ['死人、纠纷、破财、官司。', '会为纠纷等耗神甚至有伤逝难过的事情。', '压力大多烦忧。', '会为纠纷破财官司等耗神甚到有伤逝难过的事情。', '多有不顺'],
		六合: ['合作破财、感情不利。', '破财感情不稳定。', '压力大多烦忧。', '合作破财、感情不利。', '多有不顺'],
		官符: ['因工作、事业、官司等破财。', '有小破财，但是事业有起色。', '压力大多烦忧。', '有小破财，但是事业有起色。', '多有不顺有小破财。'],
		小耗: ['死人、大破财、大哭。', '有小破财,财运不济。', '压力大多烦忧痛苦,或有亲人生病。', '有小破财,财运不济。', '财运不济。'],
		大耗: ['死人、大破财、大哭。', '有破财耗神的事。', '压力大多痛苦,或有亲人去世。', '有破财,财运不济。', '财运不济。'],
		朱雀: ['口舌、是非、破败，经济官司，破财，被诬陷、被劫。', '有口舌是非耗财，财运差甚至有被诬陷的事情。', '会有病扰因病吵架', '口舌、是非、破败，经济官司，破财。', '财运差,有口舌是非耗财'],
		白虎: ['车祸、破财、血光、意外交通事故破财等。', '有车祸、破财、血光、意外交通事故破财等', '身体有意外', '有车祸、破财、血光、意外交通事故或其它不顺。', '有车祸、破财、血光、意外交通事故破财等'],
		贵神: ['为贵人而破财，因工作事业而破财。', '为贵人有支出，或因工作事业而有支出破财。', '身体没啥', '为贵人或获取帮助有支出，能多少获得贵人的帮助。', '为贵人或获取帮助有支出。'],
		吊客: ['死人、纠纷、破财、官司。', '会为纠纷破财官司等耗神甚到有伤逝难过的事情。', '身体没啥', '会为纠纷破财官司等耗神甚到有伤逝难过的事情。', '诸事不顺财运不济。'],
		病符: ['因病而破财，为钱而病。', '会生病破财。', '会生病', '生病受伤耗神。', '会生病破财。'],
	},
	大耗: {
		太岁: ['死人、破财、经济纠纷。', '有破财耗神或倒霉事不顺事发生。', '身体没啥', '会有死人、破财、经济纠纷或其它不顺。', '诸事不顺财运不济。'],
		青龙: ['买文凭、破财、为异性而破财，因酒色而破财。', '为学业或异性支出破财，因交际发展而出支破财。', '身体没啥', '忙于交际扩展人脉。', '为学业工作或异性支出破财。'],
		丧门: ['死人、纠纷、破财、官司。', '会为纠纷破财等事耗神郁恼。', '身体没啥', '会为纠纷破财等事耗神郁恼。', '诸事不顺财运不济。'],
		六合: ['合作破财、感情不利。', '投入多产出少多破财合作感情多消耗。', '费神劳心', '会有合作破财但最终有变好。', '先难后易最终变好。'],
		官符: ['因工作、事业、官司等破财。', '因工作、事业、官司等破财。', '身体没啥', '忙于工作事业、或有官司等。', '因工作、事业、官司等破财。'],
		小耗: ['死人、大破财、大哭。', '会因亲人伤病等耗神破小财。', '会有亲人伤病', '工作事业正常压力大。', '会因亲人伤病等耗神破小财。'],
		大耗: ['死人、大破财、大哭。', '会因亲人伤病等耗神破财。', '会有亲人伤病', '工作事业正常耗大神。', '会因亲人伤病等耗神破财。'],
		朱雀: ['口舌、是非、破败，经济官司，破财，被诬陷、被劫。', '破财有纠纷口舌是非,甚至还要帮人背黑锅', '身体没啥事', '有纠纷口舌是非,甚至还要帮人背黑锅。', '诸事不顺财运不济。'],
		白虎: ['车祸、破财、血光、意外交通事故破财等。', '注定有破财、有牢狱之灾或受伤。', '身体会有病伤', '注定有破财、有牢狱之灾或受伤的事情。', '诸事不顺财运不济。'],
		贵神: ['为贵人而破财，因工作事业而破财。', '工作方面有大的支出，出现贵人帮助。', '身体会有病伤', '工作方面出现贵人帮助。', '工作和贵人方面有花费支出。'],
		吊客: ['死人、纠纷、破财、官司。', '亲人生病或去世的事。大耗财或有关土地房屋事。', '家人或自己身体出现病痛', '会有亲人生病去世或土地房屋损耗的事情。', '健康原因有支出'],
		病符: ['因病而破财，为钱而病。', '为生病而花钱。', '家人或自己身体出现病痛', '会有亲人生病去世或土地房屋损耗的事情。', '健康原因有支出'],
	}
	,
	朱雀: {
		太岁: ['牢狱、官司、纠纷。', '有纠纷口角是非。', '身体没啥事', '有纠牢狱、官司、纠纷等事困扰。', '诸事不顺财运不济。'],
		青龙: ['文印、走动、旅途、变动而犯官非。', '因为学业或事业，或外出有纠纷口角是非。', '身体没啥事', '因为学业或事业或外出有纠纷口角是非。', '诸事不顺财运不济。'],
		丧门: ['牢狱、官司、纠纷。', '有口舌纠纷，甚至诉讼官司。', '身体没啥事', '有口舌纠纷，甚至诉讼官司。', '诸事不顺财运不济。'],
		六合: ['合作、经济纠纷，异性缘合解。', '会遇小人弄是非纠纷。', '身体没啥事', '合作有小人不顺,最后平稳处理。', '不顺但最终能处理。'],
		官符: ['牢狱、官司、工作事业纠纷。', '口舌纠纷难免，事业严重困阻。', '身体没啥事', '有合作经济纠纷。', '财运不顺。'],
		小耗: ['打官司、破财、口舌。', '有口舌纠纷，甚至替人背黑锅。', '身体没啥事', '有纠纷口舌是非,甚至还要帮人背黑锅。', '诸事不顺财运不济。'],
		大耗: ['打官司、破财、口舌。', '有是非破财不说还费力不讨好,甚至替人背黑锅。', '身体没啥事', '有纠纷口舌是非,甚至还要帮人背黑锅。', '会破财。'],
		朱雀: ['口舌、官司不断，因口舌引起官司', '有口舌纠纷，甚至诉讼官司。', '身体没啥事', '有口舌纠纷，甚至诉讼官司。', '诸事不顺财运不济。'],
		白虎: ['因争斗、血光、车祸等意外之事打官司。', '因为意外受伤方面的口舌诉讼等。', '会有受伤', '有口舌纠纷诉讼官司。', '诸事不顺财运不济。'],
		贵神: ['工作事业惹口舌官司、背黑锅、因贵人引起口舌官司', '有口舌纠纷,甚至还要背黑锅。', '身体没啥事', '有口舌纠纷，甚至诉讼官司。', '诸事不顺财运不济。'],
		吊客: ['牢狱、官司、纠纷。', '有口舌纠纷,甚至还要背黑锅。', '身体没啥事', '有口舌纠纷，甚至诉讼官司不顺心事。', '健康上有破费。'],
		病符: ['为口舌官司而忧虑或医疗纠纷。', '有口舌纠纷,有病缠身或与医生有分歧。', '有病缠身', '有口舌纠纷,有病缠身或与医生有分歧。', '健康上有破费'],
	}
	,

	白虎: {
		太岁: ['牢狱、意外之灾，官非血光。', '有意外受伤或是非发生。', '会有受伤精神压力大', '有受伤缠身或不顺的事。', '健康上有破费'],
		青龙: ['打斗，争斗，交通事故。', '有争斗或交通意外。', '会有受伤精神压力大', '有受伤缠身或争斗或交通意外的事。', '健康上有破费'],
		丧门: ['死人、意外伤亡', '会受伤或有意外。', '会有受伤精神压力大', '有受伤缠身或争斗或交通意外的事。', '健康上有破费'],
		六合: ['合作中产生争斗，因异性而争斗，因财而斗。', '合作中有大分歧而争斗，或因异性或钱而有是非。', '会有受伤精神压力大', '有意外但最终都解决。', '健康上有破费'],
		官符: ['为意外事故打官司、官灾。', '会有意外受伤与当政府部门打交道。', '会有受伤精神压力大', '有意外但最终都解决。', '健康上有破费'],
		小耗: ['打斗、伤灾、血光之事、车祸而破财。', '有小破财耗神的事情，多因交通意外、伤病或打斗等受伤的事情。', '会有受伤精神压力大', '有意外但最终都解决。', '有意外小破财'],
		大耗: ['打斗、伤灾、血光之事、车祸而破财。', '有破财耗神的事情，多因交通意外、伤病或打斗等受伤的事情。', '会有受伤精神压力大', '有意外但最终都解决。', '有意外破财'],
		朱雀: ['打斗、伤灾、血光之灾，口舌是非、官司', '事阻多风波,有口舌是非纠缠之事。', '会有受伤精神压力大', '有意外但最终都解决。', '有口解小破财'],
		白虎: ['意外伤灾不断，车祸血光之灾。', '有伤病或车祸等身体受伤的事。', '会有受伤精神压力大', '有伤病或车祸等身体受伤的事', '有意外破财'],
		贵神: ['因贵人而打斗伤灾。', '有身体受伤的事但会贵人相助。', '会有受伤精神压力大', '有身体受伤的事但会贵人相助。', '会因生病或受伤破财'],
		吊客: ['死人、意外伤亡', '有意外或伤病亡事发生。', '有意外或伤病亡事发生。', '有受意外伤病影响。', '会因生病或受伤破财'],
		病符: ['筋骨、血液之病、因斗伤而病，意外引起疾病', '有伤病或动手术伤身之事。', '会受伤生病意外或动手术。', '有受意外伤病影响。', '会因生病或受伤破财'],
	}
	,

	贵神: {
		太岁: ['工作事业不顺，官非。', '有贵人帮但是工作方面有麻烦。', '精神压力大', '有贵人帮但是工作方面有麻烦。', '无太大变化'],
		青龙: ['财气，喜庆，事业走动、变动，遇贵人相扶。', '有贵人帮助，有走动，财运、事业两丰收.', '一切向好', '有贵人帮助，有走动，财运、事业两丰收.', '财运不错'],
		丧门: ['求贵不顺，丧气，花销，哭，有小人。', '多有不顺小破财有小人。', '身体没啥事', '多有不顺小破财有小人。', '有破财。'],
		六合: ['因贵人而得财，合作遇贵，与贵人合作。', '有贵人帮助得财合作也能成。', '身体没啥事', '因贵人而得财，合作遇贵，与贵人合作。', '合作得财。'],
		官符: ['升职，仕途遇贵人扶助，事业通达，', '事业上有喜,有官方帮助。', '身体没啥事', '升职事业上有喜,有官方有领导帮助。', '合作得财。'],
		小耗: ['因贵人破财，因事业破财。', '有贵人相助会破点小财。', '身体没啥事', '遇贵人扶助，事业顺利。', '有贵人相助会破点小财。'],
		大耗: ['因贵人破财，因事业破财。', '有贵人相助,仍会工作上破财。', '身体没啥事', '遇贵人扶助，事业顺利。', '有贵人相助会破点小财。'],
		朱雀: ['贵人有官非，贵人变小人，官非口舌中遇贵人。', '先遇小人麻烦，后面运行抬头开始变好。', '身体没啥事', '先遇小人麻烦，后面运行抬头开始变好。', '财运先难后面向好。'],
		白虎: ['贵人有车祸血光之灾，或自己伤病灾中遇贵人，', '有病伤但在病伤中有帮助自己的人。', '有病伤意外', '麻烦解除，运行抬头,开始变好,会遇贵人。', '财运向好。'],
		贵神: ['工作事业顺利、得财。', '工作事业顺利、得财也顺。', '身体没啥事', '工作事业顺利、得财。', '财运向好。'],
		吊客: ['求贵不顺，丧气，花销，哭，有小人。', '多有不顺小破财有小人。', '身体有不舒服', '多有不顺小破财或有小人。', '财运一般。'],
		病符: ['疾病、忧愁中遇贵，贵人忧愁、烦恼。', '会生病，多有不顺和烦恼。', '会生病', '麻烦解除，运行抬头,开始变好。', '财运一般。'],
	},
	吊客: {
		太岁: ['犯官非，牢狱、不顺等', '做事有困阻失业纠纷等不顺之类的事。', '精神压力大', '做事前期波动多，后期有贵人相助。', '无太大变化'],
		青龙: ['外出走动，纠纷，不顺，文印方面不顺，死人等', '有外出事不顺或有纠纷病丧事等。', '精神压力大', '有外出事不顺或有纠纷病丧事等。', '无太大变化'],
		丧门: ['死人，倒霉。', '有生病或死亡、或倒霉的事情发生。', '有生病或死亡', '做事有困阻不顺之类的事。', '无太大变化'],
		六合: ['不利合作，财运不济，感情纠纷。', '合作财运不济，或有感情纠纷。', '有生病或死亡', '合作财运不济，或有感情纠纷。', '无太大变化'],
		官符: ['工作事业不利，牢狱、官非。', '工作合作不顺，有纠纷是非。', '无太大问题', '工作合作不顺，有纠纷是非。', '无太大变化'],
		小耗: ['死人、破财、破败。', '有破财丧气的事情发生,或有丧事。', '有生病或死亡', '有破财丧气的事情发生', '无太大变化'],
		大耗: ['死人、破财、破败。', '多有耗神伤财之事发生。', '有生病或死亡', '多有耗神伤财之事发生。', '无太大变化'],
		朱雀: ['官非争斗、因死人而引起官非。', '有是非争斗,或有官司诉讼。', '有生病或死亡', '有是非争斗,或有伤亡官司诉讼。', '无太大变化'],
		白虎: ['死人、血光、牢狱、官非。', '会有是非或受伤意外或生病的事情。', '有生病或死亡', '会有是非或受伤意外或生病的事情。', '无太大变化'],
		贵神: ['工作事业无助、反招小人，求官、求贵中倒霉、降职。', '工作不顺失业或有小人。', '有生病或死亡', '工作事业无助、反招小人，求官、求贵中倒霉、降职。', '无太大变化'],
		吊客: ['死人，倒霉。', '会遇亲人去世或亲人不顺伤心事等。', '会遇亲人去世或亲人不顺伤心事等。', '会有忧愁倒霉不顺事如生病分手等。。', '无太大变化'],
		病符: ['病死，丧葬，得病。', '有生病住院的事情或亲人去世。', '会有忧愁倒霉不顺事如生病分手等。', '会有忧愁倒霉不顺事如生病分手等。', '无太大变化'],
	},

	病符: {
		太岁: ['因官非而得病，忧愁、官司，因上司而忧愁、烦恼。', '有忧愁的事情,因工作居多。', '因官非得病忧愁或因工作忧愁烦恼', '会受病和情绪的影响', '无太大变化'],
		青龙: ['酒色成疾，水土不服，文书印财、喜庆之事出毛病。', '应酬多做事多受阻挠，十拿九稳的好事上老出意外。', '会因交际或感情犯愁。', '做事多受阻挠,奔波应酬多,正常的好事也老出意外。', '无太大变化'],
		丧门: ['因纠纷、背黑锅、倒霉而生病忧。', '因丧气事情如背黑锅、倒霉事而生病忧。', '因纠纷、背黑锅、倒霉而生病忧', '会受病和情绪的影响，有倒霉事背黑锅等。', '无太大变化'],
		六合: ['为财而病，为孩子而病，忧愁、花柳之病。', '有自己或家人生病。', '为财而病，为孩子而病，忧愁、花柳之病。', '会受病和情绪的影响，事有阻挠。', '无太大变化'],
		官符: ['为纠纷、官司而病，因工作事业而病。', '有忧愁的事情生病或极度困扰。', '为纠纷、官司而病，因工作事业而病', '会受病和情绪的影响，事有阻挠。', '无太大变化'],
		小耗: ['痨病、因破财而病。', '受破财生病困扰。', '痨病、因破财而病', '会受病和情绪的影响，事有阻挠。', '无太大变化'],
		大耗: ['痨病、因破财而病。', '受破财生病困扰。', '痨病、因破财而病', '会受病和情绪的影响，事有阻挠。', '无太大变化'],
		朱雀: ['因口舌、官司致病，忧愁、烦恼。', '受口舌、官司、破财困扰烦恼。', '因口舌、官司致病，忧愁、烦恼。', '会有口舌是非，或受病和情绪的影响，事有阻挠。', '无太大变化'],
		白虎: ['伤灾住院，血液病，手术，打斗而病。', '生病或受伤,会去医院。', '伤灾住院，血液病，手术，打斗而病', '会受病和情绪的影响，事有阻挠。', '无太大变化'],
		贵神: ['忧郁成疾，求助无缘。', '有病或忧郁似疾的事情。', '有疾病缠身或倒霉烦心事', '会受病和情绪的影响，事有阻挠。', '无太大变化'],
		吊客: ['因纠纷、背黑锅、倒霉而生病忧。', '因丧气事情如背黑锅、倒霉事而生病忧。', '有疾病缠身或倒霉烦心事', '会有口舌是非背黑锅，或受病和情绪的影响，事有阻挠。', '无太大变化'],
		病符: ['病上加病，病重。', '有疾病事情缠身', '有疾病事情缠身', '身体受病和情绪的影响，事情则会出问题。', '会出问题'],
	}

}



// 一般方法 
export const wuxingToShishenList = {
	//    木      火     土     金        水 
	木: ['比劫', '食伤', '财才', '官杀', '印枭'],
	火: ['印枭', '比劫', '食伤', '财才', '官杀'],
	土: ['官杀', '印枭', '比劫', '食伤', '财才'],
	金: ['财才', '官杀', '印枭', '比劫', '食伤'],
	水: ['食伤', '财才', '官杀', '印枭', '比劫']
};

// 一般方法 
export const shishenToWuXingList = {
	// 木
	木: {
		"比肩": "木",
		"劫财": "木",
		"食神": "火",
		"伤官": "火",
		"正财": "土",
		"偏财": "土",
		"正官": "金",
		"七杀": "金",
		"正印": "水",
		"偏印": "水"
	},
	// 火
	火: {
		"比肩": "火",
		"劫财": "火",
		"食神": "土",
		"伤官": "土",
		"正财": "金",
		"偏财": "金",
		"正官": "水",
		"七杀": "水",
		"正印": "木",
		"偏印": "木"
	},
	// 土
	土: {
		"比肩": "土",
		"劫财": "土",
		"食神": "金",
		"伤官": "金",
		"正财": "水",
		"偏财": "水",
		"正官": "木",
		"七杀": "木",
		"正印": "火",
		"偏印": "火"
	},
	// 金
	金: {
		"比肩": "金",
		"劫财": "金",
		"食神": "水",
		"伤官": "水",
		"正财": "木",
		"偏财": "木",
		"正官": "火",
		"七杀": "火",
		"正印": "土",
		"偏印": "土"
	},
	// 水
	水: {
		"比肩": "水",
		"劫财": "水",
		"食神": "木",
		"伤官": "木",
		"正财": "火",
		"偏财": "火",
		"正官": "土",
		"七杀": "土",
		"正印": "金",
		"偏印": "金"
	}
};

//十神得到五行 
export const getWuXingByShiShen = (DayganWuXing: string, ShiShen: string): string => {
	return shishenToWuXingList[DayganWuXing][ShiShen]
};




// 根据这个得到身体的map  https://weibo.com/6239252054/L3aFReNbg
//得到身体的map,   顺序是    年 +月 + 日 + 时  注意 共 4 组 8个   是天干+地支 | 天干+地支        
const gongweiBodyBaseMap = ['头部', '颈部', '胸部', '腰部', '腹部', '胯部', '大腿', '小腿']


//得到八字代表的六亲 

export const getLiuQinMap = (sex: number) => {
	const refItem = (sex === 1 ? ['父亲', '母亲', '兄弟', '姐妹', '自己', '妻子', '儿子', '女儿'] : ['母亲', '父亲', '姐妹', '兄弟', '自己', '老公', '女儿', '儿子'])

	return refItem

};

//得到八字代表的身体部位 

export const getBodyMap = () => {
	const gongweiBodyBaseMap = ['头部', '颈部', '胸部', '腰部', '腹部', '胯部', '大腿', '小腿']

	return gongweiBodyBaseMap

};

export const getBodyDespMap = () => {
	const gongweiBodyDespBaseMap = ['头部是指鼻孔以上部位，如：耳朵、眼睛、头颅、头发、脑神经系统、面部、鼻子、牙齿、舌等', '颈部是指鼻也以下肩部以上部分如：牙齿，咽喉，脖子、舌、颈椎等',
		'胸部是肩部以下肋骨以上：包括后背，胸部、肺、上肢、胳膊等。', '腰部是指胁骨以下到腰部以上，如：心脏、肝、胆、乳房、上焦等。',
		'腹部主要是小腹部，指肠、胃、脐部、膀胱、肾盂等。',
		'胯部主是指胯以及臀部，如屁股，泌尿系统、生殖系统、消化系统、排泄系统、肛部、阴部等。',
		'大腿以下的位置，胯部、大腿根部、大腿、膝盖等。',
		'小腿是指膝盖以下的位置，如小腿、脚、踝骨、脚趾等等。',
	]
	return gongweiBodyDespBaseMap

};






//通过日干得到五行十神

export const TianGanToShiShen = (DayganWuXing: string, wuXing: string): string => {
	const wuxinglist = ['木', '火', '土', '金', '水']
	const index = wuxinglist.indexOf(wuXing)
	return wuxingToShishenList[DayganWuXing][index]

};


//根据地支得到月份 
export const getMonthByDiZhi = (item: string | string[]) => {

	let refitem: string = '';

	if (Array.isArray(item)) {
		item.forEach(i => refitem += MonthList[dizhiList.indexOf(i)] + ',')
	}
	else {
		refitem = MonthList[dizhiList.indexOf(item)]
	}

	return refitem
}


//根据日柱得到性趣的表现 

export const getSexLoveByDiShi = (item: string) => {

	let refitem: string[] = [];

	const list: { [key: string]: string[] } = {
		长生: ['文静端庄娇羞，十分可爱，顺从，相处久让人乏味。', '性欲强烈，喜欢操之过激，一味求欢，不懂渐进而行。'],
		沐浴: ['不太关心性伙伴是谁，但喜欢对方热烈粗野。', '懂得风流浪漫，懂渐进而行，最终能让双方满意愉快。'],
		冠带: ['两性之事会探索，会痴情。', '会尝试更换各种异性，尝试各种性对象，草草上马，经常不能满足对方。'],
		临官: ['有强烈的需求和意愿，但对攻击性的性对象很下头。', '喜欢主动积极的女性，不喜欢内向害羞的性对象，本身缺乏自发性，喜欢性对象主动。'],
		帝旺: ['被动性的，很少主动，反映平淡，需要性对象指引才行。', '性欲热切，但只顾自己快乐，不怎么关心对方爽不爽。'],
		衰: ['与性伴侣配合天衣无缝，注重感官享受和精神享受。', '情绪化，行事草率，甚至有同性恋倾向。'],
		病: ['只顾自己快乐，不怎么关心对方爽不爽。', '精力旺盛，持续性强，花样多，受性对象欢迎，部分人有同性恋倾向。'],
		死: ['注重情调，要求频繁，妩媚多姿，会让性对象爱不释手，俗称名女人。', '技巧高明持久，能令性伴飘飘欲仙，快乐无比，缺点是姿势不怎么变。'],
		墓: ['文静端庄娇羞，内心渴望又不表达出来，一旦和对方有过，就会很大胆。', '很讲究性爱气氛，如感觉不到罗曼梯克，可能会拂袖而去。'],
		绝: ['会为财物或个性风流而为,不够稳定，不够和谐。', '持久力不强，落差大，难保持长期稳定的表现。'],
		胎: ['注重性生活，能力强，但有少数人属于性冷淡。', '技巧老练，持久力强，受性对象欢迎，次数少，质量高。'],
		养: ['情绪不稳定，反应时好时快，令人琢磨不定。', '体贴多情，举止温和，配合默契，无上快乐。'],
	}
	refitem = list[item]


	return refitem
}


//根据日柱得到性趣的表现 

export const getDiShiDespBySiZhu = (item: string) => {

	let refitem: string[] = [];

	const list: { [key: string]: string[] } = {
		长生: ['生长于踏实的家庭。', '亲情浓厚,', '幸福好运之命,', '子女必有贤孝有发展之人,'],
		沐浴: ['父母之间，可能有不能和睦相处情形。', '中年之前事职经常起变化，人生多见波澜。', '早年辛苦，中末限安祥。', '晚运较差，子女缘份较薄。'],
		冠带: ['幼年时期聪明有智慧，中年夫妻感情有不利事发生，', '青年期间变动较大，住所或是工作也常见变化,发展不错，', ' 幼年身体欠佳，长大之后反而非常健康；性格是一个可造的人材。', '有优秀的子女，'],
		临官: ['中年以后能得到相当的发展', '不适合在老家发展，离家发展的话就会风生水起。', '好命之人，但毕生有一次破财消灾的事情发生。', '晚年吉祥安顺。'],
		帝旺: ['性格相当独立，', ' 野心很大做事会孤注一掷，造成大破财甚至破产的事发生，', '事业心很强盛，中年期间能见成就，', '晚年多有孤独，'],
		衰: ['个性比较内向，易被他人所拖累，此命生平多见凶兆，', '半生顺调半生苦，勿要替人担保导致有去无还致欠债', '莫存太大理想，按步就班反而能见成就。', '为子女操心。'],
		病: ['小时体弱', '经常变换工作多有夫妻纷争', '中年常生病', '晚年注意经济困境。'],
		死: ['六亲缘薄', '工作多见辛劳男女缘份较差', '中年浮沉多见，', '子女距离远靠不上，个性也比较急燥，'],
		墓: ['所遇之事常比较缓慢', '有财运，年青时开销较大，做事有退缩反复，六亲靠不上。', '中年之后可以大展鸿图，具有相当生财能力。', '幼年期间身体较差，老年财运不错。'],
		绝: ['他乡自立之命；中年后财运不错，晚年安泰。', '朋友不多，', '他乡营谋，必定有成，但一生要防信用事。', '子女费心，'],
		胎: ['少时身体状况较差', '事业有很大变化升降', '年轻时岗位多变，中年后有发展，也必经一次生死大病，', '子女个性比较内向费心'],
		养: ['父母亲都具有相当的生财能力，', '有桃花情事之忧，', ' 六亲缘浅，夫妻难谐，多情致憾！', '子运圆满，事职安定。'],
	}
	refitem = list[item]


	return refitem
}

//是不是驿马: ['子寅', '丑亥', '寅申', '卯巳', '辰寅', '巳亥', '午申', '未巳', '申寅', '酉亥', '戌申', '亥巳'],
// 年日地支查地支

export const isYiMa = (zhi1: string, zhi2: string): boolean => {

	const RelaArray = ['子寅', '丑亥', '寅申', '卯巳', '辰寅', '巳亥', '午申', '未巳', '申寅', '酉亥', '戌申', '亥巳'];

	return (RelaArray.includes(zhi1 + zhi2));

};

//  '桃花': ['子酉', '丑午', '寅卯', '卯子', '辰酉', '巳午', '午卯', '未子', '申酉', '酉午', '戌卯', '亥子'],

export const isTaoHua = (zhi1: string, zhi2: string): boolean => {

	const RelaArray = ['子酉', '丑午', '寅卯', '卯子', '辰酉', '巳午', '午卯', '未子', '申酉', '酉午', '戌卯', '亥子'];

	return (RelaArray.includes(zhi1 + zhi2));

};

//是不是亡神

export const isWangShen = (zhi1: string, zhi2: string): boolean => {

	const RelaArray = ['子亥', '丑申', '寅巳', '卯寅', '辰亥', '巳申', '午巳', '未寅', '申亥', '酉申', '戌巳', '亥寅']

	return (RelaArray.includes(zhi1 + zhi2));

};

// 判断是不是半合 

export const isBanHe = (zhi1: string, zhi2: string): boolean => {


	const RelaArray = ['申子', '子辰', '午戌', '亥卯', '卯未', '酉丑', '寅午', '巳酉'];

	return (RelaArray.includes(zhi1 + zhi2) || RelaArray.includes(zhi2 + zhi1));

};




//  '金舆': ['甲辰', '乙巳', '丙未', '丁申', '戊未', '己申', '庚戌', '辛亥', '壬丑', '癸寅'],

export const getJinYuStart = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"甲": '辰',
		"乙": '巳',
		"丙": '未',
		"丁": '申',
		"戊": '未',
		"己": '申',
		"庚": '戌',
		"辛": '亥',
		"壬": '丑',
		"癸": '寅',
	};
	return DataMap[item];
};

// 国印 ：  甲见戌，乙见亥，丙见丑，丁见寅，戊见丑，己见寅，庚见辰，辛见巳。壬见未，癸见申。
export const getGuoYinStart = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"甲": '戌',
		"乙": '亥',
		"丙": '丑',
		"丁": '寅',
		"戊": '丑',
		"己": '寅',
		"庚": '辰',
		"辛": '巳',
		"壬": '未',
		"癸": '申',
	};
	return DataMap[item];
};

//根据年日支查驿马是啥 ,传递的参数为年支和日支，返回数组  



// export const GetYiMaStart = (str1: string, str2: string): string[] => {

//   const RelaArray = ['子寅', '丑亥', '寅申', '卯巳', '辰寅', '巳亥', '午申', '未巳', '申寅', '酉亥', '戌申', '亥巳'];
//   const result: string[] = [];
//   if (RelaArray.some(item => item.includes(str1))) {
//     result.push(RelaArray.find(item => item.includes(str1))!.charAt(1));
//   }
//   if (RelaArray.some(item => item.includes(str2))) {
//     result.push(RelaArray.find(item => item.includes(str2))!.charAt(1));
//   }
//   return result;

// };


// 得到驿马星 通过支找支 

export const getYiMa = (zhi: string) => {
	const DataMap: { [key: string]: string } = {
		"子": "寅",
		"丑": "亥",
		"寅": "申",
		"卯": "巳",
		"辰": "寅",
		"巳": "亥",
		"午": "申",
		"未": "巳",
		"申": "寅",
		"酉": "亥",
		"戌": "申",
		"亥": "巳",
	};
	return DataMap[zhi];
};


// ['甲丑', '甲未', '乙子', '乙申', '丙亥', '丙酉', '丁亥', '丁酉', '戊丑', '戊未', '己子', '己申', 
// '庚午', '庚寅', '庚丑', '庚未',
//  '辛午', '辛寅',  '壬卯', '壬巳', '癸卯', '癸巳'],

export const getTianYi = (gan: string) => {
	const DataMap: { [key: string]: string[] } = {
		"甲": ['丑', '未'],
		"乙": ['子', '申'],
		"丙": ['亥', '酉'],
		"丁": ['亥', '酉'],
		"戊": ['丑', '未'],
		"己": ['子', '申'],
		"庚": ['丑', '未'],
		"辛": ['午', '寅'],
		"壬": ['卯', '巳'],
		"癸": ['卯', '巳'],
	};
	return DataMap[gan];
};

// 得到桃花 // const RelaArray = ['子酉', '丑午', '寅卯', '卯子', '辰酉', '巳午', '午卯', '未子', '申酉', '酉午', '戌卯', '亥子'];
export const getTaoHua = (zhi: string) => {
	const DataMap: { [key: string]: string } = {
		"子": "酉",
		"丑": "午",
		"寅": "卯",
		"卯": "子",
		"辰": "酉",
		"巳": "午",
		"午": "卯",
		"未": "子",
		"申": "酉",
		"酉": "午",
		"戌": "卯",
		"亥": "子",
	};
	return DataMap[zhi];
};


//年支查地支
// '天喜': ['子酉', '丑申', '寅未', '卯午', '辰巳', '巳辰', '午卯', '未寅', '申丑', '酉子', '戌亥', '亥戌'],
export const getTianXiByZhi = (zhi: string) => {
	const DataMap: { [key: string]: string } = {
		"子": "酉",
		"丑": "申",
		"寅": "未",
		"卯": "午",
		"辰": "巳",
		"巳": "辰",
		"午": "卯",
		"未": "寅",
		"申": "丑",
		"酉": "子",
		"戌": "亥",
		"亥": "戌",
	};
	return DataMap[zhi];
};


//年支查地支
// '红鸾': ['子卯', '丑寅', '寅丑', '卯子', '辰亥', '巳戌', '午酉', '未申', '申未', '酉午', '戌巳', '亥辰'],
export const getHongLuanByZhi = (zhi: string) => {
	const DataMap: { [key: string]: string } = {
		"子": "卯",
		"丑": "寅",
		"寅": "丑",
		"卯": "子",
		"辰": "亥",
		"巳": "戌",
		"午": "酉",
		"未": "申",
		"申": "未",
		"酉": "午",
		"戌": "巳",
		"亥": "辰",
	};
	return DataMap[zhi];
};

// 年日地支查地支
//孤辰寡宿、阴差阳错日（如丙子、丁丑、戊寅等日柱）：主缘分浅薄，婚姻易错位或迟滞
// '孤辰': ['子寅', '丑寅', '寅巳', '卯巳', '辰巳', '巳申', '午申', '未申', '申亥', '酉亥', '戌亥', '亥寅'],
export const getGuChenByZhi = (zhi: string) => {
	const DataMap: { [key: string]: string } = {
		"子": "寅",
		"丑": "寅",
		"寅": "巳",
		"卯": "巳",
		"辰": "巳",
		"巳": "申",
		"午": "申",
		"未": "申",
		"申": "亥",
		"酉": "亥",
		"戌": "亥",
		"亥": "寅",
	};
	return DataMap[zhi];
};

// 年日地支查地支
// '寡宿': ['子戌', '丑戌', '寅丑', '卯丑', '辰丑', '巳辰', '午辰', '未辰', '申未', '酉未', '戌未', '亥戌'],
export const getGuaSuByZhi = (zhi: string) => {
	const DataMap: { [key: string]: string } = {
		"子": "戌",
		"丑": "戌",
		"寅": "丑",
		"卯": "丑",
		"辰": "丑",
		"巳": "辰",
		"午": "辰",
		"未": "辰",
		"申": "未",
		"酉": "未",
		"戌": "未",
		"亥": "戌",
	};
	return DataMap[zhi];
};

//'阴差阳错': ['丙子', '丁丑', '戊寅', '辛卯', '壬辰', '癸巳', '丙午', '丁未', '戊申', '辛酉', '壬戌', '癸亥'],
export const getYinChaYangCuoByDayGanZhi = (ganZhi: string) => {
	return ['丙子', '丁丑', '戊寅', '辛卯', '壬辰', '癸巳', '丙午', '丁未', '戊申', '辛酉', '壬戌', '癸亥'].includes(ganZhi);
};




//是否是生助
export const isShengZhuByWuxing = (str1: string, str2: string): boolean => {

	let ref = false;
	const rela = getWuXingRelation(str1, str2)
	if (rela === '生' || rela === '同') {
		ref = true;
	}
	return ref;

};

//是否是生助 
export const isKeXieHaoByWuxing = (str1: string, str2: string): boolean => {

	let ref = false;
	const rela = getWuXingRelation(str1, str2)
	if (rela != '生' && rela != '同') {
		ref = true;
	}
	return ref;

};

// 正月蛇，洞中休，
// 二月老鼠饿昏头，
// 三月老牛遍地走，
// 四月猴子满山溜。6
// 五月兔 4，六月狗 5，
// 七猪 八马 九羊头，
// 十月虎，潢山吼，
// 十一鸡 10，架上栖，
// 十二 老龙海底游。


// 正鸡二兔三羊青，
// 四蛇五马六月龙。
// 七猴八虎九月鼠，
// 十月老牛也有功。
// 十一月猪灰堆卧，
// 腊月狗会把财门。

//  苏国圣：每个生肖均有一个月为其愁月,如生肖为马 的人生于八月即生于愁月，这种人生来愁，无事也生愁，自寻烦恼，自己跟自己过不去，愁事多，压抑悲观。
export const getChouMonth = (item: string) => {
	// 数组格式[愁月，喜月，地支愁月，地支喜月]
	const DataMap: { [key: string]: string[] } = {
		"子": ["二", "九", "卯", "戌"],
		"丑": ["三", "十", "辰", "亥"],
		"寅": ["十", "八", "戌", "酉"],
		"卯": ["五", "二", "午", "卯"],
		"辰": ["十二", "六", "丑", "未"],
		"巳": ["一", "四", "寅", "巳"],
		"午": ["八", "五", "酉", "午"],
		"未": ["九", "三", "戌", "辰"],
		"申": ["四", "七", "巳", "申"],
		"酉": ["十一", "一", "子", "寅"],
		"戌": ["六", "腊", "未", "丑"],
		"亥": ["七", "冬", "申", "子"],
	}
	return DataMap[item];
};





// '亡神': ['子亥', '丑申', '寅巳', '卯寅', '辰亥', '巳申', '午巳', '未寅', '申亥', '酉申', '戌巳', '亥寅'],
// 根据年支得到亡神是什么

// 是不是禄神 
export const isLuShen = (str1: string, str2: string): boolean => {

	const RelaArray = ['甲寅', '乙卯', '丙巳', '丁午', '戊巳', '己午', '庚申', '辛酉', '壬亥', '癸子'];

	return (RelaArray.includes(str1 + str2));
	// return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

// 根据天干得到禄是什么 
export const getLuByGan = (item: string): string => {

	const DataMap: { [key: string]: string } = {
		"甲": '寅',
		"乙": '卯',
		"丙": '巳',
		"丁": '午',
		"戊": '巳',
		"己": '午',
		"庚": '申',
		"辛": '酉',
		"壬": '亥',
		"癸": '子',
	};
	return DataMap[item];
};

// '亡神': ['子亥', '丑申', '寅巳', '卯寅', '辰亥', '巳申', '午巳', '未寅', '申亥', '酉申', '戌巳', '亥寅'],
// 根据年支得到亡神是什么 
export const getWangShenByYearZhi = (item: string): string => {

	const DataMap: { [key: string]: string } = {
		"子": '亥',
		"丑": '申',
		"寅": '巳',
		"卯": '寅',
		"辰": '亥',
		"巳": '申',
		"午": '巳',
		"未": '寅',
		"申": '亥',
		"酉": '申',
		"戌": '巳',
		"亥": '寅',
	};
	return DataMap[item];
};

// '劫煞': ['子巳', '丑寅', '', '', '', '', '', '', '', '', '', ''],

export const getJieShaByYearZhi = (item: string): string => {

	const DataMap: { [key: string]: string } = {
		"子": '巳',
		"丑": '寅',
		"寅": '亥',
		"卯": '申',
		"辰": '巳',
		"巳": '寅',
		"午": '亥',
		"未": '申',
		"申": '巳',
		"酉": '寅',
		"戌": '亥',
		"亥": '申',
	};
	return DataMap[item];
};






// 是不是 羊刃 
export const isYangRen = (gan: string, zhi: string): boolean => {

	const RelaArray = ['甲卯', '乙寅', '丙午', '丁巳', '戊午', '己巳', '庚酉', '辛申', '壬子', '癸亥'];

	return (RelaArray.includes(gan + zhi) || RelaArray.includes(zhi + gan));
};

//天干是否相冲 
export const isTianGanChong = (str1: string, str2: string): boolean => {
	const RelaArray = ["甲庚", "乙辛", "丙壬", "丁癸"];

	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

//天干是否相合 如果相合返回合成的五行，否则返回空字符串  
export const isTianGanHe = (str1: string, str2: string): boolean => {
	const RelaArray = ["甲己合土", "乙庚合金", "丙辛合水", "丁壬合木", "戊癸合火"];
	// 寻找匹配的合化关系，并获取最后一个字符
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

//天干是否相合 如果相合返回合成的五行，否则返回空字符串  
export const getTianGanHeWu = (str1: string, str2: string): string => {
	const RelaArray = ["甲己合土", "乙庚合金", "丙辛合水", "丁壬合木", "戊癸合火"];
	// 寻找匹配的合化关系，并获取最后一个字符
	let lastChar = ''
	for (const rela of RelaArray) {
		if (rela.startsWith(str1 + str2) || rela.startsWith(str2 + str1)) {
			// 返回匹配元素的最后一个字符
			lastChar = rela[rela.length - 1];
		}
	}
	return lastChar

};

// TagsTmpData
//地支是否相六合  heruflag 合入标志
export const isDiZhiLiuHe = (str1: string, str2: string, heruFlag?: boolean): boolean => {
	const RelaArray = ["午未", "子丑", "寅亥", "卯戌", "辰酉", '巳申'];
	const RelaHeRuArray = ["子丑", "亥寅", "卯戌"];

	if (heruFlag) {
		// 子丑合：子水与丑土相合，可以转化为土的属性。寅亥合：寅木与亥水相合，可以转化为木的属性。卯戌合：卯木与戌土相合，可以转化为火的属性。
		return (RelaHeRuArray.includes(str1 + str2)); //单方合入才成
	}
	else {
		return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
	}



};

export const getDiZhiLiuHeWu = (str1: string, str2: string): string => {
	// '申子辰': '申子辰三合水',
	//   '寅午戌': '寅午戌三合火',
	//   '亥卯未': '亥卯未三合木',
	//   '巳酉丑': '巳酉丑三合金',
	//   '申辰': '申辰拱合水',
	//   '寅戌': '寅戌拱合火',
	//   '亥未': '亥未拱合木',
	//   '巳丑': '巳丑拱合金',
	//   '申子': '申子半合水',
	//   '子辰': '子辰半合水',
	//   '午戌': '午戌半合火',
	//   '亥卯': '亥卯半合木',
	//   '卯未': '卯未半合木',
	//   '酉丑': '酉丑半合金',
	//   '寅午': '寅午暗合土|半合火',
	//   '巳酉': '巳酉暗合水|半合金',
	//   '子巳': '子巳暗合火',
	//   '卯申': '卯申暗合金',
	//   '亥午': '亥午暗合木',
	//   '巳申': '',
	//   '辰酉': '',
	//   '卯戌': '',
	//   '寅亥': '',
	//   '子丑': '',
	//   '午未': '',

	const RelaArray = ["午未六合火或土", "子丑六合土", "寅亥相破|六合木", "卯戌六合火", "辰酉六合金", '巳申相破|六合水'];
	// 寻找匹配的合化关系，并获取最后一个字符
	let lastChar = ''
	for (const rela of RelaArray) {
		if (rela.startsWith(str1 + str2) || rela.startsWith(str2 + str1)) {
			// 返回匹配元素的最后一个字符
			lastChar = rela[rela.length - 1];
		}
	}
	return lastChar
};


//地支是否相冲 
export const isDiZhiChong = (str1: string, str2: string): boolean => {
	const RelaArray = ["子午", "丑未", "寅申", "卯酉", "辰戌", "巳亥"];

	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};



//地支是否相绝 盲派中用到 

// 寅酉绝：也称为金绝，通常指在文道、车马财方面的不利，表示文书隐匿藏私，道路伤灾，筋骨寸断等情况。

// 卯申绝：也称为木绝，主要关联在车马财、道路方面，可能意味着车辆道路的灾殃，财帛遗散，刀枪伤损等。

// 子巳绝：也称为水绝，主要关系到妇女、情义方面，可能涉及到情感变化、分离等情形。

// 午亥绝：也称为火绝，主要关系到口舌、争执方面，可能涉及到文书斗讼、取索争执等。

// 子巳情谊断，寅酉穿血衣，卯申路途死，午亥生闷气。缘分短。   
// 子巳、午亥、卯申、寅酉。命中有四绝为凶象，大运相绝也不吉。卯申相绝
// 如果木火比较少而金水比较多，就比木火多而金水少的人更容易抑郁。


//得到地支相冲的的元素 
export const getZhiChongEls = (zhi: string): string => {
	const DataMap: { [key: string]: string } = {
		"寅": '申',
		"申": '寅',
		"卯": '酉',
		"酉": '卯',
		"辰": '戌',
		"戌": '辰',
		"巳": '亥',
		"亥": '巳',
		"子": '午',
		"午": '子',
		"丑": '未',
		"未": '丑',
	};
	return DataMap[zhi];
};

export const isAdmin = (): boolean => {
	// 判断用户是否为管理员
	try {
		let lifeData = uni.getStorageSync('lifeData');
		let roles = lifeData?.$user?.userInfo?.role || [];

		// 如果用户角色中包含 'admin' 或 'vip-11'，则返回 true
		return roles.includes('admin');
	} catch (e) {
		return false;
	}
};



export const isSuperAdmin = (): boolean => {
	// 判断用户是否为管理员
	try {
		let lifeData = uni.getStorageSync('lifeData');
		let roles = lifeData?.$user?.userInfo?.role || [];

		// 如果用户角色中包含 'admin' 或 'vip-11'，则返回 true
		return roles.includes('admin') || roles.includes('vip-11');
	} catch (e) {
		return false;
	}
};




export const getUserId = () => {
	try {
		const lifeData = uni.getStorageSync('lifeData');
		return lifeData?.$user?.userInfo?._id || '';
	} catch (e) {
		return '';
	}
};

export const getUserRole = () => {
	// 判断用户是否为管理员
	let lifeData = uni.getStorageSync('lifeData').$user.userInfo.role || [];

	// console.log('lifeData', lifeData, lifeData.includes('admin') || lifeData.includes('vip-11'), (lifeData.includes('admin') || lifeData.includes('vip-11')));
	// 如果用户角色中包含 'admin' 或 'vip-11'，则返回 true
	return lifeData;
};






export const getChongEls = (item: string): string => {
	// const ZhichongArray = ["子午", "丑未", "寅申", "卯酉", "辰戌", "巳亥"];
	const DataMap: { [key: string]: string } = {
		"子": '午',
		"丑": '未',
		"寅": '申',
		"卯": '酉',
		"辰": '戌',
		"巳": '亥',
		"午": '子',
		"未": '丑',
		"申": '寅',
		"酉": '卯',
		"戌": '辰',
		"亥": '巳',
	};
	return DataMap[item];
};
export const getJueEls = (item: string): string => {
	// const RelaArray = ["寅酉", "卯申", "子巳", "午亥"];
	const DataMap: { [key: string]: string } = {
		"寅": '酉',
		"酉": '寅',
		"卯": '申',
		"申": '卯',
		"子": '巳',
		"巳": '子',
		"午": '亥',
		"亥": '午',
	};
	return DataMap[item];
};

// const RelaArray = ["甲己合土", "乙庚合金", "丙辛合水", "丁壬合木", "戊癸合火"];
export const getGanHeEls = (item: string): string => {
	// const RelaArray = ["午未", "子丑", "寅亥", "卯戌", "辰酉", '巳申'];
	const DataMap: { [key: string]: string } = {
		"甲": '己',
		"乙": '庚',
		"丙": '辛',
		"丁": '壬',
		"戊": '癸',
		"己": '甲',
		"庚": '乙',
		"辛": '丙',
		"壬": '丁',
		"癸": '戊',
	};
	return DataMap[item];
};

// const RelaArray = ["甲己合土", "乙庚合金", "丙辛合水", "丁壬合木", "戊癸合火"];
// ‌ 甲庚相冲 ‌：甲木（阳木）与庚金（阳金）相冲，表现为阳木与阳金的相互排斥。
// ‌ 丙壬相冲 ‌：丙火（阳火）与壬水（阳水）相冲，表现为阳火与阳水的相互冲击。
// ‌ 丁癸相冲 ‌：丁火（阴火）与癸水（阴水）相冲，表现为阴火与阴水的相互克制。
// ‌ 乙辛相冲 ‌：乙木（阴木）与辛金（阴金）相冲，表现为阴木与阴金的相互克制‌
// // 
export const getGanChongEls = (item: string): string => {
	// const RelaArray = ["午未", "子丑", "寅亥", "卯戌", "辰酉", '巳申'];
	const DataMap: { [key: string]: string } = {
		"甲": '庚',
		"乙": '辛',
		"丙": '壬',
		"丁": '癸',
		"戊": '',
		"己": '',
		"庚": '甲',
		"辛": '乙',
		"壬": '丙',
		"癸": '丁',
	};
	return DataMap[item];
};



// 根据贵人能量数值返回对应的标签
export const getEnergyLabel = (energy: number): string => {
	if (energy <= 0) return '';

	if (energy >= 300) {
		return '极强';
	}
	if (energy >= 250) {
		return '超强';
	}
	if (energy >= 200) {
		return '强烈';
	}
	if (energy >= 150) {
		return '很强';
	}
	if (energy >= 100) {
		return '较强';
	}
	if (energy >= 50) {
		return '一般';
	}
	if (energy > 0) {
		return '较弱';
	}

	return '';
}



// 优化后的能量值分级扁平化色块（低端颜色灰色系）
export const getEnergyColor = (energy: number): string => {
	if (energy >= 300) {
		// 极强 — 深红
		return '#B71C1C';
	} else if (energy >= 250) {
		// 超强 — 红
		return '#D32F2F';
	} else if (energy >= 200) {
		// 强烈 — 橙
		return '#F57C00';
	} else if (energy >= 150) {
		// 很强 — 琥珀
		return '#FBC02D';
	} else if (energy >= 100) {
		// 较强 — 绿色
		return '#388E3C';
	} else if (energy >= 50) {
		// 一般 — 中灰
		return '#757575';
	} else if (energy > 0) {
		// 低能量 — 浅灰
		return '#BDBDBD';
	} else {
		// 无能量 — 灰白
		return '#E0E0E0';
	}
}


export const getLiuHeEls = (item: string): string => {
	// const RelaArray = ["午未", "子丑", "寅亥", "卯戌", "辰酉", '巳申'];
	const DataMap: { [key: string]: string } = {
		"午": '未',
		"子": '丑',
		"寅": '亥',
		"卯": '戌',
		"辰": '酉',
		"未": '午',
		"丑": '子',
		"亥": '寅',
		"戌": '卯',
		"酉": '辰',
		"巳": '申',
		"申": '巳',
	};
	return DataMap[item];
};

//  const RelaArray = ["子未", "丑午", "巳寅", "卯辰", "申亥", "酉戌"];

export const getHaiEls = (item: string): string => {
	// const RelaArray = ["寅酉", "卯申", "子巳", "午亥"];
	const DataMap: { [key: string]: string } = {
		"酉": '戌',
		"寅": '巳',
		"子": '未',
		"丑": '午',
		"卯": '辰',
		"申": '亥',
		"戌": '酉',
		"巳": '寅',
		"未": '子',
		"午": '丑',
		"辰": '卯',
		"亥": '申',
	};
	return DataMap[item];
};

export const getPoEls = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"子": '酉',
		"丑": '辰',
		"寅": '亥',
		"卯": '午',
		"辰": '丑',
		"巳": '申',
		"午": '卯',
		"未": '戌',
		"申": '巳',
		"酉": '子',
		"戌": '未',
		"亥": '寅',
	};
	return DataMap[item];
};

// 寅刑巳 巳刑申 申刑寅 为无恩之刑；

// 未刑丑 丑刑戌 戌刑未 为持势之刑；

// 子刑卯 卯刑子 为无礼之刑；

// 辰刑辰 午刑午 酉刑酉 亥刑亥 为自刑之刑

//得到是我刑 谁的值 ，不是被谁刑 
export const getXingEls = (item: string): string => {
	// const RelaArray = ["寅酉", "卯申", "子巳", "午亥"];
	const DataMap: { [key: string]: string } = {
		"酉": '酉',
		"寅": '巳',
		"子": '卯',
		"丑": '戌',
		"卯": '子',
		"申": '寅',
		"戌": '未',
		"巳": '申',
		"未": '丑',
		"午": '午',
		"辰": '辰',
		"亥": '亥',
	};
	return DataMap[item];
};



//得到克的五行

export const getKeWuxing = (item: string): string => {
	// const RelaArray = ["寅酉", "卯申", "子巳", "午亥"];
	const DataMap: { [key: string]: string } = {
		'金': '木',
		'木': '土',
		'土': '水',
		'水': '火',
		'火': '金'
	};
	return DataMap[item];
};




export const isDiZhiJue = (str1: string, str2: string): boolean => {
	const RelaArray = ["寅酉", "卯申", "子巳", "午亥"];
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

//地支是否相刑 
export const isDiZhiXing = (str1: string, str2: string): boolean => {
	// 丑刑戌、戌刑未、未刑丑，为恃势之刑；
	// 寅刑巳、巳刑申、申刑寅，为无恩之刑；
	// 子刑卯、卯刑子，为无礼之刑；

	const RelaArray = ["辰辰", "午午", "酉酉", "亥亥", "子卯", "丑戌", "戌未", "未丑", "寅巳", "巳申", "申寅"];
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

//地支是否相害
export const isDiZhiHai = (str1: string, str2: string): boolean => {
	// 子未穿、酉戌穿、辰卯穿 、寅巳穿、丑午穿、申亥穿
	const RelaArray = ["子未", "丑午", "寅巳", "卯辰", "申亥", "酉戌"];
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

//地支是否相破 
export const isDiZhiPo = (str1: string, str2: string): boolean => {
	// 子酉相破，午卯相破，辰丑相破，未戌相破，寅亥相破，申巳相破。
	const RelaArray = ["子酉", "卯午", "辰丑", "未戌", "寅亥", "申巳"];
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

export const isDiZhiPoMangPai = (str1: string, str2: string): boolean => {

	// 盲派常用的四破
	const RelaArray = ["子卯", "卯午", "午酉", "子酉"];
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};

// '日贵': ['丁酉', '丁亥', '癸卯', '癸巳'],

export const isRiGui = (str1: string, str2: string): boolean => {
	const RelaArray = ['丁酉', '丁亥', '癸卯', '癸巳'];
	return (RelaArray.includes(str1 + str2) || RelaArray.includes(str2 + str1));
};



// 优化五行关系的判断，使用更清晰的函数名和逻辑
export const isXiangKeByWuxing = (wuXing1: string, wuXing2: string): boolean => {
	const relation = getWuXingRelation(wuXing1, wuXing2);
	return relation === '克' || relation === '反克';
};


// 是不是天克地冲   输入参数 str1:干支  str1:干支2

export const getTianKeDiChong = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	let tiangankeFlag = isXiangKeByWuxing(getWuXing(ganzhi1[0]), getWuXing(ganzhi2[0])) || false;

	// 优化地支相冲的判断，提取为单独的函数以提高可读性
	const dizhiChongFlag = isDiZhiChong(ganzhi1[1], ganzhi2[1]);

	if (tiangankeFlag && dizhiChongFlag) {
		refitem = true;
	}

	return refitem;
}

// 天比地冲天同地冲
export const getTianTongDiChong = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;

	let tiangankeFlag = (ganzhi1[0] === ganzhi2[0]);

	// 优化地支相冲的判断，提取为单独的函数以提高可读性
	const dizhiChongFlag = isDiZhiChong(ganzhi1[1], ganzhi2[1]);

	if (tiangankeFlag && dizhiChongFlag) {
		refitem = true;
	}

	return refitem;
}


// 天干地支都相同 

export const getTianTongDiTong = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	// let tiangankeFlag = isXiangKeByWuxing(getWuXing(ganzhi1[0]), getWuXing(ganzhi2[0])) || false;
	let tiangankeFlag = (ganzhi1[0] === ganzhi2[0]);

	// 优化地支相冲的判断，提取为单独的函数以提高可读性
	const dizhiChongFlag = (ganzhi1[1] === ganzhi2[1])

	if (tiangankeFlag && dizhiChongFlag) {
		refitem = true;
	}

	return refitem;
}

// 
// 是不是天合地破   输入参数 str1:干支  str1:干支2

export const getTianheDipo = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const tianganheFlag = isTianGanHe(ganzhi1[0], ganzhi2[0]);

	// 优化地支相破的判断，提取为单独的函数以提高可读性
	//  const dizhiPoFlag = isDiZhiPoMangPai(ganzhi1[1], ganzhi2[1]); //isDiZhiPo
	const dizhiPoFlag = isDiZhiPo(ganzhi1[1], ganzhi2[1]); //isDiZhiPo

	if (tianganheFlag && dizhiPoFlag) {
		refitem = true;
	}

	return refitem;
}

//
// 是不是天合地破   输入参数 str1:干支  str1:干支2

export const getTianheDiHai = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const tianganheFlag = isTianGanHe(ganzhi1[0], ganzhi2[0]);

	// 优化地支相皮的判断，提取为单独的函数以提高可读性
	const dizhiPoFlag = isDiZhiHai(ganzhi1[1], ganzhi2[1]);

	if (tianganheFlag && dizhiPoFlag) {
		refitem = true;
	}

	return refitem;
}

// 是不是天合地破   输入参数 str1:干支  str1:干支2

export const getTianheDiJue = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const tianganheFlag = isTianGanHe(ganzhi1[0], ganzhi2[0]);

	// 优化地支相皮的判断，提取为单独的函数以提高可读性
	const dizhiPoFlag = isDiZhiJue(ganzhi1[1], ganzhi2[1]);

	if (tianganheFlag && dizhiPoFlag) {
		refitem = true;
	}

	return refitem;
}


export const getTianheDiXing = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const tianganheFlag = isTianGanHe(ganzhi1[0], ganzhi2[0]);

	// 优化地支相皮的判断，提取为单独的函数以提高可读性
	const dizhiPoFlag = isDiZhiXing(ganzhi1[1], ganzhi2[1]);

	if (tianganheFlag && dizhiPoFlag) {
		refitem = true;
	}

	return refitem;
}


export const getTianheDiChong = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const tianganheFlag = isTianGanHe(ganzhi1[0], ganzhi2[0]);

	// 优化地支相皮的判断，提取为单独的函数以提高可读性
	const dizhiPoFlag = isDiZhiChong(ganzhi1[1], ganzhi2[1]);

	if (tianganheFlag && dizhiPoFlag) {
		refitem = true;
	}

	return refitem;
}

// 是否天干地合

export const getTianheDihe = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const tianganheFlag = isTianGanHe(ganzhi1[0], ganzhi2[0]);

	// 优化地支相皮的判断，提取为单独的函数以提高可读性
	const dizhiPoFlag = isDiZhiLiuHe(ganzhi1[1], ganzhi2[1]);

	if (tianganheFlag && dizhiPoFlag) {
		refitem = true;
	}

	return refitem;
}


//  判断地支是不是相冲  
export const getDiZhiChong = (ganzhi1: string, ganzhi2: string): boolean => {

	let refitem = false;
	const ZhichongArray = ["子午", "丑未", "寅申", "卯酉", "辰戌", "巳亥"];

	// 优化地支相冲的判断，提取为单独的函数以提高可读性
	const isDiZhiChong = (zhi1: string, zhi2: string): boolean => {
		return (ZhichongArray.includes(zhi1 + zhi2) || ZhichongArray.includes(zhi2 + zhi1));
	};

	const dizhiChongFlag = isDiZhiChong(ganzhi1[ganzhi1.length - 1], ganzhi2[ganzhi2.length - 1]);

	if (dizhiChongFlag) {
		refitem = true;
	}

	return refitem;
}


// 根据阴历月份得到阳历的起止日期 

export const getSolarMonthDate = (year: number, lunarMonth: number) => {

	// 初始化一个阴历对象
	const LuncarMonth = LunarMonth.fromYm(year, lunarMonth);

	let dayNum = 30;

	if (LuncarMonth) {
		dayNum = LuncarMonth.getDayCount()
	}

	const lunarLastDay = Lunar.fromYmd(year, lunarMonth, dayNum)
	const lunarStarDay = Lunar.fromYmd(year, lunarMonth, 1)

	return {
		start: lunarStarDay.getSolar(),
		end: lunarLastDay.getSolar(),
	};
}


//根据五行多注意平时的颜色用品什么的 

export const getNoticeWuXing = (item: string[]) => {
	const merged: string[] = [];
	const list: { [key: string]: string[] } = {
		木: ['绿色、青色、墨绿、翠色,', '东方', '水果，素食，茶等，', '木串，菩提，紫檀，沉香质手链、挂饰、如紫檀或者是绿檀的手链，桃木手珠等，', '梅兰竹菊画、萧、竹笛、兔公仔、猫公仔', '不要纹身,不要脱体毛,少或不配带金属饰品，房间不要金色系等'],
		火: ['红色、粉红色、紫色,', '南方', '火锅、烧烤、喝红酒、血制品、番茄、红豆、红枣等，', '红色系手链、挂饰，如玛瑙、红宝石、鸡血石等，', '红花瓶、红靠垫、红地毯、长明灯，八骏图，中国结，紫水晶或红玛瑙', '不要让环境潮湿,不穿黑白相配的衣服，房间不要水色系等。'],
		土: ['土色、黄色、咖啡色', '中部', '埋在土中之根茎类食品,如荸荠，胡萝卜等，', '土手链、挂饰、如玉、石、黄水晶、翡翠、珊瑚、贝壳及陶瓷类饰品等，', '玉貔貅、石雕大象、山景画、奇石', '不要摆太多书，尽量少或不用原木家具、少或不养绿植，房间不要绿色系等'],
		金: ['白色、银色、金色', '西方', '蛋白、莲子、银耳、百合、萝卜及冷冻食品，', '金银戒指、手链、耳环、黄金、铂金等金属饰物', '貔貅，金色花瓶，金属雕塑，金质家具，', '不要留长甲、长发,尽量少或不穿戴红色衣服和包，房间不要红色系等'],
		水: ['蓝色，灰色、黑色', '北方', '多喝水、喝果汁、吃补水(补肾)的物品', '佩戴玉佩,水晶，像海蓝宝、黑发晶手链,戴珍珠耳环或珍珠项链,', '卧室一般不要有小夜灯，尽量少或不穿土色衣服和包，不摆奇石，房间不要土色系等'],
	}

	// 遍历keys数组中的每个元素
	item.forEach(key => {
		// 获取当前元素对应的数组
		const currentArray = list[key];

		// 遍历当前数组的每个元素
		currentArray.forEach((item, index) => {
			// 如果merged的第index位置还没有元素，则添加一个空数组
			if (!merged[index]) {
				merged[index] = '';
			}
			// 将当前元素添加到merged的对应位置
			// merged.push(merged[index] + item[index]);
			merged[index] = merged[index] + (merged[index] ? '  ' : '') + item
		}
		);
	})

	return merged
}



//根据五行得到得墓库地支 

export const getMuKuByWuXing = (item: string | string[]) => {

	let refitem: string = '';
	const list: { [key: string]: string } = {
		木: '未',
		火: '戌',
		土: '戌',
		金: '丑',
		水: '辰',
	}

	if (Array.isArray(item)) {
		item.forEach(i => refitem += list[i] + ',')
	}
	else {
		refitem = list[item]
	}

	return refitem
}



// 判断贵人影响的位置 


export const getGeJuTeDian = (str: string) => {
	// 财星五行的特点
	let char: string = '';
	switch (str) {
		case '偏财格':
			char = '整天想着做生意赚钱，干大事、吃饭抢着付钱，豪爽大方，大侠性格，喜欢交朋友，喜欢请客吃饭，异生接触多，收入会不稳定，一心多用可以同时做几个事情。';
			break;
		case '正财格':
			char = '不愿冒险，追求稳定，勤俭节约，诚实可靠，脚踏实地，重视家庭，爱配偶';
			break;
		case '食神格':
			char = '会吃会玩，懂的享受生活，心胸宽广不会发愁，不喜与人争，口才好，工作几年后会出口成章，有时会懒散，有拖延症';
			break;
		case '伤官格':
			char = '会吃会玩，懂的享受生活，上进心强，喜欢给领导有不同意见，口舌纷争比较多，个性独立，不喜欢被拘束，容易抬杠，恩怨分明，聪明伶俐，不怎么会道歉';
			break;
		case '正印格':
			char = '热爱学习，心地善良，重情重义，有艺术细胞，喜欢琴棋书画，没有大灾大难，一生多贵人相助';
			break;
		case '偏印格':
			char = '心细如发，内心对社交比较冷淡，容易沉浸在自己的精神世界里，能看到别人看不到的细节，第六感强，敏感，有专业和艺术天赋。不太容易信任别人，适合做军师，参谋，脑子不停地思考';
			break;
		case '正官格':
			char = '一身正气，光明磊落，容易当领导，老大，领袖，追求尊重，名声地位，对自己严格要求，交朋友做减法，有恶习之人不交往。厚道，认真、古板、较真，过于严肃,强迫症，爱操心，劳累';
			break;
		case '七杀格':
			char = '病神，心狠手辣，胆子大，追求尊重，名声地位，做事力道狠，冲劲大，聪明伶俐，执行力强，嫉恶如仇，性格火爆，翻脸如翻书。';
			break;
		case '比肩格':
			char = '比肩格，立场多变、粗心缺乏持久力。平时是不怎么会道歉，死不认错要面子，能迅速和朋友打成一片。';
			break;
		case '劫财格':
			char = '情商高，朋友多，见面熟，在合适的场合下会懂得见人说人话，多会被朋友借钱或被借，被朋友占便宜或占朋友便宜。';
			break;
	}
	return char;
}

//通过十神得到十神代表的意向 

export const getYiXiangByShiShen = (item: string) => {
	const list = {
		正官: "领导或上级;",
		七杀: "领导或上级;",
		食神: '学生徒弟或后辈;',
		伤官: '学生徒弟或后辈;',
		比肩: '朋友同学同事或合伙人;',
		劫财: '朋友同学同事或合伙人;',
		正财: '父亲或负责财务的人;',
		偏财: '父亲或负责财务的人;',
		正印: '母亲老师或客户;',
		偏印: '母亲老师或客户;',
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};


// 得到十神过旺代表的事情 

export const getthingByShiShen = (item: string) => {
	// 【女的不好，男的不好，女的好，男的好】
	const list = {
		正官: ["感情与配偶不合或有惹官非诉讼、慢性病、失业失权等事;", "有惹官非诉讼、慢性病、失业失权等事;", "对象或结婚或工作晋升、获名得权得助等事;", "工作晋升、获名得权得助等事;"],
		七杀: ["身体有伤病,犯小人惹官非,失业离婚等; ", "身体有伤病,犯小人惹官非等;。", "对象或结婚或工作晋升、获名得权得助等事;", "工作晋升、获名得权得助等事;"],
		食神: ["心情不爽，收入受影响、怀孕或流产;", "心情不爽，收入受影响;", "技术精进、收入增加、想法增多,会有孩子等 ", `技术精进、收入增加、想法增多等;`],
		伤官: ["心情不爽，与领导或长辈争执，收入受影响、怀孕或流产;", "心情不爽，与领导或长辈争执，收入受影响;", "技术精进、收入增加、想法增多,会有孩子等 ", `技术精进、收入增加、想法增多等;`],
		比肩: ["与朋友兄弟闹掰或有钱财亏损", "与朋友兄弟闹掰或有钱财亏损;", "得朋友兄弟帮助，人脉增加。", "得朋友兄弟帮助，人脉增加。"],
		劫财: ["与朋友兄弟闹掰或有钱财亏损", "与朋友兄弟闹掰或有钱财亏损;", "得朋友兄弟帮助，人脉增加。", "得朋友兄弟帮助，人脉增加。"],
		正财: ["工作和收入受影响、生病、固定资产减少等破财事宜", "会破财，工作和收入受影响、生病、固定资产减少、离婚分手等", , "收入提高、购置资产、事业提升;", "收入提高、购置资产、事业提升，有女友或结婚;"],
		偏财: ["工作和收入受影响、生病、固定资产减少等破财事宜", "会破财，工作和收入受影响、生病、固定资产减少、离婚分手等", , "收入提高、购置资产、事业提升;", "收入提高、购置资产、事业提升，有女友或结婚;"],
		正印: ["取证不利，业绩不好,无贵人帮助; ", "取证不利，业绩不好;无贵人帮助", "有贵人帮，得到更好职位荣誉，购买资产。", "有贵人帮，得到更好职位荣誉，购买资产。"],
		偏印: ["取证不利，业绩不好,无贵人帮助; ", "取证不利，业绩不好;无贵人帮助", "有贵人帮，得到更好职位荣誉，购买资产。", "有贵人帮，得到更好职位荣誉，购买资产。"],
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};




// 根据十神得到六亲

export const getLiuQinByShiShen = (item: string) => {

	// 【女的，男的】
	const list = {
		正官: ["老公", "孩子尤其是女儿"],
		七杀: ["配偶", "孩子尤其是儿子"],
		食神: ["祖辈或孩子尤其是儿子", "祖辈或孙子"],
		伤官: ["祖辈或孩子尤其是女儿", "祖辈或孙子"],
		比肩: ["兄弟姐妹", "兄弟姐妹"],
		劫财: ["姐妹兄弟", "姐妹兄弟"],
		正财: ["父亲", "老婆"],
		偏财: ["父亲", "情人或女友"],
		正印: ["母亲", "母亲"],
		偏印: ["母亲", "母亲"],
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};




//通过十神得到十神代表的事件的事意向 type:'dayun','liunian','liuyue'
//比如三合局合出来了食神【0】 代表工作内容， 食神【1】代表吉，代表会有新的工作机会。  食神【2】代表不吉：代表食神给自己造成了失业裁员。  

export const getThingByShiShen = (item: string, type: string) => {
	let value: string[] = [];


	//  0 代表 意思  1 代表 为喜神时特点  2 为忌神的特点
	const dayunlist = {
		正官: ["官位权力、工作晋升，女性还会结婚或遇到男友。", "考运好，升官升学、获得名声、地位、权力、竞争得利、事业进步; 结婚或找到对象[女];", "会有病痛，慢性病或小人困扰,考运不好、心情苦闷、压抑、破财、伤病灾、有诉讼、失权、失业、离婚或分手[女]等事。"],
		七杀: ["官位权力、工作晋升，女性还会结婚或遇到男友。", "考运好，升官升学、获得名声、地位、权力、竞争得利、事业进步; 结婚或找到对象[女];", "会有病痛，考运不好、慢性病或小人困扰,心情苦闷、压抑、破财、伤病灾、有诉讼、失权、失业、离婚或分手[女]等事。"],
		食神: ["才艺文学、技术学习、吃喝玩乐、赚钱投资、性欲等 ", "财源增多、运动增多、想玩、旅游等出门机会增多或怀胎生育[女]", "会有上下级矛盾、官非诉讼、劳神而损身心伤、病灾、失业丢官、孩子生病意外[女]等。"],
		伤官: ["才艺文学、技术学习、吃喝玩乐、赚钱投资、性欲等 ", "财源增多、运动增多、想玩、旅游等出门机会增多或怀胎生育[女]", "会有上下级矛盾、官非诉讼、劳神而损身心伤、病灾、失业丢官、孩子生病意外[女]等。"],
		比肩: ["合伙做事、交朋友、人脉等。", "得到兄弟姐妹、朋友助益，竞争得利、付出有成果;或有健身，减增肥之事", "钱财被侵吞、投资亏损破财、朋友闹掰;或有分家、被偷抢、丢职、诉讼牢狱、病灾、妻夫父不顺、受穷之事、妻子损伤[男]。"],
		劫财: ["合伙做事、交朋友、人脉等。", "得到兄弟姐妹、朋友助益，竞争得利、付出有成果;或有健身，减增肥之事", "钱财被侵吞、投资亏损破财、朋友闹掰;或有分家、被偷抢、丢职、诉讼牢狱、病灾、妻夫父不顺、受穷之事、妻子损伤[男]。"],
		正财: ["购置资产、买卖、金钱、父亲、婚姻、妻子或女友[男]等。", "事业顺利、进财多、自力发展好、得名得利、物欲心理增强、购置固定资产、工作事业又上一个台阶、身体更健康、学习开始倦怠;或结婚或有女友[男], ", "会心情差、失眠、体力消退、收入减少、丢官、降职失业、生病、固定资产减少、离婚分手[男]、长辈亲人烦忧伤病等"],
		偏财: ["购置资产、买卖、金钱、父亲、婚姻、妻子或女友[男]等。", "有偏财进账、事业才艺显露、人缘助力增多;有配偶外的其它女人[男]。", "会事业破败、身体不好、丢官、降职失业、生病、固定资产减少、感情风波、婚姻不顺、离婚分手[男]等"],
		正印: ["母亲、老师、学习、证书荣誉、信仰追求、财产购置", "生活较安定、购置资产、且有空进修、学习、贵人多助、长辈关怀。", "无运动机会、气色差、抵抗力弱、思考迟钝、上当损财。"],
		偏印: ["母亲、老师、学习、证书荣誉、信仰追求、财产购置", "生活较安定、购置资产、且有空进修、学习、贵人多助、长辈关怀，自我提升、工作变好、文上有喜。", "无运动机会、气色差、抵抗力弱、思考迟钝、上当损财,疾病、破财、工作不顺、心情压抑。"],
	}

	const liunianlist = {
		正官: ["学位、官位权力、子女,女性则与其丈夫或男友", "工作，学习，子女等方面有吉的变动。如升官、获得名声、地位、权力，女生可以结婚或找到对象;", "有诉讼是非、病痛或慢性病、小人困扰、失业、离婚或分手[女]等事。"],
		七杀: ["工作学习、购置财产、和生活的压力、犯小人、身体伤病。", "工作，感情子女等方面有吉的变动。如升官、获得名声、地位、权力，女生可以结婚或找到对象;", "有诉讼是非、病痛或慢性病、小人困扰、失业、离婚或分手[女]等事。"],
		食神: ["技术、放松爱好、赚钱想法、性欲子女等 ", `思维活跃,赚钱点子增多，外出兴趣爱好的行为也变多, 女的话可能考虑要孩子;`, "会心情不爽，玩的心思减少，可能会有失业、祖母或晚辈生病或去世的事，女的怀孕可能会流产。"],
		伤官: ["技术、放松爱好、赚钱想法、性欲子女等 ", `思维活跃,赚钱点子增多，外出兴趣爱好的行为也变多, 女的话可能考虑要孩子;`, "会心情不爽，玩的心思减少，可能会有失业、祖母或晚辈生病或去世的事，女的怀孕可能会流产。"],
		比肩: ["朋友同事同学交际，人脉增多", "得到兄妹朋友的帮助，;", "钱财被侵吞、投资亏损、朋友闹掰、妻子和父亲不顺之事。"],
		劫财: ["朋友同事同学交际，人脉增多", "得到兄妹朋友的帮助，", "钱财被侵吞、投资亏损、朋友闹掰、妻子和父亲不顺之事。"],
		正财: ["收入赚钱或购买财产、忙生意、父亲、女的会有配偶的事情", "收入提高，物欲心理增强、购置固定资产、工作事业提升、学习开始倦怠、男生有女友或结婚, ", "会损财，收入减少,丢官、降职失业、生病、固定资产减少、离婚分手[男]等"],
		偏财: ["收入赚钱或购买财产、忙生意、父亲、女的会有配偶的事情", "有偏财进账、收入提高、事业才艺显露、人缘助力增多，物欲心理增强、购置固定资产、工作事业提升、学习开始倦怠、有配偶外的其它女人[男]。", "会损财，收入减少,丢官、降职失业、生病、固定资产减少、离婚分手[男]等"],
		正印: ["学习、增加职称荣誉、客户或和母亲的事", "出现帮助自己的贵人,做事有助,尤其是在获得工作荣誉或资产方面。", "考试晋升荣誉个人项目进度缓慢成果甚微,长辈的压力变大。"],
		偏印: ["学习、增加职称荣誉、客户或和母亲的事", "出现帮助自己的贵人,做事有助,尤其是在获得工作荣誉或资产方面。", "考试晋升荣誉个人项目进度缓慢成果甚微,长辈的压力变大。"],
	}


	const liuyuelist = {
		正官: ["工作，配偶，若有孩子则忙孩子。", "工作和岗位权力竞争等收获;女的则可能会遇到发展对象;", "身体或会有病症、工作生活中小人困扰、失业、感情不稳，有工作则会阻力增大、丢职、收入降低等事。"],
		七杀: ["工作，女的有配偶，若有孩子则忙孩子的事情。", "工作和岗位权力竞争等收获;女的则可能会遇到发展对象;", "身体或会有病症、工作生活中小人困扰、失业、感情不稳，有工作则会阻力增大、丢职、收入降低等事。"],
		食神: ["学习动力和想法增多，会自己的爱好实施计划、出行、吃喝、游玩。 ", "有了新的工作环境或经济来源、才华方面有所施展、身体健康也提升、爱吃爱玩爱学习新东西、购物和支出明显增加,出门机会(旅游出差)增多;", "会有考运不佳、休学、丢官、降职失业;或发生遭口舌诽谤、伤病、收入减少、离婚[女]、流产[女]、祖母或晚辈生病或去世的事。"],
		伤官: ["学习动力和想法增多，会自己的爱好实施计划、出行、吃喝、游玩。 ", "有了新的工作或经济来源、才华方面有所施展、身体健康也提升、爱吃爱玩爱学习新东西、购物和支出明显增加,出门机会(旅游出差)增多;", "会有考运不佳、休学、丢官、降职失业;或发生遭口舌诽谤、伤病、收入减少、离婚[女]、流产[女]、祖母或晚辈生病或去世的事。"],
		比肩: ["同事同学朋友等有关。", "得到兄弟姐妹、朋友助益，竞争得利、付出有成果;或有健身，减增肥之事", "钱财被侵吞、投资亏损破财、朋友闹掰;或有分家、被偷抢、丢职、诉讼牢狱、病灾、妻夫父不顺、受穷之事。"],
		劫财: ["同事同学朋友等有关。", "得到兄弟姐妹、朋友助益，竞争得利、付出有成果;或有健身，减增肥之事", "钱财被侵吞、投资亏损破财、朋友闹掰;或有分家、被偷抢、丢职、诉讼牢狱、病灾、妻夫父不顺、受穷之事。"],
		正财: ["收入、买卖、或父亲、婚姻[男]等有关。", "物欲心理增强、购置固定资产、工作事业又上一个台阶、身体更健康、学习开始倦怠;或结婚或有女友[男], ", "会收入减少,丢官、降职失业、生病、固定资产减少、离婚分手[男]等"],
		偏财: ["收入、买卖、或父亲、婚姻[男]等有关。", "有偏财进账、事业才艺显露、人缘助力增多;有配偶外的其它女人[男]。", "会收入减少,丢官、降职失业、生病、固定资产减少、离婚分手[男]等"],
		正印: ["学习、证书职称、客户和订单，或与母亲、长辈有关。", "得到毕业证或荣誉证书,工作上有靠山,生活中出现贵人，购置房产或车;", "休学、失业、损名、贫穷、懒惰、疾病"],
		偏印: ["学习、证书职称、客户和订单，或与母亲、长辈有关。", "在偏业、学术、荣誉、地位获得成果,或购(得)车房资产。", "受困病灾、不雅疤痕、破财、休学、失业，女儿受伤等"],
	}

	const liuyuechgList = {
		官杀: ["主要是工作，官职权力子女有关。", "有工作或权力得以施展或上升顺利，官杀月易有购置资产的行为、女的容易碰到发展对象或与对象向好发展。", "工作有处于失业或者降薪降权丢官的状态，身体或会出现病痛。"],
		食伤: ["学习和创新思维增多", "有新赚钱的方式或想法明显变多、在坚持做的事情有了一点成果。", "一般是考运不佳、学习不进去，或降职失业收入减少、或有口舌、伤病、严重则会流产[女]、子女或祖母生病等。"],
		比劫: ["和同事、朋友在一起时间变多。", "得到了朋友的帮助，或有钱进账。", "与朋友关系明显变化,与友闹掰或因友破财的事，因与友关系而增加支出。"],
		财才: ["财产因定资产，男的则和配偶有关。", "工作方面会有所提升或有财进账，男的这个月则容易有异性缘。 ", "会有破财或超出平时的花费支出，或工作会出现变动调动、破财、男的已婚则可能会感情不稳。"],
		印枭: ["母亲、学习证书荣誉、财产、贵人", "学习和工作的事情会有成果出现、个人或会有钱进账或购置固定资产。", "出现妈妈不顺或学习晋升不顺或名声受损方面的事情。"],
	}

	// 当八字缺少这个十神的时候代表的特点 [0  无的时候特点  1 为旺的时候的特点]
	const zeroInfolist = {
		官杀: ["缺乏权威与威信,不愿受约束管理,缺乏纪律性,难以管束他人。处事优柔寡断,对子女缘份薄,无法约束管教子女。", "性格软弱,不喜欢被管束,不敢担当,缺乏进取心。感情与婚姻多波折,难以持久。"],
		食伤: ["食欲不振,体型偏瘦。缺乏想象力和创造力,表达沟通能力差。不爱社交,不善言谈。工作循规蹈矩,不愿创新。", "思维保守,表达含蓄,不善言谈。工作中偏好专一技术,不喜欢交际应酬。"],
		比劫: ["独来独往,与人难以合作,人际关系淡薄,朋友少。事事依靠自己,不愿与人分享。工作喜欢独立作战,适合技术研发。", "性格孤僻,不善交际,缺少朋友。处事固执,不愿妥协让步。工作专注技术,缺乏团队合作。"],
		财才: ["生性淡泊,不重物质。理财意识差,钱财难聚。童年与父母缘薄,亲情感淡薄。感情难以专一,婚姻易有波折。", "不注重生活品质,理财能力差。童年父母缘分薄,亲情淡漠。工作追求稳定,缺乏冒险精神。"],
		印枭: ["生病忌医,抗拒服药。学习力差,记忆力不佳。早年与长辈母亲缘分薄,生活缺乏照顾。理论知识欠佳,实践能力强。", "生病怕医怕药,记忆力差。童年缺少母爱关怀,生活独立。学习偏重实践,理论基础薄弱。"],
	};


	switch (type) {
		case 'dayun':
			if (dayunlist[item]) {
				value = dayunlist[item]
			}
			break;
		case 'liunian':
			if (liunianlist[item]) {
				value = liunianlist[item]
			}
			break;
		case 'liuyue':
			if (liuyuelist[item]) {
				value = liuyuelist[item]
			}
			break;
		case 'liuyuechg':
			if (liuyuechgList[item]) {
				value = liuyuechgList[item]
			}
			break;
		case 'zero':
			if (zeroInfolist[item]) {
				value = zeroInfolist[item]
			}
			break;
	}

	return value

};

// 一、日干诀断
// 1.甲木：
// 人逢甲木有疤痕，不在脸上发中藏。
// 2.乙木：
// 人逢乙木筋骨疼，易被棍棒碰损伤。
// 3.丙火：
// 人逢丙日婚不顺，痣痦定然在身上。
// 4.丁火：
// 人逢丁火有伤残，女人剖产取儿郎。
// 5.戊土：
// 胎印定在前腹部，他柱临之细审详。
// 6.己土：
// 人逢己土有痣痦，脾胃不佳欠营养。
// 7.庚金：
// 易犯气管肺部病，小心骨折易损伤。
// 8.辛金：
// 筋骨疼痛口腔病，时刻小心金属伤。
// 9.壬水：
// 易得肾病腰腿疼，问医求诊记心上。
// 10.癸水：
// 肾脏肛门易得病，女人妇科病应防。


// 根据日主直接断性格 
export const getDetailByDayGan = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"甲": '平时头容易受伤,脸上有伤疤，不在脸上就在头发里面。 \n 天生有组织领导能力，能得到众人信任，有带头大哥的气场。 \n 做事喜明争不喜暗斗，对赚钱是能挣能花少计较。',
		"乙": '容易有筋骨疼，平时易被棍棒桌台等硬物淤肿受伤。\n 花钱是精打细算，感情脆弱。 \n 谋略高，善参谋，做事不喜抛头露面，天生幕后人。\n 喜暗斗，不喜明取，对成功可用一千种方法达到目的人。',
		"丙": '在身上长有明显的痣痦; \n 急躁易冲动，做事喜欢短平快一次做完，需要长期做完的就容易缺毅力和耐力做完。\n 会因为善良不计较不懂拒绝帮人自己吃大亏。\n 演讲和描述能力很强。',
		"丁": '身体有明显的伤; \n 天生心细有第六感，看人准，端庄温和，性格外柔内刚，不冲动。 \n 特别害怕失败，有压力的事前表现应激反应特别大。 \n  特会相处的暖人，特别会带孩子。',
		"戊": '在前腹部有一个明显的胎记；\n 外貌人畜无害，其实心计多，会耍小聪明会算计;\n 善交朋友,但朋友多不久长; \n 工作中会认为他人总没自己做的好,是一个可以出精品的人; \n 喜欢旧事物，不喜欢搬迁，固执，感情用事。',
		"己": '身上有明显的痣痦，黑色的；\n 天生心细, 做事规律，脾胃不佳。 \n 缺乏安全感，猜疑心强，会做老好人; \n 最好的执行者和配合者，会努力表现好，可塑性强为善打天下之人。',
		"庚": '肺或气管易有毛病、也容易有骨折损伤，\n 天生讲义气敢抱不平， 不喜欢拐弯抹角，好权势，不怕斗争。\n 注重物质享受，多拜金，有经济手腕; ',
		"辛": '常有筋骨疼痛,口腔毛病，也常莫名被金属伤到，\n 口才和文笔不错，不虚荣; \n 喜欢论对错，略有神经敏感，睡眠质量常有欠佳; \n 能排除万难完成事，易成大业，命两极化不是大好就是大差。',
		"壬": '身体容易有肾病，腰腿疼，  \n 聪明性急暴，会团结人，聪明会读书，才智高，才艺多，反应快; \n 善算计，遇到危险即闪开，能见风转舵; \n 喜欢赚钱管钱，不相信别人，个性散漫。',
		"癸": '四肢易受伤，易有痔疮，平衡感不太好，\n 正直又廉洁，能屈能伸能巧于临机应变; \n 爱干净有洁癖，感情脆弱;  \n 会一直有想做生意的想法，能吃苦，有财运，不信别人。',
	};
	return DataMap[item];
}

export const getDetailByDayGanSimple = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"甲": '头面必有疤痕，不在脸上发中藏；脊椎或筋骨易有旧疾，为人直爽，宁折不弯。',
		"乙": '身段柔韧，常莫名被木器/桌角碰伤淤肿；肝火旺，手脚易凉，易有风湿之痛。',
		"丙": '肩膀、后背或脖子必有显眼的痣或胎记；性急如火，心血管易早衰，易突发过敏。',
		"丁": '身上必有烫伤疤或利器扎伤的永久痕迹；心脏血液或视力先天稍弱，第六感极强。',
		"戊": '腹部、肚脐周围必有明显的胎记或大痣；脾胃运化慢，皮肤偏糙，性格固执守诺。',
		"己": '身上常有明显的黑色颗粒痣；脾胃寒凉，腹部易积气，心思细腻重感情。',
		"庚": '一生必有一次大的金骨之伤（骨折或手术）；肺或气管弱，性格刚毅孤独。',
		"辛": '口齿牙龈易发炎，四肢关节常酸痛；常被小刀针尖划伤，皮肤白但毛孔偏粗。',
		"壬": '腰腿易疼，肾脏泌尿有虚火；身上有暗疾，极度聪明但也极度多疑。',
		"癸": '平衡感差，足部易损，易患痔疮；情感丰富，外表随和，内心深藏不露。',
	};
	return DataMap[item];
}

// sex 1 男 0 女
export const getThingByZeroByWuxing = (item: string, sex?: number): string => {
	const baseMap: { [key: string]: string } = {
		"官杀": "常感职场受限，喜自由不愿受管；生性散漫，INDEX_INSERT_HERE。",
		"食伤": "多沉默寡言，不善交际；情绪易内敛，需防积郁。",
		"比劫": "生性孤僻，独来独往；同辈缘浅，乏人助力，常孤军奋战。",
		"财才": "与父缘薄，少得荫庇；不重金钱，INDEX_INSERT_HERE不爱理财。",
		"印枭": "母缘浅薄，少得呵护；乏人提携，居无定所，需自力更生。"
	};

	let content = baseMap[item] || "";

	if (item === "官杀") {
		if (sex === 0) content = content.replace("INDEX_INSERT_HERE", "夫缘淡薄，");
		else if (sex === 1) content = content.replace("INDEX_INSERT_HERE", "子嗣缘浅，");
		else content = content.replace("INDEX_INSERT_HERE", "夫缘/子缘淡薄，");
	} else if (item === "财才") {
		if (sex === 1) content = content.replace("INDEX_INSERT_HERE", "妻缘亦浅，");
		else if (sex === 0) content = content.replace("INDEX_INSERT_HERE", ""); // 女命不提
		else content = content.replace("INDEX_INSERT_HERE", "妻缘亦浅，"); // 默认保留
	}

	return content;
}

// export const dizhiList: string[] = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const getDetailByMingGong = (item: string): string[] => {
	const DataMap: { [key: string]: string[] } = {
		"子": [`子宫天贵志不凡，志向清高在命间。\n得志国家能重用，失时贵人到近前。\n平生面慈心又软，老来定然有佛缘。`, `志向高远,中年有财来自四方，老来运势吉祥有福。念旧情深，灵活聪明过人，不记宿怨，但发言过激之时，事务判断,独持异议,主观未免过强。宜从事农业、矿产、地质、铁路、工程、建筑等学科方面的工作，有望功成名就。易有心脏或患血液循环之病等症状发生`],
		"丑": [`丑宫天厄谋事迟，劳碌生涯不得时。\n疾病绵绵难延寿，自力更生可维持。\n初年中年一个样，晚景福禄定出奇`, `身带暗疾方延寿，做事迟疑多困惑.先难得吉,离祖劳心,晚年吉;志向蓬勃,极喜立功,不计本身利益,易教训之态度对人,而不容反对，此举锋芒过露,易遭受怨咎构陷;易患风湿,膝部痿弱,流行软脚病,及皮肤湿疹诸症;`],
		"寅": [`寅宫天权最聪明，能文能武近人情。\n初年就有名望在，事业蓬勃大亨通。\n领导群众都敬仰，能为朋友把命扔。`, `聪明智巧成大器，操权弄柄有人从.兼以性情活泼,人缘极佳,老谋归隐,也将无法摆脱; 易有下肢及臀部,如癌瘤痈疽,痰水结聚,崇湿积痈及血液不清等症.`],
		"卯": [`卯宫天赦最直率，为人仗义又慷慨。\n处事生来就抗上，虚伪之人合不来。\n好打人间不平事，常为别人耗钱财`, `慷慨疏财, 祖业财薄，少时体质较弱,壮年可转强健,神经敏锐,易动怒争端,成年后严谨,克已自律,能作深度之透视; 易见肝肺,阴部，肾石,痔疮,脱肛,血毒等症.`],
		"辰": [`辰宫天罡智谋多，处起事来好反复。\n生来能言又善辨，主人婚姻有波折。\n为人平生好多事，奸诈多端好机谋。`, `伶俐智巧口若河,机谋奸诈多能,对友热忱过度,无暇自顾, 反而惹起是非纠缠; 易脊背软弱,及患脾肾两亏等症.`],
		"巳": [`已宫天文命最佳，勤学苦练可发达。\n女人能把贵夫配，男命贤妻主荣华。\n初年不如中年好，晚景福禄更胜他。`, `文章显达利功名,心细于发,手段精明,如经商能前途无量,喜吹毛求疵,多惧与接近,生活孤寂; 易有微脑病,肠胃,便秘, 泄泻,痢疾等症.`],
		"午": [`午宫天喜命最强，荣华富贵保安康。\n遇上大事能化小，若逢小事如平常。\n生来心慈面又软，平平安安过时光。`, `高贵有野心,傲气很盛,为出人头地,又不愿小屈以求大伸,平时待人和蔼可亲,也无非笼络手段,取悦他人,便利其本身之发展;易有脊骨疼痛,风湿,黄疽等症.`],
		"未": [`未宫天秘防不安，劳心费力在命间。\n需离祖业家方起，自力更生创家园。\n生来心胸就不大，总是人闲心不闲。`, `东奔西走不清静.一生劳碌离祖安.性格敏感易发怒,易有胃病,消化不良等疾.`],
		"申": [`申宫天孤勿早婚，早婚必定配二婚。\n男子离婚需再娶，女命必配二夫君。\n奔波劳碌依靠少，婚后提防婚外人。`, `男伤子来女刑夫.不宜早婚,双重性格,难得平衡; 易有肺胸、咳嗽、哮喘等之疾病.`],
		"酉": [`酉宫天刃有是非，争强好胜会显威。\n为人生来贪心大，由于贪心吃了亏。\n事业经营路子广，常因失算把钱赔。`, `性刚气强不服输，天南地北耍单独.若不听人多劝阻，自作聪明将身误。忠实可靠固执.一生富于大自然之爱好;易有气管炎,心脏不宁等症.`],
		"戌": [`戌宫天艺性情和，为人生来话不多。\n技艺之道有发展，一生不遇大风波。\n财运平常过得去，无忧无虑渡生活。`, `天艺星君入命宫，一生遇贵得贤能;执行力强但缺乏忍耐性,会有眩晕,中风,思想错乱,牙筋疼痛等疾病.`],
		"亥": [`亥宫天寿人慈心，克己奉公近人情。\n走遍天下有人敬，命中是个长寿星。\n福如东海长流水，寿比南山不老松。`, `天寿星君福寿长，上尊下敬性温良;一间即悟心地善，愁散之时喜气扬。易引起误会,招致他人指责,其人本质,实为谦让为怀,无视个人财产,愿与亲友同处于恬逸之境,易因感冒而成痛风症,或因血液有毒而化肿疮,以及关节炎,肢体麻痹等症.`],
	};
	return DataMap[item];
}

// 得到地支与其它中的关系


export const getRelaAboutByGanZhi = (item: string): string[] => {

	const DataMap: { [key: string]: string[] } = {

		// 子未相害,丑午相害,寅巳相害,卯辰相害,申亥相害,酉戌相害。
		// 子午相冲,丑未相冲,寅申相冲,卯酉相冲,巳亥相冲,辰戌相冲。
		// 子酉相破,卯午相破,辰丑相破,戌未相破,寅亥相破,巳申相破。 
		// 子卯相刑,寅巳申三刑（恃势之刑）,丑未戌三刑（无恩之刑）, 辰辰自刑、午午自刑、酉酉自刑、亥亥自刑
		// 盲派中的： 子破卯、卯破午、午破酉
		// 寅酉绝，卯申绝，子巳绝，午亥绝。
		"子": [`子午相冲，子未相害，子酉相破，子卯相刑，子丑六合土，申子辰三合水，亥子丑三会北方水，子巳绝，子巳暗合，子巳绝`],
		"丑": [`丑未相冲，丑午相害，辰丑相破，未丑戌三刑（无恩之刑），丑子六合土，巳酉丑三合金，亥子丑三会北方水，丑与未相冲`],
		"寅": [`寅申相冲，寅巳相害，寅亥相破，寅巳申三刑（恃势之刑），寅亥六合木，寅午戌三合火，寅卯辰三会东方木，寅与亥暗合，寅酉绝`],
		"卯": [`卯酉相冲，卯辰相害，卯午相破，子卯相刑，卯戌六合火，亥卯未三合木，寅卯辰三会东方木，卯申绝`],
		"辰": [`辰戌相冲，辰辰自刑，辰丑相破，卯辰相害，辰酉六合金，申子辰三合水，辰戌丑未四库土会`],
		"巳": [`巳亥相冲，寅巳相害，巳申相破，寅巳申三刑（恃势之刑），巳申六合水，寅午戌三合火，巳酉丑三合金，子巳绝`],
		"午": [`午子相冲，午午自刑，卯午相破，丑午相害，午未六合土，寅午戌三合火，巳午未三会南方火，午亥绝`],
		"未": [`未丑相冲，子未相害，戌未相破，丑未戌三刑（无恩之刑），未午六合土，亥卯未三合木，辰戌丑未四库土会`],
		"申": [`申寅相冲，申亥相害，巳申相破，寅巳申三刑（恃势之刑），申子辰三合水，申酉戌三合金，申与子半合水，卯申绝`],
		"酉": [`酉卯相冲，酉戌相害，酉酉自刑，子酉相破，酉辰六合金，巳酉丑三合金，申酉戌三会西方金，寅酉绝`],
		"戌": [`戌辰相冲，酉戌相害，戌未相破，未丑戌三刑（无恩之刑），戌卯六合火，寅午戌三合火，辰戌丑未四库土会`],
		"亥": [`亥巳相冲，亥申相害，亥寅相破，亥亥自刑，寅亥六合木，亥子丑三合水，亥卯未三合木，午亥绝`]

	};
	return DataMap[item] || [];
}





// 得到属相的婚配

export const getMarryByShuXinag = (item: string): string[] => {


	const DataMap: { [key: string]: string[] } = {
		// 忌的属相，最喜，其次的属相 ，不能属相

		// 子未相害,丑午相害,寅巳相害,卯辰相害,申亥相害,酉戌相害。
		// 子午相冲,丑未相冲,寅申相冲,卯酉相冲,巳亥相冲,辰戌相冲。
		// 子酉相破,卯午相破,辰丑相破,戌未相破,寅亥相破,巳申相破。 
		// 子卯相刑,寅巳申三刑（恃势之刑）,丑未戌三刑（无恩之刑）, 辰辰自刑、午午自刑、酉酉自刑、亥亥自刑
		// 盲派中的： 子破卯、卯破午、午破酉

		// 子：子午相冲，子未相害，子酉相破，子卯相刑。
		// 丑：丑未相冲，丑午相害，辰丑相破，未丑戌三刑（无恩之刑）。
		// 寅：寅申相冲，寅巳相害，寅亥相破，寅巳申三刑（恃势之刑）。
		// 卯：卯酉相冲，卯辰相害，卯午相破，子卯相刑。
		// 辰：辰戌相冲，辰辰自刑，辰丑相破，卯辰相害。
		// 巳：巳亥相冲，寅巳相害，巳申相破，寅巳申三刑（恃势之刑）。
		// 午：午子相冲，午午自刑，卯午相破，丑午相害。
		// 未：未丑相冲，子未相害，戌未相破，丑未戌三刑（无恩之刑）。
		// 申：申寅相冲，申亥相害，巳申相破，寅巳申三刑（恃势之刑）。
		// 酉：酉卯相冲，酉戌相害，酉酉自刑，子酉相破。
		// 戌：戌辰相冲，酉戌相害，戌未相破，未丑戌三刑（无恩之刑）。
		// 亥：亥巳相冲，亥申相害，亥寅相破，亥亥自刑。


		"子": [`牛`, `龙,猴`, `马（冲）、羊（害）、鸡（破）、兔（刑）`, ` 子丑合化土 | 黑鼠黄牛正相合，结交婚配岔不脱;`, `申子辰合化水`, `子未相害,子午相冲,子酉相破,子卯相刑 | 羊鼠一旦休，老鼠兔子不成婚，马踏老鼠情不留`],
		"丑": [`鼠`, `蛇,鸡`, `羊（刑冲）、马（害）、龙（破）、狗（三刑）`, ` 子丑合化土 | 黑鼠黄牛正相合，结交婚配岔不脱;`, `巳酉丑合化金局`, `丑未相冲，丑午相害，丑戌相破，丑辰相刑 | 牛羊相逢泪淋淋,从来白马怕青牛，夫妻相配难白头`],
		"寅": [`猪`, `马,狗`, `猴（刑冲）、蛇（刑害）、猪（破）`, ` 寅亥合化木 | 白虎黑猪上等婚，有财有势有吃头`, `寅午戌合化火局`, `寅申相冲，寅巳相害，寅申相破，寅寅自刑 | 蛇见猛虎如刀断,虎猴一见两地办`],
		"卯": [`狗`, `猪,羊,蛇`, `鸡（冲）、龙（害）、马（破）、鼠（刑）`, ` 卯戌合化火 | 白兔黄狗古来有，玉兔黄狗到白头`, `亥卯未合化木局`, `酉卯相冲，卯辰相害，卯午相破，子卯相刑 | 老鼠兔子不成婚，兔龙相配难到老。`],
		"辰": [`鸡`, `猴,鼠`, `狗（冲）、兔（害）、牛（破）、龙（刑）、猪(盲断)`, ` 辰酉合化金 | 黄龙黑鸡更相投，过门大发好事周`, `申子辰合化水`, `戌辰相冲，辰酉相害，辰未相破，辰辰自刑 | 江猪不敢跳龙门，玉兔见龙阎王见，龙龙自刑不相宜`],
		"巳": [`猴`, `牛,兔`, `猪（冲）、虎（刑害）、猴（刑破）、狗(盲断) 、鼠(盲断)、鸡（盲断）`, `[巳申合化水 | 猴蛇相配满堂红，幸福美满最兴隆`, `巳酉丑合化金局`, `[亥巳相冲，巳寅相害，巳亥相破，巳申相刑 | 戌狗不到巳上去，蛇虎相斗似刀戳，蛇鸡莫通婚，蛇见猛虎如刀断，蛇鼠莫相见，蛇猪也不和`],
		"午": [`羊`, `虎,狗`, `鼠（冲）、马（刑）、兔（破）、牛（害）、鸡（盲断）`, `午未合化火 | 马配羊儿美中美，一世吉祥共白头;`, `寅午戌合化火局`, ` 子午相冲，午未相害，午寅相破，午午自刑  | 金鸡不到马群跑，从来白马怕青牛,马与牛配不到头，马踏老鼠情不留`],
		"未": [`马`, `猪,兔`, `牛（刑冲）、鼠（害）、狗（刑破）`, ` 午未合化火 | 马配羊儿美中美，一世吉祥共白头;`, `亥卯未合化木局 `, `丑未相冲，未子相害，未戌相刑相破 | 羊狗是对头，赶得遍山游，羊鼠不可配，相逢一旦休,牛羊不同睡,相逢泪淋淋.`],
		"申": [`蛇`, `鼠,龙`, `虎（刑冲）、猪（害）、蛇（刑破）`, ` 巳申合化水 | 猴蛇相配满堂红，幸福美满最兴隆`, `申子辰合化水`, `寅申相冲，申亥相害，申寅相破，申未相刑 |  虎猴一见两地分`],
		"酉": [`龙`, `蛇,牛`, `兔（冲）、狗（害）、鸡（刑）、鼠（破）、马（盲破）`, ` 辰酉合化金 | 黄龙黑鸡更相投，过门大发好事周`, `巳酉丑合化金局`, `酉卯相冲，酉戌相害，酉巳相破，酉辰相刑 | 金鸡不到马群跑，金鸡见犬泪双流，从来夫妻难到头`],
		"戌": [`兔`, `虎,马`, `龙（冲）、鸡（害）、牛（刑破）、羊（三刑）、蛇(盲断)`, ` 卯戌合化火 | 白兔黄狗古来有，结婚相好到白头`, `寅午戌合化火局`, `辰戌相冲，戌亥相害，戌午相破，戌未相刑 | 戌狗不到巳上去，金鸡见犬泪双流，从来夫妻难到头;羊狗是对头，赶得遍山游。`],
		"亥": [`虎`, `兔,羊`, `蛇（冲）、猴（害）、虎（破）、猪（刑）、龙(盲断)`, ` 寅亥合化木 | 白虎黑猪上等婚，有财有势有吃头`, `亥卯未合化木局`, `巳亥相冲，亥辰相害，亥申相破，亥戌相刑 | 猪遇猿猴不到头，羊鼠一旦休，江猪不敢跳龙门`],
	};
	return DataMap[item];
}







// 根据月支直接断性格 
// export const dizhiList: string[] = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const getDetailByMonthZhi = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"子": '机灵精明，善于保护自己，胆小，警觉性高，会盘算; \n 反复不定决策慢，易有始无终。',
		"丑": '本性善良，求稳求安定，做事认真; \n 爱钻牛角尖，好打破砂锅问到底。',
		"寅": '能干耐劳，劳碌命，行动快，故常有缺少沟通导致分歧; \n 不会推卸责任，也不太接受批评',
		"卯": '智慧高,人聪明，能保护自己, 一般犯错不认错;\n  不显老，显小，爱干净，天生第六感强; \n 喜欢坚持一直把工作作完，不喜欢中途停顿。',
		"辰": '个性不定，不喜管束，交际多，异性缘好桃花多; \n 聪明，角色会是事业上的好伙伴及热心助人的好友。',
		"巳": '心思细密，分析力强; \n 讲话做事有城府,遇到挫折就会放弃; \n  格局上有眼光，数字概念清楚，善于理财，为生意上好手。',
		"午": '憨厚性直心肠软，禁不起刺激;易受人怂恿，易被设计;  ',
		"未": '做事一丝不苟，行事谨慎，打破砂锅问到底。\n 对感情专注忠贞,会查行踪，翻旧账; \n 孝顺, 胆小重外表，喜钻牛角尖，爱生气。',
		"申": '机灵嘴快，有冲劲，猴急，喜走快捷方式。\n 喜欢好出风头，异性缘好。',
		"酉": '大小通吃，过度热心，好管闲事，不会拒绝别人;\n冲劲小，悲观第六感强，特在乎别人的看法',
		"戌": '个性善良，忠心，信用佳，贵人多，福报好;\n 常突发奇想，而有惊人之举; \n  是好朋友及好部下; \n 容易为感情冲动，有戒心难相信人。',
		"亥": '易痴情想不开; \n 喜欢安静，自己安静希望自己的配偶也很静; \n 善利用别人,借力使力，很注重口腹之欲，会扮猪吃老虎，为生意高手。',
	};
	return DataMap[item];
}
// 根据纳音得出来性格 

export const getDetailByNaYin = (item: string): string[] => {
	const DataMap: { [key: string]: string[] } = {
		//  "纳间名称"：['性格特点','大运情况']

		"海中金": ["深邃难测,城府较深", ''],
		"炉中火": ["热情奔放,积极向上,超爱笑，笑起来很夸张，笑声有感染力。", ''],
		"大林木": ["能团结人，仁义好善", ''],
		"路旁土": ["心胸狭窄，自私自利", ''],
		"剑锋金": ["孤刚斗狠，直来直去", ''],
		"山头火": ["疯狂奔放，激情热烈", ''],
		"涧下水": ["温文而雅，清新自然", ''],
		"城头土": ["固执呆板，不通活变", ''],
		"白蜡金": ["吝啬小气，心胸狭窄", ''],
		"杨柳木": ["随风倒，善变通", ''],
		"泉中水": ["心胸宽广,胸怀博大", ''],
		"屋上土": ["诚实守信,喜欢表现 ", ''],
		"霹雳火": ["脾气燥暴,点火就着", ''],
		"松柏木": ["心平气和,善良仁义", ''],
		"长流水": ["喜动不喜静,喜游玩", ''],
		"沙中金": ["高贵典雅,谨慎小心", ''],
		"山下火": ["脾气火爆,积极向上", ''],
		"平地木": ["谨慎小心,不惹事非", "结认很多新朋友和人脉。"],
		"壁上土": ["不和群,个性散慢", ''],
		"金箔金": ["虚假不实,华而不实", ''],
		"覆灯火": ["喜神秘,聪明善良", ''],
		"天河水": ["心高气傲,婚姻不顺", ''],
		"大驿土": ["胸怀博大,心胸宽厚", "外出走动较多,新交朋友增多。"],
		"钗钏金": ["高贵典雅,孤芳自赏", ''],
		"桑柘木": ["威武不屈,刚强好胜", ''],
		"大溪水": ["奔波万象,积极向上", ''],
		"沙中土": ["不合群,孤独无助", ''],
		"天上火": ["热情向上,性急而燥", ''],
		"石榴木": ["心机多,多谋少成", ''],
		"大海水": ["心胸宽广,宽容忍耐", ''],
	};
	return DataMap[item];
}


// 根据年支直接断性格 
// export const dizhiList: string[] = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const getDetailByYearZhi = (item: string): string => {
	const DataMap: { [key: string]: string } = {
		"子": '胆子小比较明显，太听话，常常被人骗，安全感低，害怕受伤，害怕孤单，平时又不找人玩，真的是很孤单，表面乐观内心悲观，什么事都不愿解释。',
		"丑": '有强迫症，神经质，睡觉前都觉得门窗没锁，会霸道，感情偏执，不轻易放手，且容不下一粒沙子，看不惯的东西超多，恋旧，一首喜欢的歌可以听 N 年。',
		"寅": '有明显选择困难症，倔强要面子，不愿求人帮助，不不圆滑不世故不记仇，对繁琐的事情没耐心，容易放弃。心软，哪怕受伤了一句道歉就没关系了。',
		"卯": '保护色强，慢热，情绪化，爱撒娇，超级黏人，喜欢赖床。矛盾体，爱幻想，隐藏悲伤，装坚强，却希望别人安慰他、给他安全感,浪漫体贴会疼爱人，外表孩子，内心成熟。',
		"辰": '霸道且控制欲强，爱整洁，喜欢裸睡，喜欢胡思乱想，悲观，性格较极端，泪腺发达，易被感动。喜欢跟爱人身体接触，有较强的依赖感，恨不得把身体揉进去那种。双重性格，总追求完美。',
		"巳": '爱钻牛角尖， 爱较真，敷衍了事在这里过不了关，自己不冷不热让人难以靠近，讨厌等人自己又爱迟到，敏感多疑又内心温和善良，会一直坚守对方，会傻傻为对方做事，自我感动。',
		"午": '男性多对最亲的人容易暴脾气，窝里横，女性则相对少一些。爱睡觉，对多数人和事不上心，随遇而安的态度。不爱争抢，以为好心会有好报去迎合对方。',
		"未": '善忘，喜欢自由，超爱玩，非常注重第一印象，几乎一见定生死，有轻微强迫症和洁癖，好吃好玩好看的都会喜欢上，容易被感动，好哄，不愿意与人计较。 ',
		"申": '有求必应，所以易被骗，被人误解却不愿解释，不喜欢和人打交道，喜欢宅，超懒爱睡觉和发呆，擅长装傻，喜欢钱但不再乎，讨厌干无意的事。',
		"酉": '记仇，得罪了一辈子都记得，生气的时候不怕发火，怕的是沉默，直觉敏锐，敢爱敢恨，感情被动，占有欲强烈，喜欢独占，不喜欢与人分享。',
		"戌": '健忘不记仇，只要没碰底线基本没事，喜欢简单，讨厌麻烦和累，别人的好总想加倍奉还，讨厌做决定，计划性强，做事固执，撞了南墙就把墙拆了继续走。',
		"亥": '喜欢吃，顶级吃货，霸道，懒且超级怕麻烦，爱捉弄人，自恋爱美。外冷内热，能把配偶惯坏的人。',
	};
	return DataMap[item];
}


export const getDetailByDayGanOkBad = (item: string): string[] | [] => {
	const DataMap: { [key: string]: string[] } = {
		"甲": ['有学习能力，有毅力，正直，会助人，能体谅人，有责任感。', '不知妥协变通，会主观，会干涉别人，在超过临界点后会崩溃。'],
		"乙": ['有丰富表现力，反应快，不会坚持己见，善理财，情绪管理能力强，韧性超强。', '易见风转舵，现实，占有欲强，较有心机，经不起诱惑，心软，没主见。'],
		"丙": ['开朗直爽，不计较，理解力强，精力充沛。', '性急易冲动; \n  思维快，变化节奏快，团队合作中跟不上节奏就会被认为是无理头变化而坏事。'],
		"丁": ['温和热情，行事谨慎，不易表达内心情感。', '不善拒绝，凡事犹豫不决，易猜忌怀疑,误人误事。'],
		"戊": ['耿直不善修饰，有计划条理,重感情青助人。', '任性顽固，以自我为中心，无趣，不浪漫，喜好奉承，好面子，不主动。'],
		"己": ['理解吸收快，才能多，不固执，能深入学习，但用不用得上另说。', '内心复杂矛盾，容易被人利用。'],
		"庚": ['刚毅不服输，积极果断，有正义感，不虚伪，能表现，口才善辩。', '率直易得罪人，冲动易与人冲突，自我表现欲强，对事粗率不细心。'],
		"辛": ['敏感细腻，创新力强，常有独特想法，出奇不意，出其制胜。', '好面子，在乎外表，抗压能力弱，强压之下易失理性思考经不起打击。'],
		"壬": ['智慧聪明，文武双全，有领导力。', '任性，益怠惰、依赖，对事不易坚持、虎头蛇尾，对异性感情心思过多。'],
		"癸": ['重视规则及道德，略有洁癖，勤奋有耐力，冷静。', '较拘泥，易幻想，易悲观，感情脆弱，会有点神经质。'],
	};
	return DataMap[item];
}


// 根据天干的合来判断性格 

export const getXingGeByGanRela = (item: string | string[], dayGan: string) => {

	let refitem = ''
	const DataMap: { [key: string]: string } = {
		'甲己合土': '讲信用，有点固执,人缘不错。\n 一板一眼，不懂生活情趣，不解风情。',
		'乙庚合金': '很重义气，果断力强,不懂生活情趣。\n 不愿意得罪人，看到不高兴的，会忍下来。',
		'丙辛合水': '很聪明，人缘好，有个性，有个魅力。\n  喜欢年轻气质好的异性，特别喜欢听自己话的异性。\n 自己容易偷情; ',
		'丁壬合木': '注重穿着，无心机，心慈性善，长命多寿。\n 非常有异性缘,重情调，懂生活情趣。\n',
		'戊癸合火': '重情调，易生气，会给人有点冷的感觉。\n 异性喜欢成熟的，重情趣，一般会有一夜情。\n 一般不特别介意年龄差距。',

	}

	if (Array.isArray(item)) {

		item.forEach(i => { if (i.includes(dayGan)) refitem += DataMap[i] + '\n' })
	}
	else {
		refitem = DataMap[item]
	}
	return refitem
}

// 根据地支的合来判断性格 

export const getXingGeByZhiRela = (item: string | string[], dayZhi: string) => {

	let refitem = ''
	const DataMap: { [key: string]: string } = {
		// '亥子丑三会水': '亥子丑三会水',
		// '寅卯辰三会木': '寅卯辰三会木',
		// '巳午未三会火': '巳午未三会火',
		// '申酉戌三会金': '申酉戌三会金',
		'申子辰三合水': '多元化智慧，团队做事会临时改变，让别人不适应; \n 心硬会冷眼旁观，冷漠自私。',
		'寅午戌三合火': '热情，前热后冷，行动派，急性子。',
		'亥卯未三合木': '比较会有不切实际的想法，较有梦想(白日梦)。',
		'巳酉丑三合金': '会包装自己，讲义气，会强出头，会有血光之灾。',
		'子午相冲': '个性极端反复不定，情绪不稳定,易生气上头; \n 容易脑神经衰弱，休息不好 。',
		'卯酉相冲': '天生第六感强，做事利落，人缘好，异性缘佳。',
		'寅申相冲': '容易车祸意外发生，开车很快，较会走大马路，易生车祸。\n 六亲较无缘，一辈子靠自己，一生大起大落。\n 忙碌，闲不住，劳碌命。',
		'巳亥相冲': '容易车祸意外发生，\n 口才佳，爱聊天，追根究底，较会钻小巷抄近路。',
		'辰戌相冲': '脾气难自控，会将错就错，归错于别人，自己没错; \n 喜做老大，做事野心大，开销大,投资失败多，还容易失败。 \n 婚姻和配偶容易出问题。',
		'丑未相冲': '爱追根究底，主观意识强。\n 能赚也能花开销大，易赔钱; \n 不怕吵架，跟邻居也不怕吵架，女的易流产。',
		'子未相害': '有个性，容易犯小人，易换工作，有孩子则会早分开。',
		'丑午相害': '耐性差，容易生气，脾气不好。',
		'寅巳相害': '是非多，无恩情(人情)，易犯小人。\n 如果离婚，也可能同住一屋檐下。',
		'卯辰相害': '易遭亲近的人伤害，且杀伤力很大。\n 好朋友兄弟少或相助很少;\n 好心帮别人，反而惹一堆麻烦，愈亲近的人，反驳力越大。',
		'申亥相害': '易犯小人，常有是非。\n 和配偶容易相见不如怀念，相见就生气，不见又怀念。',
		'酉戌相害': '常被亲近的人戏弄，朋友扯后腿，\n 兄弟少或相助很少，自己易离婚。',
		'子卯无礼相刑': '经常会碰到不客气，脾气不好、没礼貌的事情发生在自己身上;\n  亲人会有比较早去世的。',
		'丑未戌恃势三刑': '做事会太过有自信，猛进易遭挫折，心硬不易有侧隐之心，常有灾，易孤独。',
		'寅巳申无恩三刑': '经常做到累死也换不来别人的感恩，替别人打江山也难碰到对自己感恩的明主，且易遭陷害或恶事发生。',
		'辰辰自刑': '喜欢当老大，不喜被左右，做事常易有头无尾，感觉怀才不遇。',
		'午午自刑': '好胜缺耐性，容易被话语刺激到。',
		'酉酉自刑': '讲义气，常帮助别人不得好，太过热情反被伤成忧郁。',
		'亥亥自刑': '聪明有智慧，有事不说，会无理取闹，歇斯底里，悲观，易有自杀倾向。',
		'巳申相破|六合水': '有很多事，会聪明反被聪明误，经常做到累死也换不来别人的感恩。',
		'辰酉六合金': '重义气，没定性。',
		'卯戌六合火': '爱面子，注重外表，顾家。',
		'寅亥相破|六合木': '重视伦理道德;',
		'子丑六合土': '会和配偶良好沟通，会顾家。',
		'午未六合火或土': '重情意，天生脾气不好，数事重感觉。',
	}

	if (Array.isArray(item)) {

		item.forEach(i => { if (i.includes(dayZhi)) refitem += (DataMap[i] ? DataMap[i] + '\n' : '') })
	}
	else {
		refitem = DataMap[item]
	}
	return refitem
}



export const getPeiOuAgeByGeJu = (item: string) => {
	const list = {
		正官格: "与配偶差距也不会很大。",
		七杀格: "可以接受并喜欢年龄差距大的配偶，另一半要比自己大。",
		食神格: '可以接受并喜欢年龄差距大的配偶，另一半要比自己大。;',
		伤官格: '可以接受并喜欢年龄差距大的配偶，另一半要比自己大。',
		比肩格: '配偶年龄差距也不会很大',
		劫财格: '喜欢配偶年龄差距一般差2-3岁。',
		正财格: '喜欢配偶年龄差距较小;',
		偏财格: '喜欢年龄小的，年龄比自己小很多岁。',
		正印格: '喜欢配偶年龄差距较小;',
		偏印格: '喜欢配偶年龄差距差2-3岁。',
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};


export const getPeiOuXingGeByShiShen = (item: string) => {
	const list = {
		正官: "领导，当官的，朋友不多，性格严肃;",
		七杀: "领导，当官的，朋友不多，性格严肃;",
		食神: '不是领导，口才好，有技术或艺术特长，收入来源多，但不稳定;',
		伤官: '不是领导，易有自己的想法，上进心，有技术或艺术特长，收入不稳定;',
		比肩: '爱交朋友，朋友多，;',
		劫财: '收入不稳定;',
		正财: '学历不高，收入稳定;',
		偏财: '学历不高，收入高低波动;',
		正印: '学历高，气质儒雅，上进心不强，口才和文笔一般;',
		偏印: '学历高，气质儒雅，上进心不强，口才和文笔一般',
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};


/**
 * 根据五行获取相关工作描述的函数
 * @param item 可以是字符串或字符串数组
 * @returns 相关描述字符串
 */

export const getWorkByWuxing = (item: string | string[]) => {
	let refitem: string = '';

	const mean = {
		木: `喜木行业,喜东方
         1、五行属木的行业有体育文娱、印刷业、造纸、家具加工、木制品加工、服装加工、纺织鞋帽、家居饰品、医疗卫生行业、林业、花卉园林、出版业、包装器材业、音像制品、果业、宗教业、药材茶叶、律法界、公共事务服务业、生物工程以及自由职业。
         2、可从事木材，木器，家具，装潢，木成品，纸业，种植，养花，育树苗，敬神物品，香料，植物性素食品等经营和事业。文学、文艺、文具店、文化事业的文人，教育界、书店、出版社、公务界、司法界、政界、新创设计、动植物生长界等。`,
		火: `喜火行业，喜南方.
         1、五行属火的行业大体有新闻、出版、科研、教育、石油化工、橡胶塑料合成制品、通信通讯、邮政、计算机、网络、广告、会展、商务办公、咨询业、党政机关、社会团体、光学照明、电力供应、媒体等。
         2、可从事照明，光学，高热，易燃，油类，酒精类，热饮食，食品，理发，化妆品，人身装饰品，文艺，文学，文具，文化学生，文人，作家，写作，撰文，教员，校长，秘书，出版，公务，政界等方面的事业。 `,
		土: `喜木行业,喜中央之地，喜本地.   
        1、五行属土的行业大体有城建、房地产、规划师、环保部门、建筑材料、陶瓷、安装装潢、电子仪表、新能源、殡葬业、医药加工行业、日用杂品行业、烟草业、粮油副食品行业、皮革行业、废旧物资回收再生产、古董古玩、畜牧业、石材石料加工、物业管理、采矿以及农产品生产行业。
        2、可从事土产，地产，农村，畜牧，布匹，服装，纺织，石料，石灰，山地，水泥，建筑，房产买卖，雨衣，雨伞，筑堤，容水物品，当铺，古董，中间人，律师，管理，买卖，设计，顾问，丧业，筑墓，墓地管理，僧尼等等一切和土有关之行业。`,
		金: `喜金行业，喜西方
        1、可从事精纤材或金属工具材料，武术，鉴定，总管，汽车，交通，金融，工程，种子，开矿，民意代表，伐木，机械等行业。
        2、可从事属金的行业冶金、冶炼、金属制品加工、磨具、金银珠宝生产销售、金融产业、银行业、证劵期货、投资产业、自动化设备、衡器制造、机械车辆生产、机械配件、厨具、财会、工艺礼品制造。`,
		水: `喜水行业，喜北方.
        1、适合流动、奔波、连续运动、水属性质的行业和职业。   
        2、五行属水的行业大体有餐饮业、贸易、批发、市场推销、交运物流、渔业、远洋捕捞运输、水产养殖、保险、理财师、外事服务、出国中介、商务培训、造酒业、家政服务、水利管理、冷冻加工、茶馆、剧场、消防、旅游导游，旅游业、特技表演、运动员、导游、玩具业、声乐音响业、魔术、马戏团、记者、 侦探、旅社等。 `
	}

	if (Array.isArray(item)) {
		item.forEach(i => refitem += '\n • ' + mean[i] + '\n')
	}
	else {
		refitem += mean[item] + '\n'
	}

	return refitem
}


//根据地支得到生肖属相

export const getShengXiaoByZhi = (item: string | string[]) => {

	let refitem: string = '';

	if (Array.isArray(item)) {
		item.forEach(i => refitem += shengxiaoList[dizhiList.indexOf(i)] + '')
	}
	else {
		refitem += shengxiaoList[dizhiList.indexOf(item)] + ''
	}

	return refitem

}


// 得到生消的年份 
// 定义十二生肖的类型

// 定义一个映射对象，存储每个生肖的起始年
const zodiacStartYears = {
	鼠: 1924,
	牛: 1925,
	虎: 1926,
	兔: 1927,
	龙: 1928,
	蛇: 1929,
	马: 1930,
	羊: 1931,
	猴: 1932,
	鸡: 1933,
	狗: 1934,
	猪: 1935,
};

// 定义一个方法，接收生肖，返回对应的年份数组

export const getYearsForZodiac = (zodiac: string, nearYearFlag?: Boolean): number[] => {
	const startYear = zodiacStartYears[zodiac];
	// 创建一个数组，存储所有与该生肖对应的年份
	let years: number[] = [];
	for (let year = startYear; year <= 2099; year += 12) {
		years.push(year);
	}

	if (nearYearFlag) {
		let currentYear = new Date().getFullYear();
		return years.filter(year => year > currentYear - 18 && year <= currentYear);
	}
	else {
		return years;
	}

}

// yearList.filter(year => year > 2008 && year < 2030);


// 测试方法
// const zodiac = '鼠'  
// const years = getYearsForZodiac(zodiac);



//根据日干得到贵人

// **口诀**

// 甲戊庚牛羊， 乙己鼠猴乡，

// 丙丁猪鸡位， 壬癸蛇兔藏，

// 庚辛逢马虎， 此是贵人方。

// 即：

// 甲日见丑未；乙日见申子；

// 丙日见酉亥；丁日见酉亥；

// 戊日见丑未。己日见申子；

// 庚日见丑未；辛日见寅午；

// 壬日见卯巳；癸日见卯巳。


export const getGuiRen = (item: string): string[] | [] => {
	const DataMap: { [key: string]: string[] } = {
		"甲": ['丑', '未'],
		"乙": ['申', '子'],
		"丙": ['酉', '亥'],
		"丁": ['酉', '亥'],
		"戊": ['丑', '未'],
		"己": ['申', '子'],
		"庚": ['午', '寅'],
		"辛": ['午', '寅'],
		"壬": ['卯', '巳'],
		"癸": ['卯', '巳'],
	};
	return DataMap[item];
}


//根据日干得到禄神
export const getLushen = (dayMaster: string): string | null => {
	const lushenMap: { [key: string]: string } = {
		"甲": "寅",
		"乙": "卯",
		"丙": "巳",
		"丁": "午",
		"戊": "巳",
		"己": "午",
		"庚": "申",
		"辛": "酉",
		"壬": "亥",
		"癸": "子"
	};
	return lushenMap[dayMaster];
}

// 根据日干得到红艳煞
export const getHongYanByGan = (gan: string): string => {
	const dataMap: { [key: string]: string } = {
		'甲': '午',
		'乙': '申',
		'丙': '寅',
		'丁': '未',
		'戊': '辰',
		'己': '辰',
		'庚': '戌',
		'辛': '酉',
		'壬': '子',
		'癸': '申'
	};
	return dataMap[gan] || '';
};

////日干查地支 得到羊刃 

// '甲卯', '乙寅', '丙午', '丁巳', '戊午', '己巳', '庚酉', '辛申', '壬子', '癸亥'
export const getYinRen = (dayMaster: string): string | null => {
	const lushenMap: { [key: string]: string } = {
		// "甲": "卯",
		"乙": "辰",
		// "丙": "午",
		"丁": "未",
		// "戊": "午",
		"己": "未",
		// "庚": "酉",
		"辛": "戌",
		// "壬": "子",
		"癸": "丑"
	};
	return lushenMap[dayMaster];
}

export const getYangRen = (dayMaster: string): string | null => {
	const lushenMap: { [key: string]: string } = {
		"甲": "卯",
		"乙": "寅",
		"丙": "午",
		"丁": "巳",
		"戊": "午",
		"己": "巳",
		"庚": "酉",
		"辛": "申",
		"壬": "子",
		"癸": "亥"
	};
	return lushenMap[dayMaster];
}



//得到五鬼
export const getWuGui = (MonthMaster: string): string | null => {
	const wuguiMap: { [key: string]: string } = {
		"子": "辰",
		"丑": "巳",
		"寅": "午",
		"卯": "未",
		"辰": "申",
		"巳": "酉",
		"午": "戌",
		"未": "亥",
		"申": "子",
		"酉": "丑",
		"戌": "寅",
		"亥": "卯"
	};
	return wuguiMap[MonthMaster];
}

//得到是否截脚 --参数为 水火  两个字的五行 
export const isJieJiao = (wuxing: string): boolean => {
	if (getWuXingRelation(wuxing[0], wuxing[1]) === '克') {
		return true;
	}
	else
		return false
}

//得到是否盖头  --参数为 水火  两个字的五行 
export const isGaiTou = (wuxing: string): boolean => {
	if (getWuXingRelation(wuxing[1], wuxing[0]) === '克') {
		return true;
	}
	else
		return false
}






// 根据天干地支的关系，得到人品的信息 

export const getRenPinByRela = (item: string) => {
	const list = {
		甲己合土: '重信用，较固执，一板一眼; \n 不懂情趣，不解风情，但人缘好。',
		乙庚合金: '重义气，有仁德，刚强果断，不懂情趣; \n 重视规则，不会去得罪别人，会忍受。',
		丙辛合水: '人缘好，重情趣和心灵感受，; \n 气质好，易偷情; \n 爱管别人，个性强，仪表威严，喜欢年轻的异性。',
		丁壬合木: '心软，注重穿着，较无心机;\n 有异性缘，重品位，风情万种; \n 心地善良，长命多寿，重视情调，懂得生活情趣。',
		戊癸合火: '无情之合，重视情调但情意不足;\n 感情多不顺，与同龄人交往不合，但年龄差距大则极美。 \n 给人冷冷的感觉，翻脸就像翻书一样，气过就算。\n 注重礼节周到，也较为现实，多会有一夜情。',
		亥子丑三会水: '多元智慧，思想变化较大; \n冷眼旁观，临时改变，有冷漠自私的倾向',
		申子辰三合水: '多元智慧，思想变化较大; \n冷眼旁观，临时改变，有冷漠自私的倾向',
		申酉戌三会金: '指挥性强，讲义气; \n外表威严，有肃杀之气，爱强出头，会包装自己',
		巳酉丑三合金: '指挥性强，讲义气; \n外表威严，有肃杀之气，爱强出头，会包装自己',
		巳午未三会火: '对人热情，做事效率高，前热后冷; \n行动派，执行力强，性子急躁',
		寅午戌三合火: '对人热情，做事效率高，前热后冷; \n行动派，执行力强，性子急躁',
		寅卯辰三会木: '多幻想，不切实际; \n心软，计划多，执行力弱',
		亥卯未三合木: '多幻想，不切实际; \n心软，计划多，执行力弱',
		子午相冲: '长得一般很漂亮，情绪不稳定，发起火来水火不容;火气旺，容易神经衰弱。 对人热情，人缘好异性缘佳;',
		丑未相冲: '爱钻牛角尖，爱打破沙锅问到底; \n 理财观不强， 存不住钱，能花钱,易赔钱, 小财不断流失; \n 会论对错，不怕与邻居或亲近的人吵架辩对错; \n 感情相处中，会查行踪，女命易流产; ',
		寅申相冲: '忙碌，闲不住; \n 开车很快，易生车祸; \n 六亲无缘，一辈子靠自己; \n 适合外务，东奔西跑，对人付出，却很难得到人家感激',
		卯酉相冲: '做事利落，敏锐，有第六感，有时会看到第六空间; \n 人缘好，异性缘佳，长辈缘好，; \n 会衡量人，凭直觉做事',
		辰戌相冲: '不服输，脾气难以控制，但能自找台阶; 会将错就错，归错于别人; \n 野心大，喜欢当老大; \n  开销大，钱财守不住，好运的时候大赚，差运则会赔',
		巳亥相冲: ' 有辩才的才能，爱聊天，爱追根究底，也常祸从口出，得理不饶人; \n 办事易抄近路，求速度，开车较会钻小巷，也易生车祸; \n 性格适合做外务',
		子丑六合土: '较顾家，能做到夫妻之间好沟通，有话讲',
		卯戌六合火: '顾家，爱面子，重外表，外强内柔',
		'寅亥相破|六合木': '较重伦理道',
		辰酉六合金: '较重义气，但没有定性',
		午未六合火或土: '较重情意，对亲人脾气不好，窝里横,做事重视感觉',
		'巳申相破|六合水': '对人恩义不足，行事多反复，多奔走在路途；; \n 比较聪明，但也有聪明反被聪明误的倾向。',
		子未相害: '个性极端，易犯小人，易换工作，; \n 貌合神离，会要求对方; \n 亲子之间较早分开。',
		丑午相害: '耐性差，容易生气，貌合神离。',
		寅巳相害: '是非多，常有无恩义之事，易犯小人; \n 冷眼旁观，有辩才；; \n如果离婚，也可能住在同一屋檐之下。',
		申亥相害: '是非多，常有无恩义之事，易犯小人; \n 和对象是相见就生气，不见又恨怀念。',
		卯辰相害: '易遭亲人算计，越亲近的人，反驳力越大，杀伤力很大; \n 易扯朋友后腿，兄弟手足靠不上。',
		酉戌相害: '容易被亲近的人戏弄，常发生鸡犬不宁，苦笑不得的事情；离婚率高。',
		子卯无礼相刑: '自恃清高，不喜欢就不去理会，脾气不好，刑中最凶，不孝不悌、相互妒忌，克损六亲。',
		寅巳申无恩刑: '做到累死别人也不会被感激，替别人打江山,换来是多是相互嫌弃 ; \n 只要一点做不好，就会被修理。性情冷酷薄义。易遭别人陷害。',
		丑未戌恃势刑: '太过自信，过于猛进，易遭挫折; \n 无恻隐之心，刚毅，女命易孤独。; \n 认为戌可以帮自己一切搞定，但是往往事与愿违。',
		辰辰自刑: '心理活动想的特多，会郁闷一点的默默积累，精神上自己吓自己，折磨自己，最终常常拿石头砸自己的脚; \n 常有自卑，自闭，自贱、自残、自我折磨，没事找事。',
		午午自刑: '心理活动想的特多，会郁闷一点的默默积累，精神上自己吓自己，折磨自己，最终常常拿石头砸自己的脚; \n 常有自卑，自闭，自贱、自残、自我折磨，没事找事。',
		酉酉自刑: '心理活动想的特多，会郁闷一点的默默积累，精神上自己吓自己，折磨自己，最终常常拿石头砸自己的脚; \n 常有自卑，自闭，自贱、自残、自我折磨，没事找事。',
		亥亥自刑: '心理活动想的特多，会郁闷一点的默默积累，精神上自己吓自己，折磨自己，最终常常拿石头砸自己的脚; \n 常有自卑，自闭，自贱、自残、自我折磨，没事找事。',
	}
	if (list[item]) {
		return list[item]
	}
	else {
		return ''
	}

}




// 通过格局判断适合什么职业  

export const getWorkByShiShen = (item: string) => {

	const list = {
		正官格: ` 1. 适合当公务员，团队领导，公司中高层，依靠管理事物工作，或文书、文管、公务员、政府官员、按部就班式职业，  
             2. 但正官过多就会有强迫症，多代表管理诸官等。  
             3. 宜从事行政、公职、公务人员等工作，适合在政府行政机关、司法界、新闻界、企业管理等部门任领导职务。   
             4. 也适合在行政管理部门任职、领导性质之行业或公职人员等薪水阶层任职。`,
		七杀格: `1. 宜从事军界、警界、职业军人、公安、司法或带有激烈动作性工作. 
             2. 适合公检法单位工作，二把手，有杀气的行业，当参谋长，副总，秘书等，依靠找个人辅佐的工作。   
             3. 适合有危险性的工作，如开采、爆破、武术、运动员、指挥员、登山贸险、外科医生以及别人不敢做的行业等。`,
		食神格: `1. 依靠一项专业的技术比较容易成功。  
            2. 适合从事口才和艺术事业，如教师、演说家、辩论家、教授，扬名事业如歌星、演员、音乐家、外交家、广播播音员、电视节目主持人、作家、雕刻家等。
            3. 也宜从事艺术性行业，如文艺、书法、美术、歌唱、音乐、舞蹈等演艺创作，以及文学、编辑、律师、出版商等。 
            4. 也宜口才比较好的的行业比外联、接待、销售、保险，也适合经商做生意。 `,
		伤官格: `1. 依靠一项专业的技术比较容易成功。  
            2. 适合从事口才和艺术事业，如教师、演说家、辩论家、教授，扬名事业如歌星、演员、音乐家、外交家、广播播音员、电视节目主持人、作家、雕刻家等。
            3. 也宜从事艺术性行业，如文艺、书法、美术、歌唱、音乐、舞蹈等演艺创作，以及文学、编辑、律师、出版商等。 
            4. 也宜口才比较好的的行业比外联、接待、销售、保险，也适合经商做生意。 `,
		比肩格: `1. 喜欢能交到朋友与人打交道的行业和职业。
             2. 个人喜欢自由业、合伙业，付出体力业、富冒险性事业.
             3. 宜从事自由职业，如对外推销、旅游、招待，以及舞厅、酒吧、旅馆、医生、律师、教师、传教士等或凭劳力而自由自主、任意行动等行业。
             4. 可以参军，从事军警武职。
             5. 但比肩为人较讲义气，为人执拗认死理，头脑简单有可能为七杀所压制，或被坏人利用。这点不可不防。`,
		劫财格: `适合具有挑战性能展现行动力的工作
             1、不宜从公职，个性很强，自以为是的性格会惹麻烦。
             2、不大可能和别人一起创业， 不过如顺着自己的个性而作为技术人员，
             3、从军，情报间谍或发明等，就会无形只中培养出热忱。`,
		正财格: `1. 做固定性经商和工薪职业, 也适合做公职工作，也就是上班打工求财.
            2. 即便是创业，也力求从事"稳定"的工作求财，不适合投机。
            3. 宜从事财政、金融、工商、税务、门市、店铺、会计、经理、厂长、董事长等安分守己之职业。`,
		偏财格: ` 1. 宜从事经商贸易等行业，如生意买卖、工厂投资、股票、证券、房产开发以及外资引进等大型商业活动。   
             2. 适合创业做老板，交际可以靠朋友获得商机求财，通常会不停的折腾。
             3. 多与赌、手工艺业及一切操作、整理、实验方面的职业有关，其收入来源有非预见性，与捞“外水”多的行业也有关。`,
		正印格: `1. 正印格多为爱心职业，有耐心、耐性、安定性的职位，如教师、传教士等宗教方面人士，也包含公务员。
             2. 宜从事文化事业，如教育界、宗教、文学家、作家、秘书、图书管理、学术研究等工作。
             3. 适合诸如幼师、导游、护士、写作、文化教育工作，依靠付出爱心的工作。`,
		偏印格: `1. 依靠脑力分析求财。
            2. 适合做顾问，分析师，作家，设计师，音乐家，心理学家，秘书，学术化、归类化的职位，
            3. 或是次要、副级职位等，较之正印，稍缺乏爱心，心性偏刻薄。
            4. 宜从事研究、发明、设计、创造等技术性行业，如美容师、参谋、副职等，以及医疗、艺术、医、卜、星、相等职业。`,
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};


//通过自坐十神得到脾气类型 

export const getPiqiByShiShen = (item: string) => {

	const list = {
		正官: '好脾气，善良稳定的老好人',
		七杀: '暴脾气，不会拐弯，直来直去。',
		食神: '急脾气，脾气来快去也快,刀子嘴豆腐心。',
		伤官: '急脾气，脾气来快去也快,刀子嘴豆腐心。',
		比肩: '犟脾气，脾气上来了不分好坏都犟。',
		劫财: '犟脾气，脾气上来了不分好坏都犟。',
		正财: '倔脾气，不圆滑,努力坚持认为对的。',
		偏财: '倔脾气，不圆滑,努力坚持认为对的。',
		正印: '好脾气，善良稳定的老好人。',
		偏印: '慢脾气，慢条斯理，不急不躁。 ',
	}
	if (list[item]) {
		return list[item]
	}
	throw new Error(`无效的参数: ${item}`);
};


// ===== 已提取到 transform/jiazi-desc.ts =====
export { get60JiaZiYueLing, get60JiaZiDesp } from './transform/jiazi-desc';



//根据相冲判断身体病,干支相冲的时候受伤的是哪一个部位。
// '甲庚': '甲庚相冲',
//     '乙辛': '乙辛相冲',
//     '丙壬': '丙壬相冲',
//     '丁癸': '丁癸相冲'
export const getXiangChoneShouShangWuxing = (str: string) => {

	const list = {
		甲庚相冲: '肝[头]',
		丙壬相冲: '小肠[肩膀]',
		乙辛相冲: '胆[脖颈]',
		丁癸相冲: '心脏血液[舌齿,眼睛]',
		子午相冲: '心脏血液[脾]',
		卯酉相冲: '胆',
		寅申相冲: '肝[小肠,胃]',
		巳亥相冲: '小肠[大肠,胃]',
		辰戌相冲: '胃[胆,肾,肺,心]',
		丑未相冲: '脾[肾，肺，小肠，胆]',
	}
	if (list[str]) {
		return list[str]
	}
	throw new Error(`无效的参数: ${str}`);
};

// 得到五行生克的元素是什么 参数为（‘木’, '生‘） 得到 '水'  
export const getWuxingShengKeFromEle = (str: string, type: '生' | '克') => {
	if (wuXing[str]) {
		return wuXing[str][type];
	}
	throw new Error(`无效的五行: ${str}`);
};

// 得到五行生克的元素是什么  
export const getWuxingShengKeEle = (str: string, type: '生' | '克') => {
	if (wuXing2[str]) {
		return wuXing2[str][type];
	}
	throw new Error(`无效的五行: ${str}`);
};

export const getInfoByGanZhi = (GanorZhi: string) => {

	let DataColl = GanorZhi + '<br/>'
	DataColl += getBodyByGanZhi(GanorZhi) + `<br>`
	DataColl += getRelaAboutByGanZhi(GanorZhi).join(`<br>`)

	return DataColl;

}




//通过五行得到五行对应的身体部位。  传值为 str五行， 返回 str身体部位  
//甲肝乙胆丙小肠，丁心戊胃己脾乡
//庚金大肠辛金肺，壬是膀胱癸肾藏


export const getBodyByGanZhi = (str: string) => {
	const mean = {
		甲: '肝、头发、神经',
		乙: '胆、颈、毛发、神经、四肢',
		丙: '小肠 、眼睛、肩膀',
		丁: '心 、唇、乳房、眼球',
		戊: '胃、眼下、鼻子、牙齿',
		己: '脾、胰、肌肉、食道、腹、眼',
		庚: '大肠、 骨头',
		辛: '肺、牙齿、咽喉、股骨、胸腔',
		壬: '膀胱、泌尿、血管、',
		癸: '肾、生殖、内分泌、耳朵、大脑、骨髓',
		子: '肾、膀胱',
		丑: '脾胃（表现为消化不好、气虚、乏力)',
		寅: '肝胆 (表现为乏力、食欲不振、肝炎，胆囊炎，肝肿大、牙龈出血)',
		卯: '肝胆 (表现为乏力、食欲不振、肝炎，胆囊炎，肝肿大、牙龈出血)',
		辰: '脾 (表现为消化不好、气虚、乏力)',
		巳: '心血管 (表现为贫血、心脏病、高血压)',
		午: '心血管 (表现为贫血、心脏病、高血压)',
		未: '脾胃 (表现为消化不好、气虚、乏力)',
		申: '肺 (表现为胸闷、气短、咳嗽咳痰)',
		酉: '肺 (表现为胸闷、气短、咳嗽咳痰)',
		戌: '脾 (表现为消化不好、气虚、乏力)',
		亥: '肾 (表现为尿路感染、尿频、生殖问题)'
	}
	return mean[str]
}

// 通过五行得到五行对应的身体部位。  传值为 str五行， 返回 str身体部位 

export const getBodyByWuxing = (item: string | string[], type?: string) => {

	let refitem = ''

	const mean = {
		木: '易疲劳，肝胆等免疫系统较弱，表现为消化不良、易疲劳、肝炎，胆囊炎，肝肿大、牙龈出血等。',
		火: '心脏、血管、血压等循环系统或眼睛、耳朵、小肠偏弱,表现为心悸、低高血压、贫血、消化不良等症状。',
		土: '肠、脾或胃消化系统偏弱，表现为消化不良、食欲不振、腹胀等症状。',
		金: '肺、气管、喉咙等呼吸系统较弱，容易感冒、咳嗽、气短等。',
		水: '泌尿生殖系统会弱，肾功能性能力不强,易口干舌燥嘴唇发干，男性性特征不明显，但性幻想需求十分强烈渴望，女性则欲求不多，经期痛感强。'
	}

	// 五行缺少意味着什么
	const NOmean = {
		木: '易疲劳，性格波动易怒、缺乏耐心。肝胆等免疫系统较弱，表现为脂肪肝,胆囊炎，肝功能弱、牙龈出血等。',
		火: '心脏、血管、血压等循环系统或眼睛、耳朵、小肠偏弱,表现为心悸、低高血压、贫血、消化不良等症状，偶有消极和缺乏积极性。',
		土: '肠、脾或胃消化系统偏弱，表现为消化不良、食欲不振、腹胀等症状。偶有缺乏稳定性和耐心、急躁、不切实际。',
		金: '肺、气管、喉咙等呼吸系统较弱，容易感冒、咳嗽、气短等，在决策上缺乏果断性。',
		水: '泌尿生殖系统会弱，肾功能性能力不强,易口干舌燥嘴唇发干，男性性特征不明显，但性幻想需求十分强烈渴望，女性则欲求不多，经期痛感强。'
	}

	const itemArray = type ? NOmean : mean

	if (Array.isArray(item)) {

		item.forEach(i => refitem += itemArray[i] + ' ')
	}
	else {
		refitem = itemArray[item]
	}

	return refitem

}




//通过八字宫位得到五行对应的身体部位。  传值为 str宫位， 返回 str身体部位  gongweiBodyBaseMap

export const getBodyByGongWei = (str: string) => {

	const mean = {
		YearGan: gongweiBodyBaseMap[0],
		YearZhi: gongweiBodyBaseMap[1],
		MonthGan: gongweiBodyBaseMap[2],
		MonthZhi: gongweiBodyBaseMap[3],
		DayGan: gongweiBodyBaseMap[4],
		DayZhi: gongweiBodyBaseMap[5],
		TimeGan: gongweiBodyBaseMap[5] + '和' + gongweiBodyBaseMap[6],
		TimeZhi: gongweiBodyBaseMap[7],
	}
	return mean[str]
}


export const getWuXingLoveHate = (shenruoshenqiang: string, rizhu: string) => {
	const love = shenruoshenqiang === '身强' ? wuXingXiJi[rizhu].hate : wuXingXiJi[rizhu].love;
	const hate = shenruoshenqiang === '身强' ? wuXingXiJi[rizhu].love : wuXingXiJi[rizhu].hate;

	return {
		love,
		hate,
	};
};


const wuXingXiJi: ObjInterface = {
	木: {
		love: ['木', '水'],
		hate: ['火', '土', '金'],
	},
	火: {
		love: ['木', '火'],
		hate: ['水', '土', '金'],
	},
	土: {
		love: ['土', '火'],
		hate: ['水', '木', '金'],
	},
	金: {
		love: ['金', '土'],
		hate: ['火', '木', '水'],
	},
	水: {
		love: ['金', '水'],
		hate: ['土', '木', '火'],
	}
}

// 定义判断五行关系的方法
//后者与前者的关系，这个有点不同，要注意 
//如果看年干对日干的关系  ， 则日干放前面，年干放后面  
export const getWuXingRelation = (wuXing1: string, wuXing2: string): string => {
	if (!wuXing[wuXing1] || !wuXing[wuXing2]) return '无';
	if (wuXing1 === wuXing2) return '同';
	if (wuXing[wuXing1].生 === wuXing2) return '生';
	if (wuXing[wuXing1].克 === wuXing2) return '克';
	if (wuXing[wuXing2].克 === wuXing1) return '反克';
	if (wuXing[wuXing2].生 === wuXing1) return '反生';
	return '无';
};


// ===== 已提取到 transform/liuyue.ts =====
export { getLiuYueChgInfo } from './transform/liuyue';




//得到八个字 克和生的数量对比 

// export const getShengKeScore = (eightChar: any) => {

//   let eightWuxing: string[] = []
//   eightWuxing = eightWuxing.concat(
//     ...eightChar.getYearWuXing(),
//     ...eightChar.getMonthWuXing(),
//     ...eightChar.getDayWuXing(),
//     ...eightChar.getTimeWuXing(),
//   );

//   // 邻居数据 



//   // 生克等分成4等，根据步数距离来，步数为1，能量100%， 步数为2，能量为75%，步数为3，能量为50，步数为4 25% 
//   // 也就是  100分， 邻克100分  隔克 75分， 隔隔50分  隔隔克 25分  
//   // 克和同是100分，反生和反克都不会死，只会自己降低能量，所以为【50】为基数

//   const findPosition = (number: number): { row: number; col: number } => {
//     // 确定行：偶数在第一排，奇数在第二排
//     const row = number % 2 === 0 ? 0 : 1;
//     // 确定列：使用给定编号除以每排的元素数量（4）
//     const col = Math.floor((number % 8) / 4);

//     return { row, col };
//   }

//   //开始循环 

//   const baseScore = []

//   for (const key in eightWuxing) {

//     const mainKey: number = parseInt(key) as number;
//     const mainPos = findPosition(mainKey)
//     let tmpScore = 0;

//     for (const subkey in eightWuxing) {

//       const mainSubKey: number = parseInt(subkey) as number;
//       const subPos = findPosition(mainSubKey)

//       // 自身不做比较 
//       if (mainSubKey === mainKey) {
//         continue;
//       }

//       //得到步数距离 
//       let steps = Math.abs(subPos.row - mainPos.row) + Math.abs(subPos.col - mainPos.col)
//       let rela = getWuXingRelation(eightWuxing[key], eightWuxing[subkey]);

//       //得到生助加分  如果是月令，则得到3倍的能量。 

//       if (rela === "生" || rela == "同") {
//         tmpScore = tmpScore  + ((125-25*steps)/100)* (mainSubKey===3?300:100)
//       }

//       //得到生助加分  如果是月令，则加分更多。 

//       if (rela === "克" ) {
//         tmpScore = tmpScore  - ((125-25*steps)/100)* (mainSubKey===3?300:100)
//       }

//       if (rela === "反生" || rela == "反克") {
//         tmpScore = tmpScore  - ((125-25*steps)/100)*60
//       }

//     }

//     baseScore.push(tmpScore)

//   }



//   return baseScore

// };

//得到干支的阴阳 

export const GetGanZhiYinYang = (label: string) => {
	let value: string = '';

	value = TIANGAN.yinYangList[TIANGAN.names.indexOf(label)];
	if (!value) {
		value = DIZHI.yinYangList[DIZHI.names.indexOf(label)];
	}

	return value
}

// 得到八字中字符的数量大于等于3次的 
export const getEightChar3Times = (str: string, gz?: string): string[] => {
	const charMap = new Map<string, number>();

	// 遍历字符串，统计每个非空格字符的出现次数
	for (let char of str) {
		if (char.trim() !== '') {
			charMap.set(char, (charMap.get(char) || 0) + 1);
		}
	}

	// 找出出现次数大于等于3的字符
	const charsAppearingThreeOrMoreTimes = [];
	for (let [char, count] of charMap) {
		if (count >= 3) {

			if (gz === 'gan') {
				if (tianganList.includes(char)) {
					charsAppearingThreeOrMoreTimes.push(char);
				}

			}
			else if (gz === 'zhi') {
				if (dizhiList.includes(char)) {
					charsAppearingThreeOrMoreTimes.push(char);
				}

			}
			else {
				charsAppearingThreeOrMoreTimes.push(char);
			}
		}
	}


	return charsAppearingThreeOrMoreTimes;
}

// // 使用示例
// let str = ' 乙酉 戊子 乙巳 壬辰 ';
// let result = findCharsAppearingThreeOrMoreTimes(str);
// console.log(`字符数量大于等于3的有: ${result.join(', ')}`);







//根据身强身弱和日主五行来判断喜好是什么 
// 扶抑：旺则泄之，弱则助之，有扶有抑，到达中和。
// 病药：用神选定，又被克害受伤时，伤用神者即是病，必要病得去除，才可反浊为清，有病有药是上等八字，有病无药，一生难得显贵。
// 调侯：五行中和，气侯不得适中，仍无生机不能奋发，尤其是一些金寒水冷、火旺土燥之命，往往以浊而不清来看，得一调侯用神，使命局寒热适中，五行方可流通生化有情。
// 通关：命局只有两种五行，如木土各半，见火通关，金火均衡，见土通关，当两种五行形成互不相让之势，取中间能流通转化的五行通关，使命局的克战变为生助，化敌为友，生生不息。
// 从格：当五行之力旺极无制或衰极无救时，多以物极必反来论，其中有从强、从旺、从弱、从财、从官等。



export const getConfigAttr = (label: string, type: string) => {

	let value: string = '';

	switch (type) {
		case "color":
			// 优先在 TIANGAN.colorsList 中查找
			value = TIANGAN.colorsList[TIANGAN.names.indexOf(label)];
			// 如果在 TIANGAN.colorsList 中未找到，再到 DIZHI.colorsList 中查找
			if (value === undefined) {
				value = DIZHI.colorsList[DIZHI.names.indexOf(label)];
			}
			// 如果在阴是中查找
			if (value === undefined) {
				value = YINYANG.colorsList[YINYANG.names.indexOf(label)];
			}
			break;


		case "yinyangcolor":
			// 优先在 TIANGAN.colorsList 中查找
			value = TIANGAN.yinYangColor[TIANGAN.names.indexOf(label)];
			// 如果在 TIANGAN.colorsList 中未找到，再到 DIZHI.colorsList 中查找
			if (value === undefined) {
				value = DIZHI.yinYangColor[DIZHI.names.indexOf(label)];
			}
			break;
		case "type":
			// 优先在 TIANGAN.colorsList 中查找所属五行
			value = TIANGAN.typesList[TIANGAN.names.indexOf(label)];
			// 如果在 TIANGAN.colorsList 中未找到，再到 DIZHI.colorsList 中查找
			if (value === undefined) {
				value = DIZHI.typesList[DIZHI.names.indexOf(label)];
			}
			break;
		case "guyinyangtype":
			// 优先在 TIANGAN.colorsList 中查找孤阴阳 金水为阴 木火为阳 
			value = TIANGAN.yinYangList2[TIANGAN.names.indexOf(label)];
			// 如果在 TIANGAN.colorsList 中未找到，再到 DIZHI.colorsList 中查找
			if (value === undefined) {
				value = DIZHI.yinYangList2[DIZHI.names.indexOf(label)];
			}
			break;
		case "guyinyangcolor":
			// 优先在 TIANGAN.colorsList 中查找孤阴阳 金水为阴 木火为阳 
			value = TIANGAN.yinYangList2Color[TIANGAN.names.indexOf(label)];
			// 如果在 TIANGAN.colorsList 中未找到，再到 DIZHI.colorsList 中查找
			if (value === undefined) {
				value = DIZHI.yinYangList2Color[DIZHI.names.indexOf(label)];
			}
			break;
		case "wuxing":
			// 优先在 TIANGAN.colorsList 中查找孤阴阳 金水为阴 木火为阳 
			value = ELEMENT.colors[ELEMENT.labels.indexOf(label)];
			// 如果在 TIANGAN.colorsList 中未找到，再到 DIZHI.colorsList 中查找       
			break;
		case "yinyang":
			value = YINYANG.colorsList[YINYANG.names.indexOf(label)];
			break;

	}

	return value;
}


//得到五行的数量统计 
//输入八字的字符串，字符串长度不限数量
export const countElements = (eightCharStr: string[]): {
	[x: string]: any; 木: number, 火: number, 土: number, 金: number, 水: number
} => {
	// 将八字字符串分割为字符数组
	const dateArray = eightCharStr;


	// 用于存储每个五行属性的数量
	const elementCounts = { 木: 0, 火: 0, 土: 0, 金: 0, 水: 0 };
	// 遍历字符数组
	for (const char of dateArray) {
		// 根据字符判断五行属性并增加对应属性的数量
		switch (char) {
			case '甲':
			case '乙':
			case '寅':
			case '卯':
				elementCounts.木++;
				break;
			case '丙':
			case '丁':
			case '巳':
			case '午':
				elementCounts.火++;
				break;
			case '戊':
			case '己':
			case '辰':
			case '未':
			case '戌':
			case '丑':
				elementCounts.土++;
				break;
			case '庚':
			case '辛':
			case '申':
			case '酉':
				elementCounts.金++;
				break;
			case '壬':
			case '癸':
			case '子':
			case '亥':
				elementCounts.水++;
				break;
		}
	}
	return elementCounts;
}



// 输入八字的字符串，字符串长度不限数量
// 其中天干甲，丙，戊，庚，壬为阳，乙，丁，己，辛，癸为阴，

// 地支子，辰，巳，午，戌，亥，由于地支与藏干阴阳不一致，
// 阴中有阳，阳中有阴，故而属于不阴不阳的两面派（如同太监或人妖),
// 而地支中只有 寅，申           为纯阳（地支与藏干皆为阳），
// 地支       丑，卯，未，酉为阴，藏干也全为阴，故为纯阴。


export const countElementsYinYang = (eightCharStr: string[]): { 阴: number, 阳: number, 杂: number } => {
	// 将八字字符串分割为字符数组
	const dateArray = eightCharStr;
	// 用于存储每个五行属性的数量
	const elementCounts = { 阴: 0, 阳: 0, 杂: 0 };
	// 遍历字符数组
	for (const char of dateArray) {
		// 根据字符判断五行属性并增加对应属性的数量
		switch (char) {
			//甲、丙、戊、庚、壬 ---  子、寅、辰、午、申、戌为阳，
			case '甲':
			case '丙':
			case '戊':
			case '庚':
			case '壬':
			case '寅':
			case '申':
				elementCounts.阳++;
				break;
			//乙、丁、己、辛、辛 癸  -- 丑  卯、巳、未、酉、亥为阴
			case '乙':
			case '丁':
			case '己':
			case '辛':
			case '癸':
			case '丑':
			case '卯':
			case '未':
			case '酉':
				elementCounts.阴++;
				break;
			case '子':
				elementCounts.阳++;
				elementCounts.杂++;
				break;
			case '辰':
				elementCounts.阳++;
				elementCounts.杂++;
				break;
			case '巳':
				elementCounts.阴++;
				elementCounts.杂++;
				break;
			case '午':
				elementCounts.阳++;
				elementCounts.杂++;
				break;
			case '戌':
				elementCounts.阳++;
				elementCounts.杂++;
				break;
			case '亥':
				elementCounts.阴++;
				elementCounts.杂++;
				break;
		}
	}
	return elementCounts;
}


//输入八字的字符串，字符串长度不限数量
// 木火为阳，金水为阴，燥土为阳，湿土为阴 
// 甲乙寅卯木、丙丁巳午火、戊戌未土为阳
// 庚辛申酉金、壬癸亥子水、己辰丑土为阴
export const countElementsYinYang2 = (eightCharStr: string[]): { 金水: number, 木火: number } => {
	// 将八字字符串分割为字符数组
	const dateArray = eightCharStr;
	// 用于存储每个五行属性的数量
	const elementCounts = { 金水: 0, 木火: 0 };
	// 遍历字符数组
	for (const char of dateArray) {
		// 根据字符判断五行属性并增加对应属性的数量
		switch (char) {
			//甲、乙：属木； 丙、丁：属火；   
			//  寅、卯：属木；巳、午：属火；辰、戌、丑、未：属土
			//  甲乙寅卯木、丙丁巳午火、戊戌未土为阳
			case '甲':
			case '乙':
			case '丙':
			case '丁':
			case '寅':
			case '卯':
			case '巳':
			case '午':
			case '戊':
			case '戌':
			case '未':
				elementCounts.木火++;
				break;
			// 庚、辛：属金； 壬、癸：属水。，申、酉：属金；亥、子：属水；
			//  庚辛申酉金、壬癸亥子水、己辰丑土为阴
			case '庚':
			case '辛':
			case '壬':
			case '癸':
			case '申':
			case '酉':
			case '亥':
			case '子':
			case '己':
			case '辰':
			case '丑':
				elementCounts.金水++;
				break;
		}
	}
	return elementCounts;
}

//判断后面是前面的什么关系 ，如以日干的关系， 则 第一个参数为日干。 

export const getWuxingShiShen = (wuxing: string, wuxing2: string) => {

	let result: string;

	switch (getWuXingRelation(wuxing, wuxing2)) {
		case '生':
			result = '印枭'
			break;
		case '克':
			result = '官杀'
			break;
		case '同':
			result = '比劫'
			break;
		case '反克':
			result = '财才'
			break;
		case '反生':
			result = '食伤'
			break;
		default:
			result = ''
			break;
	}


	return result;

}


//得出十神的数量来 
export const getShiShenSum = (shiShenArr: string[]) => {
	const baseShiShen: ObjInterface = { 正官: 0, 七杀: 0, 正印: 0, 偏印: 0, 正财: 0, 偏财: 0, 比肩: 0, 劫财: 0, 食神: 0, 伤官: 0 };
	for (let i = 0; i < shiShenArr.length; i++) {
		const shiShen = shiShenArr[i];
		if (baseShiShen[shiShen]) {
			baseShiShen[shiShen]++;
		} else {
			baseShiShen[shiShen] = 1;
		}
	}
	return baseShiShen;
}
//得出十神的数量来 
export const getShiShen = (shiShenArr: string[]) => {
	const baseShiShen: ObjInterface = { 正官: 0, 七杀: 0, 正印: 0, 偏印: 0, 正财: 0, 偏财: 0, 比肩: 0, 劫财: 0, 食神: 0, 伤官: 0 };
	for (let i = 0; i < shiShenArr.length; i++) {
		const shiShen = shiShenArr[i];
		if (baseShiShen[shiShen]) {
			baseShiShen[shiShen]++;
		} else {
			baseShiShen[shiShen] = 1;
		}
	}
	return baseShiShen;
}


//得到五行的统计信息  
export const getEightSumInfo = (eightChar: any) => {

	const eightCharinfo = getEightInfoArary(eightChar)



	return {
		baseinfo: eightCharinfo,
		WuXingSum: countElements(eightCharinfo.eightChar),
		WuXingSumBase: ComputedWuXing(eightChar).wuxingNumObj,
		wuxingIncludeHideSum: countElements(eightCharinfo.eightCharHideArrayNoZhi),
		YinYangSum: countElementsYinYang(eightCharinfo.eightChar),
		YinYangIncludeHideSum: countElementsYinYang(eightCharinfo.eightCharHide),
		YinYangSum2: countElementsYinYang2(eightCharinfo.eightChar),
		YinYangIncludeHideSum2: countElementsYinYang2(eightCharinfo.eightCharHide),
		ShiShenSum: getShiShenSum(eightCharinfo.shiShenArray),
		ShiShenSumBase: ComputedShiShen(eightChar).ShiShen,
		ShiShenWuXingList: ComputedShiShen(eightChar).ShiShenWuXing,
		ShiShenEleList: ComputedShiShen(eightChar).ShiShenEleList
	};

}

//得到八字的基本数组 









//参数是对象，包含了各种方法 

export const getEightInfoArary = (eightChar: any) => {
	//得到不包含或者包含藏干的八字 
	let eightCharHideArray: string[] = [];
	let eightCharHideArrayNoZhi: string[] = [];

	eightCharHideArray = eightCharHideArray.concat(
		eightChar.getYearGan(), eightChar.getYearZhi(), eightChar.getYearHideGan(),
		eightChar.getMonthGan(), eightChar.getMonthZhi(), eightChar.getMonthHideGan(),
		eightChar.getDayGan(), eightChar.getDayZhi(), eightChar.getDayHideGan(),
		eightChar.getTimeGan(), eightChar.getTimeZhi(), eightChar.getTimeHideGan(),
	);
	//计算八字五行的时候，隐藏的支和本命地支是重复的，去掉一个计算的五行才是对的。
	eightCharHideArrayNoZhi = eightCharHideArrayNoZhi.concat(
		eightChar.getYearGan(), eightChar.getYearHideGan(),
		eightChar.getMonthGan(), eightChar.getMonthHideGan(),
		eightChar.getDayGan(), eightChar.getDayHideGan(),
		eightChar.getTimeGan(), eightChar.getTimeHideGan(),
	);
	//得到包含藏干的十神
	let shiShenArray: string[] = [];
	shiShenArray = shiShenArray.concat(eightChar.getYearShiShenGan(), eightChar.getYearShiShenZhi(),
		eightChar.getMonthShiShenGan(), eightChar.getMonthShiShenZhi(), eightChar.getDayShiShenZhi(),
		eightChar.getTimeShiShenGan(), eightChar.getTimeShiShenZhi());
	return {
		eightChar: eightChar.toString().split('').filter((item: string) => item !== ' '),
		eightCharHide: eightCharHideArray,
		eightCharHideArrayNoZhi: eightCharHideArrayNoZhi,
		shiShenArray: shiShenArray,
	};
}

//判断某个天干是否有根   ---有根气通常是指如果日主的天干 五行元素在地支中出现，那么就可以认为日主有根。
//一个人的八字有没有根，就是看地支有没有“比肩”，戊己土不找比肩，要找偏印，而且需为主气，余气不算。善友还可以对照自己的八字：
export const getifExistGen = (eightChar: any, gan: string): boolean => {
	let GenMontherArray: string[] = [];
	let arr = []
	let result: boolean = false;
	GenMontherArray = GenMontherArray.concat(
		eightChar.getYearZhi(),
		eightChar.getMonthZhi(),
		eightChar.getDayZhi(),
		eightChar.getTimeZhi());

	if (gan === '甲' || gan === '乙') {
		arr = ['寅', '卯', '辰', '未', '亥'];
		result = arr.some((item) => GenMontherArray.includes(item));
	}

	if (gan === '丙' || gan === '丁') {
		arr = ['寅', '巳', '午', '未', '戌'];
		result = arr.some((item) => GenMontherArray.includes(item));
	}

	if (gan === '戊' || gan === '己') {
		arr = ['丑', '寅', '辰', '巳', '午', '未', '申', '戌'];
		result = arr.some((item) => GenMontherArray.includes(item));
	}
	if (gan === '庚' || gan === '辛') {
		arr = ['丑', '巳', '申', '酉', '戌'];
		result = arr.some((item) => GenMontherArray.includes(item));
	}

	if (gan === '壬' || gan === '癸') {
		arr = ['子', '丑', '辰', '申', '亥'];
		result = arr.some((item) => GenMontherArray.includes(item));
	}

	return result;
}

// 判断某个地支是不是天干的根  自坐根

export const getifExistSelfGen = (gan: string, zhi: string): boolean => {

	let arr = []
	let result: boolean = false;

	if (gan === '甲' || gan === '乙') {
		arr = ['寅', '卯', '辰', '未', '亥'];
		result = arr.includes(zhi)
	}

	if (gan === '丙' || gan === '丁') {
		arr = ['寅', '巳', '午', '未', '戌'];
		result = arr.includes(zhi)
	}

	if (gan === '戊' || gan === '己') {
		arr = ['丑', '寅', '辰', '巳', '午', '未', '申', '戌'];
		result = arr.includes(zhi)
	}
	if (gan === '庚' || gan === '辛') {
		arr = ['丑', '巳', '申', '酉', '戌'];
		result = arr.includes(zhi)
	}

	if (gan === '壬' || gan === '癸') {
		arr = ['子', '丑', '辰', '申', '亥'];
		result = arr.includes(zhi)
	}

	return result;
}




//得到五行的生囚休死，参数传入月支就可以 
export const getwxrela = (str: string) => {
	let wxguanxi: ObjInterface = {
		'寅卯': ['木旺', '火相', '水休', '金囚', '土死'],
		'巳午': ['火旺', '土相', '木休', '水囚', '金死'],
		'申酉': ['金旺', '水相', '土休', '火囚', '木死'],
		'亥子': ['水旺', '木相', '金休', '土囚', '火死'],
		'辰戌丑未': ['土旺', '金相', '火休', '木囚', '水死']
	};
	// var monthZhi = bazi.getMonthZhi();
	var monthZhi = str
	var wx = [];
	for (var i in wxguanxi) {
		if (i.indexOf(monthZhi) > -1) {
			wx = wxguanxi[i];
			break;
		}
	}

	return wx;
}
//得到婚配关系 
export const getHunPei = (bazi: any) => {
	var hunpei: ObjInterface = {
		'子': '【宜】 (子丑合 申子辰合)  【忌】 (子午冲 子卯刑 子未害 子酉破)',
		'丑': '【宜】 (子丑合 巳酉丑合) 【忌】 (丑未冲 丑戌未刑 丑午害 辰丑破)',
		'寅': '【宜】 (寅亥合<破> 寅午戌合)  【忌】 (寅申冲 寅巳申刑 寅巳害)',
		'卯': '【宜】 (卯戌合 亥卯未合)  【忌】 (卯酉冲 子卯刑 卯辰害 卯午破)',
		'辰': '【宜】 (辰酉合 申子辰合)  【忌】 (辰戌冲 辰辰刑 卯辰害 辰丑破)',
		'巳': '【宜】 (巳申合 巳酉丑合)  【忌】 (巳亥冲 寅巳申刑 寅巳害 巳申破)',
		'午': '【宜】 (午未合 寅午戌合)  【忌】 (子午冲 午午刑 丑午害 卯午破)',
		'未': '【宜】 (午未合 亥卯未合)  【忌】 (丑未冲 丑戌未刑 子未害 未戌破)',
		'申': '【宜】 (巳申合<破> 申子辰合)  【忌】(寅申冲 寅巳申刑 申亥害)',
		'酉': '【宜】 (辰酉合 巳酉丑合) 【忌】 (卯酉冲 酉酉刑 酉戌害 子酉破)',
		'戌': '【宜】 (卯戌合 寅午戌合)  【忌】 (辰戌冲 丑戌未刑 酉戌害 未戌破)',
		'亥': '【宜】 (寅亥合<破> 亥卯未合)  【忌】 (巳亥冲 亥亥刑 申亥害)'
	};
	var yearZhi = bazi.getYearZhi();
	var hp = '';
	for (var i in hunpei) {
		if (i.indexOf(yearZhi) > -1) {
			hp = hunpei[i];
			break;
		}
	}
	return hp;
}

//得到坐宫值 



export const getChangSheng = (gan: string | number, ganIndex: number, zhiIndex: number) => {
	let offset = CHANG_SHENG_OFFSET[gan];
	let index = offset + (ganIndex % 2 == 0 ? zhiIndex : -zhiIndex);
	if (index >= 12) {
		index -= 12;
	}
	if (index < 0) {
		index += 12;
	}
	//  return  index ; 
	return CHANG_SHENG[index];
}

//通过传递干与支得到十二长生 

export const getChangShengByGanZhi = (gan: string, zhi: string) => {

	let ganIndex = 0;
	let zhiIndex = 0;
	for (let i = 0, j = LunarUtil.GAN.length; i < j; i++) {
		if (gan === LunarUtil.GAN[i]) {
			ganIndex = i - 1;
			break;
		}
	}
	for (let i = 0, j = LunarUtil.ZHI.length; i < j; i++) {
		if (zhi === LunarUtil.ZHI[i]) {
			zhiIndex = i - 1;
			break;
		}
	}

	let offset = CHANG_SHENG_OFFSET[gan];
	let index = offset + (ganIndex % 2 == 0 ? zhiIndex : -zhiIndex);
	if (index >= 12) {
		index -= 12;
	}
	if (index < 0) {
		index += 12;
	}

	return CHANG_SHENG[index];
}



// if (dayunGanzhi != "童限") {
//   let ganIndex = 0;
//   let zhiIndex = 0;
//   for (let i = 0, j = LunarUtil.GAN.length; i < j; i++) {
//     if (dayunGanzhi[0] === LunarUtil.GAN[i]) {
//       ganIndex = i - 1;
//       break;
//     }
//   }
//   for (let i = 0, j = LunarUtil.ZHI.length; i < j; i++) {
//     if (dayunGanzhi[1] === LunarUtil.ZHI[i]) {
//       zhiIndex = i - 1;
//       break;
//     }
//   }
//   dayunZizuo = GetChangSheng(dayunGanzhi[0], ganIndex, zhiIndex);
// }


//得到三垣 yuan 
export const getSanYuan = (bazi: any) => {
	return '胎元 ' + bazi.getTaiYuan() + '(' + bazi.getTaiYuanNaYin() + ')' + '；命宫 ' + bazi.getMingGong() + '(' + bazi.getMingGongNaYin() + ')' + '；身宫 ' + bazi.getShenGong() + '(' + bazi.getShenGongNaYin() + ')';
}

//得到当年太岁关系  

//得到当年太岁关系
//太岁就是八字中的年支与当年的年支的关系  
export const getTaiSuiByNianZhi = (bazinianzhi: any, yearZhi: string) => {
	const tsguanxi: ObjInterface = {
		'子子': '值太岁',
		'丑丑': '值太岁',
		'寅寅': '值太岁',
		'卯卯': '值太岁',
		'巳巳': '值太岁',
		'未未': '值太岁',
		'申申': '值太岁',
		'戌戌': '值太岁',
		'子卯': '刑太岁',
		'丑戌': '刑太岁(丑戌未三刑)',
		'辰辰': '刑太岁(值)',
		'午午': '刑太岁(值)',
		'酉酉': '刑太岁(值)',
		'亥亥': '刑太岁(值)',
		'子午': '冲太岁',
		'卯酉': '冲太岁',
		'寅申': '冲太岁(寅巳申三刑)',
		'巳亥': '冲太岁',
		'辰戌': '冲太岁',
		'丑未': '冲太岁(丑戌未三刑)',
		'子未': '害太岁',
		'丑午': '害太岁',
		'寅巳': '害太岁(寅巳申三刑)',
		'卯辰': '害太岁',
		'申亥': '害太岁',
		'酉戌': '害太岁',
		'子酉': '破太岁',
		'卯午': '破太岁',
		'辰丑': '破太岁',
		'寅亥': '破太岁',
		'巳申': '破太岁(寅巳申三刑)',
		'未戌': '破太岁(丑戌未三刑)'
	};
	let zhis = [];
	zhis.push(bazinianzhi);
	zhis.push(yearZhi);

	var matched = [];
	var gxs: any = {};
	var size = zhis.length;
	for (var i = 0; i < size; i++) {
		for (var j = 0; j < size; j++) {
			if (i === j) {
				continue;
			}
			var v = tsguanxi[zhis[i] + zhis[j]];
			if (v) {
				gxs[v] = true;


			}
		}
	}



	for (let i in gxs) {
		matched.push(i);
	}


	return matched;
}
//得到当年的太岁 
export const getTaiSui = (bazi: any, todaybazi: any) => {
	const tsguanxi: ObjInterface = {
		'子子': '值太岁',
		'丑丑': '值太岁',
		'寅寅': '值太岁',
		'卯卯': '值太岁',
		'巳巳': '值太岁',
		'未未': '值太岁',
		'申申': '值太岁',
		'戌戌': '值太岁',
		'子卯': '刑太岁',
		'丑戌': '刑太岁(丑戌未三刑)',
		'辰辰': '刑太岁(值)',
		'午午': '刑太岁(值)',
		'酉酉': '刑太岁(值)',
		'亥亥': '刑太岁(值)',
		'子午': '冲太岁',
		'卯酉': '冲太岁',
		'寅申': '冲太岁(寅巳申三刑)',
		'巳亥': '冲太岁',
		'辰戌': '冲太岁',
		'丑未': '冲太岁(丑戌未三刑)',
		'子未': '害太岁',
		'丑午': '害太岁',
		'寅巳': '害太岁(寅巳申三刑)',
		'卯辰': '害太岁',
		'申亥': '害太岁',
		'酉戌': '害太岁',
		'子酉': '破太岁',
		'卯午': '破太岁',
		'辰丑': '破太岁',
		'寅亥': '破太岁',
		'巳申': '破太岁(寅巳申三刑)',
		'未戌': '破太岁(丑戌未三刑)'
	};
	let zhis = [];
	zhis.push(bazi.getYearZhi());
	zhis.push(todaybazi.getYearZhi());

	var matched = [];
	var gxs: any = {};
	var size = zhis.length;
	for (var i = 0; i < size; i++) {
		for (var j = 0; j < size; j++) {
			if (i === j) {
				continue;
			}
			var v = tsguanxi[zhis[i] + zhis[j]];
			if (v) {
				gxs[v] = true;
			}
		}
	}
	for (let i in gxs) {
		matched.push(i);
	}
	return matched;
}

//得到地支中的关系 
export const getDiZhiRela = (bazi: any, currentYun?: any, anyZhi?: any) => {
	var dzguanxi: ObjInterface = {
		'亥子丑': '亥子丑三会水',
		'寅卯辰': '寅卯辰三会木',
		'巳午未': '巳午未三会火',
		'申酉戌': '申酉戌三会金',
		'申子辰': '申子辰三合水',
		'寅午戌': '寅午戌三合火',
		'亥卯未': '亥卯未三合木',
		'巳酉丑': '巳酉丑三合金',
		'申辰': '申辰拱合子水',
		'寅戌': '寅戌拱合午火',
		'亥未': '亥未拱合卯木',
		'巳丑': '巳丑拱合酉金',
		'申子': '申子半合水',
		'子辰': '子辰半合水',
		'午戌': '午戌半合火',
		'亥卯': '亥卯半合木',
		'卯未': '卯未半合木',
		'酉丑': '酉丑半合金',
		//              寅丑暗合、卯申暗合、午亥暗合、 寅未暗合、   子戌暗合。
		// 暗合的地支有：子巳暗合、寅午暗合、巳酉暗合、卯申暗合、亥午暗合
		'寅午': '寅午暗合土|半合火',
		'巳酉': '巳酉暗合水|半合金',
		'子巳': '子巳相绝暗合火',
		'卯申': '卯申相绝暗合金',
		'亥午': '亥午暗合木',
		'寅丑': '寅丑暗合',
		'寅未': '寅未暗合',
		'巳申': '巳申相破|六合水',
		'辰酉': '辰酉六合金',
		'卯戌': '卯戌六合火',
		'寅亥': '寅亥相破|六合木',
		'子丑': '子丑六合土',
		'午未': '午未六合火或土',
		'子卯': '子卯无礼相刑',
		'丑未戌': '丑未戌恃势三刑',
		'寅巳申': '寅巳申无恩三刑',
		'辰辰': '辰辰自刑',
		'午午': '午午自刑',
		'酉酉': '酉酉自刑',
		'亥亥': '亥亥自刑',
		'辰辰辰': '辰辰自刑',
		'午午午': '午午自刑',
		'酉酉酉': '酉酉自刑',
		'亥亥亥': '亥亥自刑',
		'辰辰辰辰': '辰辰自刑',
		'午午午午': '午午自刑',
		'酉酉酉酉': '酉酉自刑',
		'亥亥亥亥': '亥亥自刑',
		'辰辰辰辰辰': '辰辰自刑',
		'午午午午午': '午午自刑',
		'酉酉酉酉酉': '酉酉自刑',
		'亥亥亥亥亥': '亥亥自刑',
		'辰辰辰辰辰辰': '辰辰自刑',
		'午午午午午午': '午午自刑',
		'酉酉酉酉酉酉': '酉酉自刑',
		'亥亥亥亥亥亥': '亥亥自刑',
		'子午': '子午相冲',
		'卯酉': '卯酉相冲',
		'寅申': '寅申相冲',
		'巳亥': '巳亥相冲',
		'辰戌': '辰戌相冲',
		'丑未': '丑未相冲',
		'子未': '子未相害',
		'丑午': '丑午相害',
		'寅巳': '寅巳相害',
		'卯辰': '卯辰相害',
		'申亥': '申亥相害',
		'酉戌': '酉戌相害',
		'子酉': '子酉相破',
		'卯午': '卯午相破',
		'辰丑': '辰丑相破',
		'未戌': '未戌相破',
		'寅酉': '寅酉相绝',
		'午亥': '午亥相绝',
	};
	var zhis: any = {};
	zhis[bazi.getYearZhi()] = zhis[bazi.getYearZhi()] ? zhis[bazi.getYearZhi()] + 1 : 1;
	zhis[bazi.getMonthZhi()] = zhis[bazi.getMonthZhi()] ? zhis[bazi.getMonthZhi()] + 1 : 1;
	zhis[bazi.getDayZhi()] = zhis[bazi.getDayZhi()] ? zhis[bazi.getDayZhi()] + 1 : 1;
	zhis[bazi.getTimeZhi()] = zhis[bazi.getTimeZhi()] ? zhis[bazi.getTimeZhi()] + 1 : 1;

	if (currentYun) {
		if (currentYun.daYunZhi) {
			zhis[currentYun.daYunZhi] = zhis[currentYun.daYunZhi] ? zhis[currentYun.daYunZhi] + 1 : 1;
		}
		if (currentYun.liuNianZhi) {
			zhis[currentYun.liuNianZhi] = zhis[currentYun.liuNianZhi] ? zhis[currentYun.liuNianZhi] + 1 : 1;
		}
		if (currentYun.liuYueZhi) {
			zhis[currentYun.liuYueZhi] = zhis[currentYun.liuYueZhi] ? zhis[currentYun.liuYueZhi] + 1 : 1;
		}
		if (currentYun.liuRiZhi) {
			zhis[currentYun.liuRiZhi] = zhis[currentYun.liuRiZhi] ? zhis[currentYun.liuRiZhi] + 1 : 1;
		}
		if (currentYun.liuShiZhi) {
			zhis[currentYun.liuShiZhi] = zhis[currentYun.liuShiZhi] ? zhis[currentYun.liuShiZhi] + 1 : 1;
		}
	}

	if (anyZhi) {
		zhis[anyZhi] = zhis[anyZhi] ? zhis[anyZhi] + 1 : 1;
	}




	var matched = [];
	var gxs: any = {};
	for (var i in zhis) {
		for (var j in zhis) {
			for (var k in zhis) {
				if (i == j || j == k || i == k) {
					continue;
				}
				var v = dzguanxi[i + j];
				if (v) {
					gxs[v] = true;
				}
				v = dzguanxi[i + j + k];
				if (v) {
					gxs[v] = true;
				}
			}
		}
	}
	for (var i in zhis) {
		var n = zhis[i];
		var vs = [];
		for (let j = 0; j < n; j++) {
			vs.push(i);
		}
		var v = dzguanxi[vs.join('')];
		if (v) {
			gxs[v] = true;
		}
	}

	var matchIndex = 0;
	for (var i in gxs) {
		matched.push(i);
		matchIndex++;
		//  if(matchIndex%4==0){
		//      matched.push('');
		//  }
	}

	return matched;

}

// 得到地支关系 - 字符串列表版本 
export const getDiZhiRelaStr = (zhiList: string[]) => {
	var dzguanxi: ObjInterface = {
		'亥子丑': '亥子丑三会水',
		'寅卯辰': '寅卯辰三会木',
		'巳午未': '巳午未三会火',
		'申酉戌': '申酉戌三会金',
		'申子辰': '申子辰三合水',
		'寅午戌': '寅午戌三合火',
		'亥卯未': '亥卯未三合木',
		'巳酉丑': '巳酉丑三合金',
		'申辰': '申辰拱合子水',
		'寅戌': '寅戌拱合午火',
		'亥未': '亥未拱合卯木',
		'巳丑': '巳丑拱合酉金',
		'申子': '申子半合水',
		'子辰': '子辰半合水',
		'午戌': '午戌半合火',
		'亥卯': '亥卯半合木',
		'卯未': '卯未半合木',
		'酉丑': '酉丑半合金',
		'寅午': '寅午暗合土|半合火',
		'巳酉': '巳酉暗合水|半合金',
		'子巳': '子巳相绝暗合火',
		'卯申': '卯申相绝暗合金',
		'亥午': '亥午暗合木',
		'寅丑': '寅丑暗合',
		'寅未': '寅未暗合',
		'巳申': '巳申相破|六合水',
		'辰酉': '辰酉六合金',
		'卯戌': '卯戌六合火',
		'寅亥': '寅亥相破|六合木',
		'子丑': '子丑六合土',
		'午未': '午未六合火或土',
		'子卯': '子卯无礼相刑',
		'丑未戌': '丑未戌恃势三刑',
		'寅巳申': '寅巳申无恩三刑',
		'辰辰': '辰辰自刑',
		'午午': '午午自刑',
		'酉酉': '酉酉自刑',
		'亥亥': '亥亥自刑',
		'子午': '子午相冲',
		'卯酉': '卯酉相冲',
		'寅申': '寅申相冲',
		'巳亥': '巳亥相冲',
		'辰戌': '辰戌相冲',
		'丑未': '丑未相冲',
		'子未': '子未相害',
		'丑午': '丑午相害',
		'寅巳': '寅巳相害',
		'卯辰': '卯辰相害',
		'申亥': '申亥相害',
		'酉戌': '酉戌相害',
		'子酉': '子酉相破',
		'卯午': '卯午相破',
		'辰丑': '辰丑相破',
		'未戌': '未戌相破',
		'寅酉': '寅酉相绝',
		'午亥': '午亥相绝',
	};

	var zhis: any = {};
	zhiList.forEach(zhi => {
		if (zhi) zhis[zhi] = (zhis[zhi] || 0) + 1;
	});

	var matched = [];
	var gxs: any = {};

	// 处理 2-3 个地支的组合关系
	var keys = Object.keys(zhis);
	for (var i = 0; i < keys.length; i++) {
		for (var j = 0; j < keys.length; j++) {
			// 两支关系
			if (i !== j) {
				var v2 = dzguanxi[keys[i] + keys[j]];
				if (v2) gxs[v2] = true;
			}
			for (var k = 0; k < keys.length; k++) {
				// 三支关系
				if (i !== j && j !== k && i !== k) {
					var v3 = dzguanxi[keys[i] + keys[j] + keys[k]];
					if (v3) gxs[v3] = true;
				}
			}
		}
	}

	// 处理自刑（相同地支）
	for (var z in zhis) {
		if (zhis[z] >= 2) {
			var vself = dzguanxi[z + z];
			if (vself) gxs[vself] = true;
		}
	}

	for (var gx in gxs) {
		matched.push(gx);
	}
	return matched;
}


//得到五行中的天干相合相克关系 
//输入值为 ['甲','庚']
export const getTianGanRela = (str: string[]) => {
	const tgguanxi: ObjInterface = {
		'甲己': '甲己合土',
		'乙庚': '乙庚合金',
		'丙辛': '丙辛合水',
		'丁壬': '丁壬合木',
		'戊癸': '戊癸合火',
		'甲庚': '甲庚相冲',
		'乙辛': '乙辛相冲',
		'丙壬': '丙壬相冲',
		'丁癸': '丁癸相冲'
	};

	let matched = [];
	let gxs: any = {};
	let size = str.length;

	for (let i = 0; i < size; i++) {
		for (let j = 0; j < size; j++) {
			if (i === j) {
				continue;
			}
			let v = tgguanxi[str[i] + str[j]];
			if (v) {
				gxs[v] = true;
			}
		}
	}
	for (var i in gxs) {
		matched.push(i);
	}
	//返回数组
	return matched;

}

//随便给一个天干，得到天干的十神 
export const getShiShenByGan = (dayGan: string, gan: string) => {
	return LunarUtil.SHI_SHEN[dayGan + gan]
}

//随便给一个地支，返回地支隐藏的十神的数组，第一个可以用数组来表示
export const getShiShenByZhi = (dayGan: string, zhi: string) => {
	let dHideGan: string[] = LunarUtil.ZHI_HIDE_GAN[zhi];
	let dShiShenZhi = [];
	if (dHideGan) {
		let size = dHideGan.length;
		for (var x = 0, y = size; x < y; x++) {
			dShiShenZhi.push(LunarUtil.SHI_SHEN[dayGan + dHideGan[x]]);
		}
	}
	return dShiShenZhi;
}

//随便给一个天干或地支，得到天干或地支十神 
export const getShiShenByGanOrZhi = (dayGan: string, Els: string) => {
	if (LunarUtil.GAN.includes(Els)) {
		return [LunarUtil.SHI_SHEN[dayGan + Els]]
	}

	if (LunarUtil.ZHI.includes(Els)) {
		return getShiShenByZhi(dayGan, Els)
	}
}



// 转换简写十神
export const getShiShenJianCheng = (str: string): string => {
	const map: any = {
		正印: "印",
		正官: "官",
		劫财: "劫",
		伤官: "伤",
		正财: "财",
		七杀: "杀",
		偏印: "枭",
		比肩: "比",
		食神: "食",
		偏财: "才",
	};
	return map[str];
};


//得到天干地支的五行

export const getWuXing = (label: string) => {
	let el = undefined;
	if (LunarUtil.GAN.includes(label)) {
		el = LunarUtil.WU_XING_GAN[label]
	} else if (LunarUtil.ZHI.includes(label)) {
		el = LunarUtil.WU_XING_ZHI[label]
	} else if (ELEMENT.labels.includes(label)) {
		el = label;
	}
	return el
}


//得到干与支的五行， 传递 2个字符 ， 反回两个字符的五行

export const getWuxingByGanZhi = (str: string): string => {
	const Wuxing = LunarUtil.WU_XING_GAN[str.charAt(0)] + LunarUtil.WU_XING_ZHI[str.charAt(1)];
	return Wuxing ? Wuxing : '无';
};

//得到干或支的五行，传递 1个字符 ， 反回五行

//得到干或支的五行，传递 1个字符 ， 反回五行
export const getWuxing = (str: string): string => {
	// 优先从内部定义的 TIANGAN/DIZHI 表中获取，确保逻辑 100% 准确
	const tIndex = TIANGAN.names.indexOf(str);
	if (tIndex !== -1) return TIANGAN.typesList[tIndex];

	const dIndex = DIZHI.names.indexOf(str);
	if (dIndex !== -1) return DIZHI.typesList[dIndex];

	// 备用兜底逻辑
	const Wuxing = LunarUtil.WU_XING_GAN[str] ? LunarUtil.WU_XING_GAN[str] : LunarUtil.WU_XING_ZHI[str];
	return Wuxing ? Wuxing : '无';
};



//得到干支的五行关系以及属性 

export const getMapAttr = (label: string, type = "type") => {
	let el = "水";
	if (LunarUtil.GAN.includes(label)) {
		el = LunarUtil.WU_XING_GAN[label]
	} else if (LunarUtil.ZHI.includes(label)) {
		el = LunarUtil.WU_XING_ZHI[label]
	} else if (ELEMENT.labels.includes(label)) {
		el = label;
	}

	const getElIndex = (el: any) => {
		return ELEMENT.labels.indexOf(el)
	}
	const describeForNameMap: any = {
		label: (el: any) => {
			return el
		},
		color: (el: any) => {
			const index = getElIndex(el)
			return ELEMENT.colors[index]
		},
		type: (el: any) => {
			const index = getElIndex(el)
			return ELEMENT.types[index]
		},
		index: (el: any) => {
			return getElIndex(el)
		}
	}

	return describeForNameMap[type] ? describeForNameMap[type](el) : el;
}

export const timeFormat = (timestamp: number | string | Date, format = "yyyy-mm-dd hh:MM", compat = false) => {
	const date = new Date(timestamp)
	const year = date.getFullYear();
	const month = String(date.getMonth() + 1).padStart(2, '0');
	const day = String(date.getDate()).padStart(2, '0');
	const hours = String(date.getHours()).padStart(2, '0');
	const minutes = String(date.getMinutes()).padStart(2, '0');
	const seconds = String(date.getSeconds()).padStart(2, '0');
	return `${year}-${month}-${day} ${hours}:${minutes}:${seconds}`;
}

export const deleteFirstElement = (list: any) => {
	const newArr = list.slice();
	newArr.shift();
	return newArr;
}

export function firstStringToUpperCase(str: string) {
	return str[0].toUpperCase() + str.charAt(1);
}

//得到一个八字的地支中的正财和偏财是什么
export function getShiShenXing(str: string, type: string) {
	const wuxinglist: ObjInterface =
	{
		"甲": { "比肩": "木", "劫财": "木", "食神": "火", "伤官": "火", "偏财": "土", "正财": "土", "七杀": "金", "正官": "金", "偏印": "水", "正印": "水" },
		"乙": { "比肩": "木", "劫财": "木", "食神": "火", "伤官": "火", "偏财": "土", "正财": "土", "七杀": "金", "正官": "金", "偏印": "水", "正印": "水" },
		"丙": { "比肩": "火", "劫财": "火", "食神": "土", "伤官": "土", "偏财": "金", "正财": "金", "七杀": "水", "正官": "水", "偏印": "木", "正印": "木" },
		"丁": { "比肩": "火", "劫财": "火", "食神": "土", "伤官": "土", "偏财": "金", "正财": "金", "七杀": "水", "正官": "水", "偏印": "木", "正印": "木" },
		"戊": { "比肩": "土", "劫财": "土", "食神": "金", "伤官": "金", "偏财": "水", "正财": "水", "七杀": "木", "正官": "木", "偏印": "火", "正印": "火" },
		"己": { "比肩": "土", "劫财": "土", "食神": "金", "伤官": "金", "偏财": "水", "正财": "水", "七杀": "木", "正官": "木", "偏印": "火", "正印": "火" },
		"庚": { "比肩": "金", "劫财": "金", "食神": "水", "伤官": "水", "偏财": "木", "正财": "木", "七杀": "火", "正官": "火", "偏印": "土", "正印": "土" },
		"辛": { "比肩": "金", "劫财": "金", "食神": "水", "伤官": "水", "偏财": "木", "正财": "木", "七杀": "火", "正官": "火", "偏印": "土", "正印": "土" },
		"壬": { "比肩": "水", "劫财": "水", "食神": "木", "伤官": "木", "偏财": "火", "正财": "火", "七杀": "土", "正官": "土", "偏印": "金", "正印": "金" },
		"癸": { "比肩": "水", "劫财": "水", "食神": "木", "伤官": "木", "偏财": "火", "正财": "火", "七杀": "土", "正官": "土", "偏印": "金", "正印": "金" }
	};




	const eleMap: ObjInterface = {
		"甲": { "比肩": "甲", "劫财": "乙", "食神": "丙", "伤官": "丁", "偏财": "戊", "正财": "己", "七杀": "庚", "正官": "辛", "偏印": "壬", "正印": "癸" },
		"乙": { "比肩": "乙", "劫财": "甲", "食神": "丁", "伤官": "丙", "偏财": "己", "正财": "戊", "七杀": "辛", "正官": "庚", "偏印": "癸", "正印": "壬" },
		"丙": { "比肩": "丙", "劫财": "丁", "食神": "戊", "伤官": "己", "偏财": "庚", "正财": "辛", "七杀": "壬", "正官": "癸", "偏印": "甲", "正印": "乙" },
		"丁": { "比肩": "丁", "劫财": "丙", "食神": "己", "伤官": "戊", "偏财": "辛", "正财": "庚", "七杀": "癸", "正官": "壬", "偏印": "乙", "正印": "甲" },
		"戊": { "比肩": "戊", "劫财": "己", "食神": "庚", "伤官": "辛", "偏财": "壬", "正财": "癸", "七杀": "甲", "正官": "乙", "偏印": "丙", "正印": "丁" },
		"己": { "比肩": "己", "劫财": "戊", "食神": "辛", "伤官": "庚", "偏财": "癸", "正财": "壬", "七杀": "乙", "正官": "甲", "偏印": "丁", "正印": "丙" },
		"庚": { "比肩": "庚", "劫财": "辛", "食神": "壬", "伤官": "癸", "偏财": "甲", "正财": "乙", "七杀": "丙", "正官": "丁", "偏印": "戊", "正印": "己" },
		"辛": { "比肩": "辛", "劫财": "庚", "食神": "癸", "伤官": "壬", "偏财": "乙", "正财": "甲", "七杀": "丁", "正官": "丙", "偏印": "己", "正印": "戊" },
		"壬": { "比肩": "壬", "劫财": "癸", "食神": "甲", "伤官": "乙", "偏财": "丙", "正财": "丁", "七杀": "戊", "正官": "己", "偏印": "庚", "正印": "辛" },
		"癸": { "比肩": "癸", "劫财": "壬", "食神": "乙", "伤官": "甲", "偏财": "丁", "正财": "丙", "七杀": "己", "正官": "戊", "偏印": "辛", "正印": "庚" }
	}
	switch (type) {
		case 'wuxing':
			return wuxinglist[str];
			break;
		case 'ele':
			return eleMap[str];
			break;
		default:
			const keysWithValue = Object.entries(wuxinglist[str])
				.filter(([_, value]) => value === type)
				.map(([key, value]) => key);

			return keysWithValue.toString();
			break;
	}
}


//随便给一个天干，得到天干的十神 
export const getGanShiShen = (Daygan: string, gan: string) => {
	return LunarUtil.SHI_SHEN[Daygan + gan]
}

//随便给一个地支，返回地支隐藏的十神的数组，第一个可以用数组来表示
export const getHideGan = (zhi: string) => {
	return LunarUtil.ZHI_HIDE_GAN[zhi];
}


// 得到任意干支的纳音
export const getNaYinByGanZhi = (ganzhi: string) => {
	return LunarUtil.NAYIN[ganzhi];
}

// 得到任意干支的空亡
export const getXunKongByGanzhi = (ganzhi: string) => {
	// return LunarUtil.XUN_KONG[ganzhi];
	// this._getDiShi(this._p.lunar.getTimeZhiIndex()
	return LunarUtil.XUN_KONG[LunarUtil.getXunIndex(ganzhi)];
}




//随便给一个地支，返回地支隐藏的十神的数组，第一个可以用数组来表示
export const getHideGanShiShen = (Daygan: string, zhi: string) => {
	let dHideGan: string[] = LunarUtil.ZHI_HIDE_GAN[zhi];
	let dShiShenZhi = [];
	if (dHideGan) {
		let size = dHideGan.length;
		for (var x = 0, y = size; x < y; x++) {
			dShiShenZhi.push(LunarUtil.SHI_SHEN[Daygan + dHideGan[x]]);
		}
	}
	return dShiShenZhi;
}

// ===== 已提取到 transform/dayun-loop.ts =====
export { getDaYunLiuNianLoopData } from './transform/dayun-loop';



export const getGanZhiHe = (ganzhi: string): boolean => {

	let ganHeArray = ['甲己', '乙庚', '丙辛', '丁壬', '戊癸', '巳申', '辰酉', '卯戌', '寅亥', '子丑', '午未']


	const isGanHeFlag = (str1: string, str2: string): boolean => {
		return (ganHeArray.includes(str1 + str2) || ganHeArray.includes(str2 + str1));
	};

	return isGanHeFlag(ganzhi[0], ganzhi[1]);
}


// 计算一个数组中的元素的个数 ，用法如下 
// const myArray = ['apple', 'banana', 'apple', 'orange', 'banana', 'apple'];
// const counts = countArrayElements(myArray);
// for (const [key, value] of counts) {
//   console.log(`${key}:$
// {value}`);
// }
export function countArrayElements(arr: any[]): Map<any, number> {
	const elementCounts = new Map<any, number>();

	for (const element of arr) {
		if (elementCounts.has(element)) {
			elementCounts.set(element, elementCounts.get(element)! + 1);
		} else {
			elementCounts.set(element, 1);
		}
	}
	return elementCounts;
}




//输入日干，得到财星列表，返回一个数组，前2个是天干的财星，后2个是地支的财星（甲乙是返回4个,因为地支有4个土)
export function getCaiXing(DayGan: string) {
	const cailist: ObjInterface = {
		'甲': ['己', '戊', '辰', '戌', '丑', '未'],
		'乙': ['戊', '己', '丑', '未', '辰', '戌'],
		'丙': ['辛', '庚', '申', '酉'],
		'丁': ['庚', '辛', '酉', '申'],
		'戊': ['癸', '壬', '子', '亥'],
		'己': ['壬', '癸', '亥', '子'],
		'庚': ['乙', '甲', '卯', '寅'],
		'辛': ['甲', '乙', '寅', '卯'],
		'壬': ['丁', '丙', '午', '巳'],
		'癸': ['丙', '丁', '巳', '午']
	}
	return cailist[DayGan];
}

// 得到文昌星 
// '甲巳', '乙午', '丙申', '丁酉', '戊申', '己酉', '庚亥', '辛子', '壬寅', '癸卯'
export function getWenChang(DayGan: string) {
	const datamap = {
		'甲': '巳',
		'乙': '午',
		'丙': '申',
		'丁': '酉',
		'戊': '申',
		'己': '酉',
		'庚': '亥',
		'辛': '子',
		'壬': '寅',
		'癸': '卯',
	}
	return datamap[DayGan];
}

export function getCaiXingWuXing(DayGanWuxing: string) {
	const cailist: ObjInterface = {
		'木': '土',
		'火': '金',
		'土': '水',
		'金': '木',
		'水': '火',
	}
	return cailist[DayGanWuxing];
}

// 取得财库什么 
export function getCaiKuEls(DayGanWuxing: string) {
	const cailist: ObjInterface = {
		'木': '戌',
		'火': '丑',
		'土': '辰',
		'金': '未',
		'水': '戌',
	}
	return cailist[DayGanWuxing];
}

// 看看是什么库 
export function getKuInfoByKuEls(DayGanWuxing: string) {
	const cailist: ObjInterface = {
		辰: ['水'],
		戌: ['火', '土'],
		丑: ['金'],
		未: ['木'],
	}
	return cailist[DayGanWuxing];
}








export function getYinXingWuXing(DayGanWuxing: string) {
	const cailist: ObjInterface = {
		'木': '水',
		'火': '木',
		'土': '火',
		'金': '土',
		'水': '金',
	}
	return cailist[DayGanWuxing];
}

export function getShiShangXingWuXing(DayGanWuxing: string) {
	const cailist: ObjInterface = {
		'木': '火',
		'火': '土',
		'土': '金',
		'金': '水',
		'水': '木',
	}
	return cailist[DayGanWuxing];
}

export function getGuanXingWuXing(DayGanWuxing: string) {
	const cailist: ObjInterface = {
		'木': '金',
		'火': '水',
		'土': '木',
		'金': '火',
		'水': '土',
	}
	return cailist[DayGanWuxing];
}



export function getShiShang(DayGan: string) {
	const ShiShangelist: ObjInterface = {
		'甲': ['丙', '丁', '巳', '午'], // 甲木生丙火（食神），甲木生丁火（伤官）  
		'乙': ['丁', '丙', '午', '巳'], // 乙木生丁火（食神），乙木生丙火（伤官），但通常乙木以丙火为伤官，丁火为食神（因为乙木为阴，丁火也为阴，同性相生力度小，故为食神）  
		'丙': ['戊', '己', '辰', '戌', '丑', '未'], // 丙火生戊土（食神），丙火生己土（伤官）  
		'丁': ['己', '戊', '丑', '未', '辰', '戌',], // 丁火生己土（食神），丁火生戊土（伤官），但通常丁火以戊土为伤官，己土为食神（因为丁火为阴，己土也为阴）  
		'戊': ['庚', '辛', '申', '酉'], // 戊土生庚金（食神），戊土生辛金（伤官）  
		'己': ['辛', '庚', '酉', '申'], // 己土生辛金（食神），己土生庚金（伤官），但通常己土以庚金为伤官，辛金为食神（因为己土为阴，辛金也为阴）  
		'庚': ['壬', '癸', '亥', '子'], // 庚金生壬水（食神），庚金生癸水（伤官）  
		'辛': ['癸', '壬', '子', '亥'], // 辛金生癸水（食神），辛金生壬水（伤官），但通常辛金以壬水为伤官，癸水为食神（因为辛金为阴，癸水也为阴）  
		'壬': ['甲', '乙', '寅', '卯'], // 壬水生甲木（食神），壬水生乙木（伤官）  
		'癸': ['乙', '甲', '卯', '寅']  // 癸水生乙木（食神），癸水生甲木（伤官），但通常癸水以甲木为伤官，乙木为食神（因为癸水为阴，乙木也为阴）  
	}
	return ShiShangelist[DayGan];
}

// 将两个数组合并成一个不重复的数组 

export function mergeUniqueArray<T>(arr1: T[], arr2: T[]): T[] {
	return [...new Set([...arr1, ...arr2])];
}

// 格式化相对日期
export const formatRelativeDate = (dateStr: string | number): string => {
	if (!dateStr) return '';
	const date = dayjs(dateStr);
	const now = dayjs();
	const diffDays = now.diff(date, 'day');

	if (diffDays === 0) return '今天';
	if (diffDays === 1) return '昨天';
	if (diffDays < 365) return `${diffDays}天前`;
	return date.format('YYYY-MM-DD');
};
